{"dic": {"2015": {"3": {"3": {"10:59:02": {"https://www.huffpost.com/entry/finishing-one-year--start_b_6404770": {"headline": "Finishing One Year and Starting Another With The Hold Steady", "section": "THE BLOG", "tags": ["BROOKLYN", "NEW YORK", "NYE"], "summary": "Australia may be the first country to ring in a New Year but New York will always be the epicenter of New Year's Eve festivities. If you want to struggle in Times Square and wait like cattle going to slaughter and pack in the cold to watch the ball drop or go to an expensive club or bar.", "author": "Salvatore Bono", "text": "Australia may be the first country to ring in a New Year but New York will always be the epicenter of New Year's Eve festivities. If you want to struggle in Times Square and wait like cattle going to slaughter and pack in the cold to watch the ball drop or go to an expensive club or bar, a house party with friends, the possibilities are endless, but, there is always the music. The concerts in New York on New Year's Eve are never scarce. From massive venues like Barclays Center and Madison Square Garden to intimate clubs like Bowery Electric, Bowery Ballroom, St. Vitus, and everything in between. This year, The Hold Steady threw a killer New Year's party at Music Hall of Williamsburg to close out one of their biggest and best years but to also celebrate the 45th birthday of bassist Galen Polivka. The band cheeky advertised the gig as \"Celebrate Galen Polivka's Birthday (And Another Holiday),\" and it was perfect. \"We are The Hold Steady. This is New Year's Eve. It is Galen's Birthday and in honor of that I am wearing ska attire,\" singer Craig Finn told the sold-out crowd as he wore a newsboy cap, black blazer, black shirt, black slacks and a checker tie. The band jumped into \"I Hope This Whole Thing Didn't Frighten You,\" the first song and single off 2014's Teeth Dreams record. It was a massive year for the band, they played over 120 concerts, opened for their heroes The Replacements, released a critically acclaimed album and celebrated 11 years together. The Brooklyn band has a special relationship with Music Hall of Williamsburg, it was the very first venue they ever played in as a band in January 2003, back then, the place was known as North Sixth, so when The Hold Steady return to the place where it all started, fans can expect one of the best gigs they will attend. It was a rock and roll party that fans wanted, it was also the setlist that fans needed and a selection of tracks that made this gig special for everyone in the room. After all, The Hold Steady are a band of the people, they don't look like rock stars, they don't act like rock stars, they are fans of rock music that have enjoyed a successful ride and love the fact that they get to share it with the people who come out to their shows. In a setlist that included favorites like \"Rock Problems,\" \"Party Pit,\" \"Your Little Hoodrat Friend,\" \"Chips Ahoy!,\" and \"Sequestered in Memphis,\" the band also broke out songs that are rarely played like the tender and heartbreaking \"Citrus,\" and \"Knuckles.\" As their singalong chorus boomed through the room, fans upfront known as \"The Unified Scene\" would chuck confetti in the air and recreate the cover to the band's 2006 breakthrough album, Boys and Girls in America. It became enough of a mess that Wayne Coyne of The Flaming Lips, who is notorious for making much disarray at his gigs, would have been thrilled. As they were on stage for an 75-minutes, they retreated to the wings for a few moments before midnight. Then, as the clock stuck 12, balloons feel from the ceiling, confetti blew from massive fans on the side of the stage and beer was tossed across the room as we said goodbye to another year and said hello to another. The band came back on stage performing the staple, \"Auld Lang Syne,\" before jumping into \"Killer Parties\" and \"Massive Nights.\" Openers and fellow Brooklyn natives, So So Glos came on stage and joined The Hold Steady for a massive jam of The Violent Femmes \"American Music,\" and Elvis Costello's \"What's So Funny About Peace, Love, and Understanding,\" with Polivka taking over lead vocal duties. Then, just before jumping into \"Constructive Summer,\" the whole room sang \"Happy Birthday\" to the bassist who began another year in his life. Around 12:30, the band closed their set with \"Slapped Actress,\" and in typical Hold Steady fashion finished the song by declaring that to audience \"We are all The Hold Steady.\" As we enter another year and craft resolutions that we hope to hold on to, this was one hell of a way to close the books on 2014 and get the New Year off to the right start. A Version Of This Review Appears On Officially A Yuppie"}}}}}}, "unable_to_load_urls": [], "non_usable_urls": []}