[
  {
    "url": "https://www.huffpost.com/entry/5-moves-trump-made-this-year-when-you-werent-looking_n_5a46aa65e4b0dc1b8257700d",
    "published_date": "2017-12-29T20:47:57Z",
    "author": "HuffPost Video",
    "title": "5 Political Moves Trump Made This Year That Flew Under The Radar",
    "text": "HuffPost Video",
    "month": "2017-12",
    "data$month": "2017-12"
  },
  {
    "url": "https://www.huffpost.com/entry/actor-tj-miller-accused-of-sexual-assault_n_5a3991f7e4b0e68b2d64eb70",
    "published_date": "2017-12-19T22:23:16Z",
    "author": "HuffPost Video",
    "title": "Actor T.J. Miller Accused Of Sexual Assault",
    "text": "HuffPost Video",
    "month": "2017-12",
    "data$month": "2017-12"
  },
  {
    "url": "https://www.huffpost.com/entry/could-the-us-pass-the-eus-democracy-test_b_5a498384e4b0b0e5a7a78195",
    "published_date": "2017-12-31",
    "author": "robert kuttner",
    "title": "Could The U.S. Pass The EU’s Democracy Test?",
    "text": "You’ve probably read that the European Union, after years of trying to duck the plain reality of Poland and Hungary ceasing to be democracies, has taken the first step towards denying Poland a vote in the European Commission. The EU’s basic treaty requires its members first and foremost to be democracies. Here’s the backstory. Since Poland’s Law and Justice Party took power in 2015, the Polish ultra-nationalist leader, Jaroslaw Kaczynski, has felt stymied by the independent judiciary. In July 2017, the government drafted legislation to give Kaczynski control of the courts. Other EU leaders warned of dire consequences, and Poland’s President, Andrzej Duda, a close ally of the government, surprised all by refusing the sign the law. Cynics said this was just a ploy to buy some time for a kinder, gentler version of the same scheme ― and they were right. The government went back the drawing board and drafted new legislation. The original law vetoed by Duda simply got rid of the entire Supreme Court. The new law requires judges to retire at 65, which effectively gives the governing party control of a majority of all judges. The new law also revises the process for selecting judges, giving more control to the lower house of Parliament, which is controlled by the governing party. This time, Duda signed it. The EU, which has repeatedly violated the sovereignty of member nations for the sin of running deficits, and extracted severe punishments that resulted in deeper economic collapse, has been extremely timid about enforcing Article 7 of the EU’s founding treaty, which requires all members to be democracies. This kind of tells you where the EU’s real priorities are. And in Hungary, when the ruling Fidesz party gerrymandered legislative districts, giving the governing party a two-thirds majority in parliament and effectively making it impossible for the opposition to come to power, the EU leadership did nothing (apparently, killing democracy is less of a crime than running deficits.) Hungary’s leader, Viktor Orban, also expanded the size of the Supreme Court, so that he could control it. Up until now, the EU has not moved against either Hungary or Poland. But last week the EU’s leaders took the first step towards invoking sanctions under Article 7, the most serious of which would be to deprive Poland of a vote. Poland would continue to have all of the other benefits of EU membership. This new courage on the part of Brussels, however belated and tentative, is an important step. But I wonder: If the United States were subjected to these tests, could it pass? Take the case of gerrymandering. In 2012, states controlled by Republican legislatures and governors resorted to extreme gerrymandering, so that Republicans begin with a head start of 20 to 25 seats in the U.S. House of Representatives, relative to their share of the popular vote. Hungary, in rendering democracy purely formalistic, could learn a trick or two from the GOP. And where courts are concerned, the Polish government is pretty tame compared to Republican Senate Leader Mitch McConnell. For the last six years of President Obama’s administration, when Republicans controlled the Senate, McConnell slow-rolled Obama’s judicial appointees, leaving a federal bench that will be controlled by Republican judges for a generation or more. McConnell disgracefully blocked consideration of Obama’s nomination of Merrick Garland, an ideological moderate, to the Supreme Court. Thanks to this strategy of total blockage, when Trump took office there were 105 vacancies on the federal judicial bench, compared to just 54 when Obama took office. So courts and legislative districts are increasingly rigged, just as in Poland and Hungary. The United States is still a democracy ― but a narrowed one. The revulsion against Trump is so broad and deep, that we have a good shot at repairing the several elements that the Republicans have sought to destroy. Trump gets most of the attention as a would-be dictator. But the “mainstream” Republican Party properly deserves most of the blame. Robert Kuttner is co-editor of The American Prospect and professor at Brandeis University’s Heller School. His forthcoming book is Can Democracy Survive Global Capitalism? http://books.wwnorton.com/books/detail.aspx?ID=4294994519 Like Robert Kuttner on Facebook: http://facebook.com/RobertKuttner Follow Robert Kuttner on Twitter: www.twitter.com/rkuttner By entering your email and clicking Sign Up, you're agreeing to let us send you customized marketing messages about us and our advertising partners. You are also agreeing to our Terms of Service and Privacy Policy.",
    "month": "2017-12",
    "data$month": "2017-12"
  },
  {
    "url": "https://www.huffpost.com/entry/festive-tradition-or-date-rape-anthem_n_5a3841cce4b055fc5fb2b187",
    "published_date": "2017-12-18T22:29:03Z",
    "author": "HuffPost Video",
    "title": "'Baby, It's Cold Outside': Festive Tradition Or Date Rape Anthem?",
    "text": "HuffPost Video",
    "month": "2017-12",
    "data$month": "2017-12"
  },
  {
    "url": "https://www.huffpost.com/entry/furry-cookiethief-goes-nuts_n_5a49aa6ee4b0b0e5a7a79b27",
    "published_date": "2017-12-31",
    "author": "mary papenfuss",
    "title": "Crazed Furry Cookie Thief Goes Squirrelly On Cops",
    "text": "Police officers in the New York village of Brockport were prepared for just about anything when they were called about a ferocious cookie thief in a neighborhood home last week. Body cameras switched on, they stepped carefully into the kitchen and instantly spotted a furtive shape plummet from a cabinet. Suddenly, Rocky the flying squirrel slammed directly into one of the officers before skittering down the hall — then bopped back into the kitchen. No harm done. The cops were laughing uproariously. Rocky was eventually captured — and released back into the great outdoors of Brockport unharmed. “Brockport police will always go the extra mile to help their residents,” the department quipped on its Facebook page. One citizen responded: “Wild.” By entering your email and clicking Sign Up, you're agreeing to let us send you customized marketing messages about us and our advertising partners. You are also agreeing to our Terms of Service and Privacy Policy.",
    "month": "2017-12",
    "data$month": "2017-12"
  },
  {
    "url": "https://www.huffpost.com/entry/kim-jong-un-new-years-speech-nuclear-weapons_n_5a499d93e4b06d1621b9cd95",
    "published_date": "2017-12-31",
    "author": "heekyong yang , josh smith",
    "title": "Kim Jong Un Says He Has A 'Nuclear Button' On His Desk Ready For Use",
    "text": "SEOUL, Jan 1 (Reuters) - Kim Jong Un on Monday warned the United States that he has a “nuclear button” on his desk ready for use if North Korea is threatened, but offered an olive branch to South Korea, saying he was “open to dialogue” with Seoul. After a year dominated by fiery rhetoric and escalating tensions over North Korea’s nuclear weapons program, Kim used his televised New Year’s Day speech to call for lower military tensions on the Korean peninsula and improved ties with the South. “When it comes to North-South relations, we should lower the military tensions on the Korean Peninsula to create a peaceful environment,” Kim said. “Both the North and the South should make efforts.” Kim said he will consider sending a delegation to the Winter Olympics Games to be held in Pyeongchang, South Korea, in February. “North Korea’s participation in the Winter Games will be a good opportunity to show unity of the people and we wish the Games will be a success. Officials from the two Koreas may urgently meet to discuss the possibility,” Kim said. South Korean President Moon Jae-in has said North Korea’s participation will ensure safety of the Pyeongchang Olympics and proposed last month that Seoul and Washington postpone large military drills that the North denounces as a rehearsal for war until after the Games. Rather than encouraging U.S. measures that “threaten the security and peace of the Korean peninsula,” Seoul should instead respond to overtures from the North, Kim said. A spokesperson for Moon’s office said they were still reviewing Kim’s New Year’s Day speech. Asked by reporters to comment on Kim’s speech, U.S. President Donald Trump simply said “we’ll see, we’ll see,” as he walked into New Year’s eve celebration at Mar-a-Lago, his elite resort in Florida. The U.S. State Department did not immediately respond to a request for comment on Kim’s New Year’s address. North Korea tested intercontinental ballistic missiles and conducted its sixth and most powerful nuclear test in September in defiance of international warnings and sanctions, raising fears of a new conflict on the Korean peninsula. After testing what Pyongyang said was its most powerful intercontinental ballistic missile (ICBM), capable of delivering a warhead to anywhere in the continental United States, at the end of November, Kim declared his nuclear force complete. He continued that theme in his New Year’s address, announcing that North Korea would focus on “mass producing nuclear warheads and ballistic missiles for operational deployment” in the coming year. This, Kim said, made it impossible for the United States to start a war against North Korea. “The entire United States is within range of our nuclear weapons, and a nuclear button is always on my desk. This is reality, not a threat,” he said, while emphasizing that “these weapons will be used only if our security is threatened.” Kim’s customary New Year’s speech is closely watched for indications of the policy direction the unpredictable and reclusive leader is likely to pursue in the coming year. Beyond listing military accomplishments, Kim also outlined economic gains as part of his two-pronged policy of developing his country’s economy and military. Despite increased international sanctions imposed over the weapons program, North Korea made progress in areas like fabrics, shoes and tractors, Kim said. While Kim is keen to declare his weapons program a success, he is unlikely to completely end his contentious testing regime, said Scott LaFoy, a ballistic missile analyst at the website NK Pro, which monitors North Korea. “I’m still very skeptical of the ‘complete’ thing they’ve been talking about, if only because we’ve seen so much activity in regards to the submarine launched ballistic missile program,” he said. “I think a slowdown (in testing) is very realistic, though.” Kim seems likely to tone down his weapons testing at least ahead of the Olympics, said Nam Sung-wook, a North Korea expert at Korea University in Seoul. Big money interests are running the government — and influencing the news you read. While other outlets are retreating behind paywalls and bending the knee to political pressure, HuffPost is proud to be unbought and unfiltered. Will you help us keep it that way? You can even access our stories ad-free. You've supported HuffPost before, and we'll be honest — we could use your help again. We won't back down from our mission of providing free, fair news during this critical moment. But we can't do it without you. For the first time, we're offering an ad-free experience to qualifying contributors who support our fearless journalism. We hope you'll join us. You've supported HuffPost before, and we'll be honest — we could use your help again. We won't back down from our mission of providing free, fair news during this critical moment. But we can't do it without you. For the first time, we're offering an ad-free experience to qualifying contributors who support our fearless journalism. We hope you'll join us. Already contributed? Log in to hide these messages. “What North Korea is most afraid of is being forgotten in the international arena,” he said. “Without launching missiles and conducting a nuclear test, North Korea will be in the spotlight just by attending the Winter Olympics.” (Additional reporting by Soyoung Kim SEOUL, Yeganeh Torbati in WASHINGTON, and Roberta Rampton in WEST PALM BEACH, Florida. Editing by Kim Coghill and Michael Perry) By entering your email and clicking Sign Up, you're agreeing to let us send you customized marketing messages about us and our advertising partners. You are also agreeing to our Terms of Service and Privacy Policy.",
    "month": "2017-12",
    "data$month": "2017-12"
  },
  {
    "url": "https://www.huffpost.com/entry/lawyers-calming-trump-sohewont-fire-mueller_n_5a498fc5e4b025f99e1c844e",
    "published_date": "2017-12-31",
    "author": "mary papenfuss",
    "title": "Carl Bernstein: Lawyers 'Telling Trump What He Wants To Hear' So He Won't Fire Mueller",
    "text": "Donald Trump’s lawyers are trying to keep the “out of control” president calm so he won’t fire special counsel Robert Mueller, Watergate journalist Carl Bernstein said on CNN. “There are many times [Trump] has expressed, I’m told by people in the White House, the desire to fire Mueller, the desire to pardon people under investigation, including his family,” Bernstein said Sunday on CNN’s “State of the Union,” citing unnamed sources. “His lawyers are telling him what he wants to hear — that’s what I’m told by lawyers in the White House ... to keep him from acting precipitously and to go off and fire Mueller in a rage, or fire Rod Rosenstein, the deputy attorney general, in a rage. They have an out of control client.” The “president of the United States, in their view, is out of control a good deal of the time, especially when it comes to this investigation,” Bernstein added. Trump has said he won’t fire Mueller, but it’s still difficult to predict what he will actually do. “There’s no reason to believe almost anything Donald Trump says because what we know is that the president of the United States and his presidency is characterized above all else by the lying of the president of the United States,” said Bernstein. Bernstein said Trump’s treatment of the press is similar to Richard Nixon’s during the Watergate scandal — but with an additional step. “Nixon in Watergate tried to make the conduct of the press the issue instead of the conduct of the president and the men around him,” Bernstein said. “Donald Trump has gone even further; he’s tried to undermine the credibility of the press as a national institution, to the detriment of the country, by these broad attacks on the press.” Big money interests are running the government — and influencing the news you read. While other outlets are retreating behind paywalls and bending the knee to political pressure, HuffPost is proud to be unbought and unfiltered. Will you help us keep it that way? You can even access our stories ad-free. You've supported HuffPost before, and we'll be honest — we could use your help again. We won't back down from our mission of providing free, fair news during this critical moment. But we can't do it without you. For the first time, we're offering an ad-free experience to qualifying contributors who support our fearless journalism. We hope you'll join us. You've supported HuffPost before, and we'll be honest — we could use your help again. We won't back down from our mission of providing free, fair news during this critical moment. But we can't do it without you. For the first time, we're offering an ad-free experience to qualifying contributors who support our fearless journalism. We hope you'll join us. Already contributed? Log in to hide these messages. Hear the rest of Bernstein’s interview in the clip above. By entering your email and clicking Sign Up, you're agreeing to let us send you customized marketing messages about us and our advertising partners. You are also agreeing to our Terms of Service and Privacy Policy.",
    "month": "2017-12",
    "data$month": "2017-12"
  },
  {
    "url": "https://www.huffpost.com/entry/new-years-2018-photos-around-the-world_n_5a4986ade4b0b0e5a7a78200",
    "published_date": "2017-12-31",
    "author": "annum masroor",
    "title": "Incredible New Year's Celebrations Around The World",
    "text": "From the London Eye to Athens’ Acropolis, here are some of the most breathtaking scenes from New Year’s celebrations around the world.",
    "month": "2017-12",
    "data$month": "2017-12"
  },
  {
    "url": "https://www.huffpost.com/entry/obama-is-most-admired-man-in-america_n_5a441fcee4b07746bd4ff752",
    "published_date": "2017-12-27T22:32:04Z",
    "author": "HuffPost Video",
    "title": "No Surprise Here: Obama Polls As America's Most Admired Man For 10th Year In A Row",
    "text": "HuffPost Video",
    "month": "2017-12",
    "data$month": "2017-12"
  },
  {
    "url": "https://www.huffpost.com/entry/terrigal-fireworks-barge-explodes_n_5a496829e4b025f99e1c74ec",
    "published_date": "2017-12-31",
    "author": "mary papenfuss",
    "title": "Fireworks Barge Explodes In Australia, Forcing Beach Evacuation",
    "text": "Glad the two men are ok #Terrigal fireworks, was great up until. pic.twitter.com/fa8EXDE9iP A spectacular fireworks display off an Australian beach on New Year’s Eve turned from thrills to horror when a fireworks barge exploded in flames Two technicians on the barge dove into the water amid the shuddering eruption five minutes into the fireworks display off Terrigal Beach about 40 miles north of Sydney. They suffered only minor injuries and were treated on the scene by paramedics. The moment the barge of fireworks exploded at Terrigal pic.twitter.com/3MDm60XW3Y Thousands of people watching on the beach were evacuated, the Newcastle Herald reported. “The fireworks were going off as you’d expect and then suddenly there was a hell of an explosion. Next thing the barge was on fire,” a Terrigal resident told The Sydney Morning Herald. Many spectators were initially unsure about what had happened. After the explosion, all of the fireworks suddenly erupted uncontrollably, even shooting into the crowd, as the barge burned. Some spectators laughed and cheered while others, realizing what had happened, screamed and ran. Was front row at Terrigal fireworks was the worst experience ever.... Terrigal has been evacuated... hope no one is injured... #HappyNewYear #terrigal Caught the moment of the explosion and the barge caught on fire. Everyone started screaming and running while evacuating after this. damn terrigal fireworks 😂 #NYE pic.twitter.com/VfJGLxYfnh Big money interests are running the government — and influencing the news you read. While other outlets are retreating behind paywalls and bending the knee to political pressure, HuffPost is proud to be unbought and unfiltered. Will you help us keep it that way? You can even access our stories ad-free. You've supported HuffPost before, and we'll be honest — we could use your help again. We won't back down from our mission of providing free, fair news during this critical moment. But we can't do it without you. For the first time, we're offering an ad-free experience to qualifying contributors who support our fearless journalism. We hope you'll join us. You've supported HuffPost before, and we'll be honest — we could use your help again. We won't back down from our mission of providing free, fair news during this critical moment. But we can't do it without you. For the first time, we're offering an ad-free experience to qualifying contributors who support our fearless journalism. We hope you'll join us. Already contributed? Log in to hide these messages. A post shared by Craig Dungey 🇦🇺 (@craig.dungey) on Dec 31, 2017 at 3:42am PST It was the first time the fireworks display was resurrected after years with no show. It was organized by the owner of the Terrigal Surf Club who raised money to put on the display and spent much of the year getting the proper permits and insurance, the Herald reported. By entering your email and clicking Sign Up, you're agreeing to let us send you customized marketing messages about us and our advertising partners. You are also agreeing to our Terms of Service and Privacy Policy.",
    "month": "2017-12",
    "data$month": "2017-12"
  },
  {
    "url": "https://www.huffpost.com/entry/the-merchants-of-death-survive-and-prosper_b_5a49b073e4b06cd2bd03e159",
    "published_date": "2017-12-31",
    "author": "lawrence wittner",
    "title": "The 'Merchants Of Death' Survive And Prosper",
    "text": "During the mid-1930s, a best-selling exposé of the international arms trade, combined with a U.S. Congressional investigation of munitions-makers led by Senator Gerald Nye, had a major impact on American public opinion. Convinced that military contractors were stirring up weapons sales and war for their own profit, many people grew critical of these “merchants of death.” Today, some eight decades later, their successors, now more politely called “defense contractors,” are alive and well. According to a study by the Stockholm International Peace Research Institute, sales of weapons and military services by the world’s largest 100 corporate military purveyors in 2016 (the latest year for which figures are available) rose to $375 billion. U.S. corporations increased their share of that total to almost 58 percent, supplying weapons to at least 100 nations around the world. The dominant role played by U.S. corporations in the international arms trade owes a great deal to the efforts of U.S. government officials. “Significant parts of the government,” notes military analyst William Hartung, “are intent on ensuring that American arms will flood the global market and companies like Lockheed and Boeing will live the good life. From the president on his trips abroad to visit allied world leaders to the secretaries of state and defense to the staffs of U.S. embassies, American officials regularly act as salespeople for the arms firms.” Furthermore, he notes, “the Pentagon is their enabler. From brokering, facilitating, and literally banking the money from arms deals to transferring weapons to favored allies on the taxpayers’ dime, it is in essence the world’s largest arms dealer.” In 2013, when Tom Kelly, the deputy assistant secretary of the State Department’s Bureau of Political Affairs was asked during a Congressional hearing about whether the Obama administration was doing enough to promote American weapons exports, he replied: “[We are] advocating on behalf of our companies and doing everything we can to make sure that these sales go through. . . and that is something we are doing every day, basically [on] every continent in the world . . . and we’re constantly thinking of how we can do better.” This proved a fair enough assessment, for during the first six years of the Obama administration, U.S. government officials secured agreements for U.S. weapons sales of more than $190 billion around the world, especially to the volatile Middle East. Determined to outshine his predecessor, President Donald Trump, on his first overseas trip, bragged about a $110 billion arms deal (totaling $350 billion over the next decade) with Saudi Arabia. The greatest single weapons market remains the United States, for this country ranks first among nations in military spending, with 36 percent of the global total. Trump is a keen military enthusiast, as is the Republican Congress, which is currently in the process of approving a 13 percent increase in the already astronomical U.S. military budget. Much of this future military spending will almost certainly be devoted to purchasing new and very expensive high-tech weapons, for the military contractors are adept at delivering millions of dollars in campaign contributions to needy politicians, employing 700 to 1,000 lobbyists to nudge them along, claiming that their military production facilities are necessary to create jobs, and mobilizing their corporate-funded think tanks to highlight ever-greater foreign “dangers.” They can also count upon a friendly reception from their former executives now holding high-level posts in the Trump administration, including: Secretary of Defense James Mattis (a former board member of General Dynamics); White House Chief of Staff John Kelly (previously employed by several military contractors); Deputy Secretary of Defense Patrick Shanahan (a former Boeing executive); Secretary of the Army Mark Esper (a former Raytheon vice president); Secretary of the Air Force Heather Wilson (a former consultant to Lockheed Martin); Undersecretary of Defense for Acquisition Ellen Lord (a former CEO of an aerospace company); and National Security Council Chief of Staff Keith Kellogg (a former employee of a major military and intelligence contractor). This formula works very well for U.S. military contractors, as illustrated by the case of Lockheed Martin, the largest arms merchant in the world. In 2016, Lockheed’s weapons sales rose by almost 11 percent to $41 billion, and the company is well on its way to even greater affluence thanks to its production of the F-35 fighter jet. Lockheed began work on developing the technologically-advanced warplane in the 1980s and, since 2001, the U.S. government has expended over $100 billion for its production. Today, estimates by military analysts as to the total cost to taxpayers of the 2,440 F-35s desired by Pentagon officials range from $1 trillion to $1.5 trillion, making it the most expensive procurement program in U.S. history. Big money interests are running the government — and influencing the news you read. While other outlets are retreating behind paywalls and bending the knee to political pressure, HuffPost is proud to be unbought and unfiltered. Will you help us keep it that way? You can even access our stories ad-free. You've supported HuffPost before, and we'll be honest — we could use your help again. We won't back down from our mission of providing free, fair news during this critical moment. But we can't do it without you. For the first time, we're offering an ad-free experience to qualifying contributors who support our fearless journalism. We hope you'll join us. You've supported HuffPost before, and we'll be honest — we could use your help again. We won't back down from our mission of providing free, fair news during this critical moment. But we can't do it without you. For the first time, we're offering an ad-free experience to qualifying contributors who support our fearless journalism. We hope you'll join us. Already contributed? Log in to hide these messages. The F-35’s enthusiasts have justified the enormous expense of the warplane by emphasizing its projected ability to make a quick liftoff and a vertical landing, as well as its adaptability for use by three different branches of the U.S. military. And its popularity might also reflect their assumption that its raw destructive power will help them win future wars against Russia and China. “We can’t get into those aircraft fast enough,” Lieutenant General Jon Davis, the Marine Corps’ aviation chief, told a House Armed Services subcommittee in early 2017. “We have a game changer, a war winner, on our hands.” Even so, aircraft specialists point out that the F-35 continues to have severe structural problems and that its high-tech computer command system is vulnerable to cyberattack. “This plane has a long way to go before it’s combat-ready,” remarked a military analyst at the Project on Government Oversight. “Given how long it’s been in development, you have to wonder whether it’ll ever be ready.” Startled by the extraordinary expense of the F-35 project, Donald Trump initially derided the venture as “out of control.” But, after meeting with Pentagon officials and Lockheed CEO Marilynn Hewson, the new president reversed course, praising “the fantastic” F-35 as a “great plane” and authorizing a multi-billion dollar contract for 90 more of them. In retrospect, none of this is entirely surprising. After all, other giant military contractors―for example, Nazi Germany’s Krupp and I.G. Farben and fascist Japan’s Mitsubishi and Sumitomo ―prospered heavily by arming their nations for World War II and continued prospering in its aftermath. As long as people retain their faith in the supreme value of military might, we can probably also expect Lockheed Martin and other “merchants of death” to continue profiting from war at the public’s expense. [Lawrence Wittner (http://www.lawrenceswittner.com) is Professor of History emeritus at SUNY/Albany and the author of Confronting the Bomb (Stanford University Press).] By entering your email and clicking Sign Up, you're agreeing to let us send you customized marketing messages about us and our advertising partners. You are also agreeing to our Terms of Service and Privacy Policy.",
    "month": "2017-12",
    "data$month": "2017-12"
  },
  {
    "url": "https://www.huffpost.com/entry/times-square-ball-drop-new-years-eve_n_5a498247e4b06d1621b9b5d6",
    "published_date": "2017-12-31",
    "author": "nick visser",
    "title": "How To Watch The Times Square Ball Drop Online On New Year's Eve",
    "text": "If you’re not in New York City braving frigid temperatures to ring in the New Year, the official Times Square webcast will broadcast the night’s festivities until the ball drops at the stroke of midnight. Performances throughout the evening include acts by Mariah Carey, Camila Cabello and Nick Jonas. Tarana Burke, founder of the #MeToo movement, will join New York City Mayor Bill de Blasio to drop the ball at 11:59 p.m. Watch the live stream from 6 p.m. to 12:15 a.m. above. By entering your email and clicking Sign Up, you're agreeing to let us send you customized marketing messages about us and our advertising partners. You are also agreeing to our Terms of Service and Privacy Policy.",
    "month": "2017-12",
    "data$month": "2017-12"
  }
]
