[
  {
    "url": "https://www.huffpost.com/entry/kate-walsh-talks-13-reasons-why-on-build_n_6110b308e4b0ed63e65582ad",
    "published_date": "2017-04-24T14:36:56Z",
    "author": "Ishita Singh",
    "title": "Kate Walsh Talks '13 Reasons Why' On BUILD",
    "text": "Senior Programming Manager, HuffPost Video",
    "sentiment_val": 0,
    "month": "2017-04",
    "data$month": "2017-04"
  },
  {
    "url": "https://www.huffpost.com/entry/11-month-old-girl-has-full-head-of-hair_n_5b4f5988e4b00e8c8eb71887",
    "published_date": "2017-04-05T21:25:36Z",
    "author": "HuffPost Video",
    "title": "11-Month-Old Girl Has Full Head Of Hair",
    "text": "HuffPost Video",
    "month": "2017-04",
    "data$month": "2017-04"
  },
  {
    "url": "https://www.huffpost.com/entry/donald-trump-executive-orders_n_59038bfbe4b02655f83d39c9",
    "published_date": "2017-04-28T18:58:36Z",
    "author": "HuffPost Video",
    "title": "Donald Trump Broke A Record With All His Executive Orders",
    "text": "HuffPost Video",
    "month": "2017-04",
    "data$month": "2017-04"
  },
  {
    "url": "https://www.huffpost.com/entry/celebrity-look-alikes-doppelganger_n_58f8f285e4b06b9cb914b0b9",
    "published_date": "2017-04-20T17:52:31Z",
    "author": "HuffPost Video",
    "title": "These Celeb Doppelgängers Will Make You Do A Double Take",
    "text": "HuffPost Video",
    "month": "2017-04",
    "data$month": "2017-04"
  },
  {
    "url": "https://www.huffpost.com/entry/what-is-difference-organic-milk_n_58ff3b5de4b0288f5dc7d949",
    "published_date": "2017-04-27T18:53:10Z",
    "author": "Julie R. Thomson",
    "title": "Experts Explain The Real Difference Between Organic And Non-Organic Milk",
    "text": "“Milk is an emotional product.” Theresa Marquez, the mission executive at Organic Valley, hit the nail right on the head. Whenever people talk about milk, and their choices in regards to this dairy product, it gets very personal, very quickly. Whether you were breast-fed or formula-fed, many of us transitioned to dairy milk as soon as we were toddlers. So it’s understandable that we hold it near and dear to our hearts, even if we drink almond milk or coconut milk today. One of the key questions these days is whether we should hand over the extra cash for organic milk. It’s important to know exactly what we’re getting when we buy organic milk vs. non-organic milk (which we’ll call “conventional” milk for the purpose of this story). We reached out to experts in both fields to really understand the difference between organic and conventional milk, specifically in terms of antibiotics and hormones. According to strict organic regulations put in place by the USDA, organic milk must come from a cow that has not been treated with antibiotics, has not been given hormones ― for either reproduction or growth ― and has been fed at least 30 percent of its diet on pasture. (That’s the minimum ― farmers in more temperate regions are expected to let their cows graze on pasture for as long as possible.) The rest of the cows’ feed must be grown without chemical fertilizers, pesticides or genetically modified seeds. Conventional milk could be produced in the same way that organic is, but it doesn’t have to be ― it’s not held up to the same strict guidelines. According to the USDA organic guidelines, organic milk comes from a cow that has not been given antibiotics. If a cow at an organic dairy farm does have to be treated with antibiotics, the farmer can no longer use her milk. That’s it. “It’s not that we don’t believe in antibiotics, we’re just going to do everything we can to not use them,” Marquez explains. The main (but not only) reason dairy cows are given antibiotics is to treat or prevent mastitis, an infection in the tissue of the mammary glands that can occur during lactation. But organic farmers believe that mastitis is a fairly genetic problem. In order to prevent the need for antibiotics, organic farmers cull cows with mastitis from the herd, Marquez explained. Marquez shared a story of a farmer who found that culling his herd made it so he only had to administer antibiotics twice in 17 years. Marquez goes on to say, “Farmer after farmer will tell you, ‘Wow, I didn’t think I could do this without antibiotics,’ but we’ve learned to do this.” Conventional milk farmers use antibiotics to treat sick cows, and then use their milk. “These cows only return to their herd when we determine they are healthy and the antibiotics’ withholding time has passed,” Karen Jordan, veterinarian and conventional dairy farmer in Siler, North Carolina, explained to HuffPost. “Consumers can be assured that our country’s milk supply is safe, as it is highly regulated and tested, both at the farm and at the processing plant.” “There are strict standards in place to ensure the milk you buy at the store is safe,” Jordan explains. “Milk is tested for antibiotics at each stage of the delivery process — from the farm, before it is transported and again at the dairy processing facility,” Jordan explains. For Marquez, taking a stand against antibiotics is not about the potential residue that can find its way into milk. She says the real problem with antibiotic use is that “we shouldn’t be giving livestock these antibiotics that create resistance, as these antibiotics could be used for humans.” Marquez explains that “we need [antibiotics] for the human family, for whatever is going to come at us.” One hormone that’s used in some dairy cows is a synthetic bovine growth hormone known as rBST ― though this practice is increasingly less common. “Synthetic bovine growth hormone is sometimes used by some farmers to help their cows produce more milk,” Jordan explains. She assures that “the product has been in use for 20 years, and its safety has been affirmed and reaffirmed by government agencies in the U.S. and around the world.” Marquez believes we don’t need bovine growth hormone, saying the use of this hormone “is just inhumane.” “In fact,” Marquez points out, “do you know that we dumped milk this year in 2016? We dumped it down a drain.” Because of a massive glut in 2016, 43 million gallons worth of milk was dumped in fields, manure lagoons or animal feed, reported the Wall Street Journal. Reproductive hormones, Marquez says, are commonly used in large conventional dairy farms (but not organic farms) to ensure efficient breeding during artificial insemination (AI). AI is common practice in both conventional and organic operations, and it’s expensive. The hormones for reproduction that are used on conventional dairy farms include prostaglandin, gonadotropin releasing hormone and progesterone. They’re hormones naturally produced by the cow during reproduction, but are now injected into them at specific times for a more controlled and efficient reproduction result. “We do AI in organic farming, as well as using bulls the old fashioned way, but we do not use hormones to do that. We have to have healthy cows, and those cows have to be ready to conceive ― it’s a different approach to the whole idea of reproduction in cows,” Marquez says. “We believe we have to use healthy cows that can reproduce naturally. That’s the big difference between conventional and organic.” Here’s the kicker. Even if you like the sound of organic milk, its practices come at a price ― a steep one. Walk into the milk section of any grocery store and you’ll find that organic milk is sometimes double the price of conventional milk. That makes this choice a challenging one for most, and a choice that some people don’t even have the option to make. The reason for the steep price is layered ― the price of organic feed plays a large role, as do the effects of farm subsidies ― and to bridge the gap between the two would require a serious overhaul of our food system. Big money interests are running the government — and influencing the news you read. While other outlets are retreating behind paywalls and bending the knee to political pressure, HuffPost is proud to be unbought and unfiltered. Will you help us keep it that way? You can even access our stories ad-free. You've supported HuffPost before, and we'll be honest — we could use your help again. We won't back down from our mission of providing free, fair news during this critical moment. But we can't do it without you. For the first time, we're offering an ad-free experience to qualifying contributors who support our fearless journalism. We hope you'll join us. You've supported HuffPost before, and we'll be honest — we could use your help again. We won't back down from our mission of providing free, fair news during this critical moment. But we can't do it without you. For the first time, we're offering an ad-free experience to qualifying contributors who support our fearless journalism. We hope you'll join us. Already contributed? Log in to hide these messages. But time might make that change possible, and the most effective way to create change is through consumer education and demand. By entering your email and clicking Sign Up, you're agreeing to let us send you customized marketing messages about us and our advertising partners. You are also agreeing to our Terms of Service and Privacy Policy.",
    "sentiment_val": 0.1605,
    "sentiment_sd": 0.2651,
    "month": "2017-04",
    "data$month": "2017-04"
  },
  {
    "url": "https://www.huffpost.com/entry/neil-gorsuch-sworn-in-as-supreme-court-justice_n_5b4f6776e4b0890b5cce0e35",
    "published_date": "2017-04-10T15:57:38Z",
    "author": "HuffPost Video",
    "title": "Neil Gorsuch Sworn In As Supreme Court Justice",
    "text": "HuffPost Video",
    "month": "2017-04",
    "data$month": "2017-04"
  }
]
