[
  {
    "url": "https://www.huffpost.com/entry/anti-choice-minister-testifies-against-judge-kavanaugh_n_5b92aa48e4b00521db72550c",
    "published_date": "2018-09-07T16:38:27Z",
    "author": "HuffPost Video",
    "title": "Anti-Choice Minister Testifies Against Judge Kavanaugh",
    "text": "HuffPost Video",
    "month": "2018-09",
    "data$month": "2018-09"
  },
  {
    "url": "https://www.huffpost.com/entry/best-hulu-shows_n_5a4d2fafe4b06d1621bcb28d",
    "published_date": "2018-09-14",
    "author": "todd van luling",
    "title": "What To Watch On Hulu That’s New This Week",
    "text": "Streamline recommends “Moonrise Kingdom” as the movie you should watch on Hulu this week. The service adds this on Sept. 16. “Moonrise Kingdom” stars two unknown child actors ― Kara Hayward and Jared Gilman ― along with a notable cast of adults that includes Tilda Swinton, Edward Norton, Bill Murray, Frances McDormand and Bruce Willis. Wes Anderson directed this and co-wrote the screenplay with Roman Coppola. The two children run away and try to make a life for themselves together ― a very twee life. Then the adults start looking for them ― in a very twee way. Although the Anderson aesthetic is kind of out right now during this more hardened, ultra-cynical Donald Trump era, I still love this movie. I think you’ll find much to enjoy whether you’re revisiting it or watching for the first time. You can watch the trailer below. And if you want to stay up to date with what to watch on a weekly basis, subscribe to the Streamline newsletter.  “The Queen” stars Helen Mirren as Queen Elizabeth II. She won an Academy Award for the role. The movie has an impressive 97 percent on Rotten Tomatoes. You might also want to consider “American Horror Series: Cult” since that show just returned with new episodes. This “Cult” season focuses on the aftermath of Donald Trump winning the presidential election, albeit in a fictional way. The full Hulu list for the rest of the week: Sept. 15 Sept. 16 Sept. 18 Sept. 20 Sept. 21 By entering your email and clicking Sign Up, you're agreeing to let us send you customized marketing messages about us and our advertising partners. You are also agreeing to our Terms of Service and Privacy Policy.",
    "month": "2018-09",
    "data$month": "2018-09"
  },
  {
    "url": "https://www.huffpost.com/entry/hp-lta-politifest-event_n_5bacf6a4e4b0b7ccfd5d76f1",
    "published_date": "2018-09-27T15:23:59Z",
    "author": "HuffPost Video",
    "title": "HP LTA - Politifest Event",
    "text": "HuffPost Video",
    "month": "2018-09",
    "data$month": "2018-09"
  },
  {
    "url": "https://www.huffpost.com/entry/the-emmys-mock-their-own-diversity-problem_n_5ba12f74e4b02f2d5ce002b9",
    "published_date": "2018-09-18T16:59:07Z",
    "author": "HuffPost Video",
    "title": "Emmys Mock Their Own Diversity Problem",
    "text": "HuffPost Video",
    "month": "2018-09",
    "data$month": "2018-09"
  },
  {
    "url": "https://www.huffpost.com/entry/trumps-tasteless-911-comments_n_5b97f005e4b0bb0ae0c7c1bf",
    "published_date": "2018-09-11T16:37:55Z",
    "author": "HuffPost Video",
    "title": "A History Of Donald Trump’s Tasteless Comments About 9/11",
    "text": "HuffPost Video",
    "month": "2018-09",
    "data$month": "2018-09"
  }
]
