[
  {
    "url": "https://www.huffpost.com/entry/lisa-page-finally-fires-back-at-trump_n_5de54590e4b02c23f5b06e9d",
    "published_date": "2019-12-02T17:05:06Z",
    "author": "HuffPost Video",
    "title": "Lisa Page Finally Fires Back At Trump",
    "text": "Microbio",
    "month": "2019-12",
    "data$month": "2019-12"
  },
  {
    "url": "https://www.huffpost.com/entry/trumps-hateful-hanukkah_n_5df27503e4b0d968171f0efc",
    "published_date": "2019-12-12T17:09:42Z",
    "author": "HuffPost Video",
    "title": "Trump’s Hateful Hanukkah",
    "text": "Microbio",
    "month": "2019-12",
    "data$month": "2019-12"
  },
  {
    "url": "https://www.huffpost.com/entry/jersey-city-shooting_n_5df000a8e4b0def0656020d3",
    "published_date": "2019-12-10T20:25:33Z",
    "author": "HuffPost Video",
    "title": "Jersey City Shooting",
    "text": "HuffPost Video",
    "month": "2019-12",
    "data$month": "2019-12"
  },
  {
    "url": "https://www.huffpost.com/entry/nancy-pelosi-calls-for-articles-of-impeachment_n_5de917aae4b02c23f5b07178",
    "published_date": "2019-12-05T14:40:14Z",
    "author": "HuffPost Video",
    "title": "Nancy Pelosi Calls For Articles Of Impeachment",
    "text": "Microbio",
    "month": "2019-12",
    "data$month": "2019-12"
  },
  {
    "url": "https://www.huffpost.com/entry/wellness-trends-to-abandon-in-2019_n_5dfbb07ee4b006dceaaaaa48",
    "published_date": "2019-12-19T17:19:36Z",
    "author": "HuffPost Video",
    "title": "Wellness Trends To Abandon In 2020",
    "text": "HuffPost Video",
    "month": "2019-12",
    "data$month": "2019-12"
  },
  {
    "url": "https://www.huffpost.com/entry/paul-watson-on-sandy-hook-coverage-cant-say-im-proud_n_5df15ca0e4b0b6542dbcf411",
    "published_date": "2019-12-11T21:13:30Z",
    "author": "HuffPost Video",
    "title": "Paul Watson On Sandy Hook Coverage: ‘Can't Say I’m Proud’",
    "text": "Microbio",
    "month": "2019-12",
    "data$month": "2019-12"
  },
  {
    "url": "https://www.huffpost.com/entry/neil-cavuto-fires-back-at-critics_n_5de665e4e4b081900cfbb3da",
    "published_date": "2019-12-03T13:38:33Z",
    "author": "HuffPost Video",
    "title": "Neil Cavuto Fires Back At Critics",
    "text": "HuffPost Video",
    "month": "2019-12",
    "data$month": "2019-12"
  },
  {
    "url": "https://www.huffpost.com/entry/tips-managing-holiday-stress_l_5de694d6e4b0913e6f865260",
    "published_date": "2019-12-04T18:26:54Z",
    "author": "Kelsey Borresen",
    "title": "8 Little Things You Can Do To Help Manage Your Holiday Stress",
    "text": "Between attending holiday parties, shopping for presents, traveling and dealing with family pressure, the “most wonderful time of the year” can actually be a difficult and anxiety-inducing month for many. In fact, 62% of people say the holidays are “very” or “somewhat” stressful for them, according to a 2015 Healthline survey. We asked therapists to share the advice they’d give to anyone feeling overwhelmed by all the holiday hullabaloo and what simple things they can try to make the season more enjoyable. When you’re buried under holiday stress, the parties, festive activities and other traditions you once looked forward to may begin to fill you with dread. Take a moment to evaluate which activities on your to-do list you’re only doing because you think you should versus because you actually want to. “For example, ‘I should take my kids to see the holiday lights,’ or ‘I should make homemade cookies for the neighbors,’” Zainab Delawalla, a clinical psychologist in Decatur, Georgia, told HuffPost. Then replace the “shoulds” with “wants” — like, “I want to watch holiday movies and drink hot cocoa with the kids.” “It is much easier to find the motivation to do things you want to do rather than things you should do,” Delawalla added. “Some common holiday tasks can be triggering or stressful,” said Chicago-based therapist Anna Poss. “Decorating the Christmas tree for the first time after the loss of a loved one, shopping for gifts in stores if you have social anxiety or attending crowded holiday events when you have PTSD are things I frequently discuss with clients.” You can make these activities more manageable by asking a trusted loved one — a partner, close friend or family member — to join you. Their presence can make you feel more comfortable and supported, Poss said. When you’re stressed or anxious, hopping on Instagram for some mindless scrolling can provide a welcome distraction from what you’re experiencing. But too often, a social media binge leaves you feeling worse, not better, than when you started — especially once you begin playing the comparison game. “Your friends’ polished photos, filled with perfection and holiday cheer can really sting when you aren’t exactly feeling great about the season,” said Nicole O-Pries, a therapist at Virginia Affirming Counseling in Richmond, Virginia. “Step away from the phone, or better yet, temporarily delete your app.” Upbeat bops like Mariah Carey’s “All I Want for Christmas Is You” or Paul McCartney’s “Wonderful Christmastime” might not hit the spot when you’re feeling super frazzled. Instead, put together a playlist of festive-but-chill holiday songs that you can listen to when you need to mellow out. “Music helps us to focus and can have a tremendous impact on our mood,” Poss said. “Take a break and tune out some of the hustle and bustle of the season.” If you need a break from holiday music altogether, make a soothing playlist with some of your favorite non-festive songs or listen to nature sounds, Poss suggested. Pay attention to your breathing patterns when you’re feeling anxious or overwhelmed. Rather than slow and deep, your breaths are probably fast and shallow, which only perpetuates the cycle of stress in the body. “This sounds too simple, but finding a way to focus on your breath is one of the easiest and most effective ways to cope with stress in the moment,” O-Pries said. If you’re having trouble regulating your breath, using a visual aid like the Calm breath bubble or trying the square breathing technique may help, she said. Getting outside, even briefly, for a healthy dose of fresh air can do wonders. Take a stroll around the block by yourself or invite a relative who looks like they could use a break to join you, O-Pries suggested. “For many, spending holiday time with family can fill our minds and bodies with anxiety,” she said. “Instead of just sucking it up until the event is over, consider what you can do in the moment to feel better.” When you’re caught up in the anxiety loop in your head, grounding techniques can soothe and bring you back into your body, your surroundings and the present moment. You can adapt some common grounding exercises to fit the holiday season, Poss said. “For example, count how many different types of decorations or lights you see as you walk to work,” she said. “Name as many holiday films as you can without stopping. Breathe deeply and savor the scent of a holiday scented candle.” For many people, the holiday season means spending time with friends and family they may not often get to see. While this can be a wonderful opportunity to connect with loved ones, it can also make it difficult to find time to be alone and recharge your battery. “Even as you revel in the ‘togetherness’ of the holiday season, remember that it is just as important to take time for yourself,” Delawalla said. That might mean meditating before everyone’s awake, going to a workout class, offering to do the grocery run to get out of a busy house for a bit or just saying “no” to certain invitations to preserve your energy. By entering your email and clicking Sign Up, you're agreeing to let us send you customized marketing messages about us and our advertising partners. You are also agreeing to our Terms of Service and Privacy Policy.",
    "sentiment_val": 0.2232,
    "sentiment_sd": 0.4209,
    "month": "2019-12",
    "data$month": "2019-12"
  },
  {
    "url": "https://www.huffpost.com/entry/president-donald-trumps-bizarre-windmill-conspiracies_n_5e00f3ebe4b049666f25ac28",
    "published_date": "2019-12-23T17:03:26Z",
    "author": "HuffPost Video",
    "title": "President Donald Trump’s Bizarre Windmill Conspiracies",
    "text": "HuffPost Video",
    "month": "2019-12",
    "data$month": "2019-12"
  }
]
