[
  {
    "url": "https://www.huffpost.com/entry/president-donald-trumps-new-order-to-charge-asylum-seekers_n_5cc8b305e4b085b2249693b6",
    "published_date": "2019-04-30T20:39:53Z",
    "author": "HuffPost Video",
    "title": "President Donald Trump’s New Order To Charge Asylum Seekers",
    "text": "Microbio",
    "month": "2019-04",
    "data$month": "2019-04"
  },
  {
    "url": "https://www.huffpost.com/entry/us-agreed-to-warmbier-payment_n_5cc6f35fe4b051d71c5e7a8c",
    "published_date": "2019-04-29T12:49:04Z",
    "author": "HuffPost Video",
    "title": "U.S. Agreed To Warmbier Payment",
    "text": "Microbio",
    "month": "2019-04",
    "data$month": "2019-04"
  },
  {
    "url": "https://www.huffpost.com/entry/why-do-we-get-tattoos_n_5ca257c5e4b0fb341d60b054",
    "published_date": "2019-04-04T18:57:24Z",
    "author": "HuffPost Video",
    "title": "Why Do People Get Tattoos?",
    "text": "HuffPost Video",
    "month": "2019-04",
    "data$month": "2019-04"
  },
  {
    "url": "https://www.huffpost.com/entry/pete-buttigieg-announces-presidential-run_n_5cb5cf41e4b07f0eca02d71f",
    "published_date": "2019-04-16T12:47:03Z",
    "author": "HuffPost Video",
    "title": "Pete Buttigieg Announces Presidential Run",
    "text": "HuffPost Video",
    "month": "2019-04",
    "data$month": "2019-04"
  },
  {
    "url": "https://www.huffpost.com/entry/worst-things-to-do-during-argument_l_5cc1ec65e4b066119de37b6d",
    "published_date": "2019-04-26T09:45:00Z",
    "author": "Kelsey Borresen",
    "title": "The 8 Worst Things You Can Do During An Argument With Your Partner",
    "text": "All couples fight. In fact, not arguing at all can be a sign of an unhealthy, unhappy or disconnected relationship. When neither partner has the energy or desire to patch things up, it may signal they’ve checked out of the relationship. That said, there are productive, respectful ways to hash things out with your partner. And then there are unproductive or toxic ways to handle such matters. (And, it should go without saying, that abuse, whether physical or emotional, is never OK. If you need help, contact the National Domestic Violence Hotline or the National Dating Abuse Helpline.) We asked therapists to share the worst things couples can do during an argument so you know what to avoid next time you’re in a spat. Name-calling or zeroing in one of your partner’s insecurities or vulnerabilities during an argument is a low blow. You may be angry, hurt or frustrated in the moment, but that’s no excuse for this type of behavior. “If you’ve been with your partner long enough, you probably have a sense of certain things about them that would be especially hurtful if you brought them up during an argument,” marriage and family therapist Gary Brown told HuffPost. “For example, if you know that your partner deals with anxiety, it would be unnecessarily hurtful to say something like, ‘You’re always just a ball of fear. What a weakling you are!’” The problem with these type of jabs is that they can be particularly difficult to move past, clinical psychologist Gina Delucca said. “Try focusing on the issue at hand rather than making personal attacks and saying something about your partner that you will probably later regret,” she said. “Arguments can be tough to get through, but you still want to demonstrate mutual respect towards each other.” Stonewalling — when a person completely shuts down or disengages in the middle of an argument without warning — makes your partner feel as though you’ve pulled the rug out from under them. The conflict is still unresolved and it leaves your partner alone, confused and even more frustrated. “In heterosexual couples, this is typically the guy, who may feel overwhelmed, or afraid of his own anger, or perhaps this is a passive-aggressive way of striking back,” marriage and family therapist Amy Begel said. “Whatever the unconscious motivations, this maneuver is unfair, covert bullying and cowardly. It reduces the other partner to rubble, emotionally.” If you’re feeling overwhelmed and need a timeout, that’s fine. But it’s better to voice that to your partner than to just bail. Folks wanting a pause “can state that they want to hear more and understand, but need to stop the discussion right now,” psychotherapist Carol A. Lambert said. “They can identify that they feel too upset, confused, angry or whatever it might be, to keep listening and talking it through. They can ask their partner to table the argument until later and set a time.” When things between you and your partner are heated, you probably don’t have the clarity necessary to make a weighty decision. Instead, wait until things have cooled down before you try to come to a consensus. “Unless you are in an immediate health and safety situation such as domestic violence, it is usually wise to refrain from making important decisions during the heat of battle, when emotions tend to run high and judgment tends to run low,” Brown said. If you want to fight fair, then dredging up your partner’s past errors in a bid to “win” the argument is a big no-no. It’s often irrelevant to the present debate, counterproductive and can make your partner extra defensive. “When one partner is especially thin-skinned, anxious, guilt-ridden or just can never admit they’re wrong, they may employ a variety of methods designed to put the other person on the defensive,” Begel said. “One method is to ‘throw in the kitchen sink,’ to list all the flaws of the other partner, to refer to past transgressions or to distract from the argument at hand by changing the subject.” If there’s something that happened years ago that’s still eating at you, set aside a separate time to discuss it. Even in the heat of an argument, try to remember that you and your partner are on the same team. So proving how “right” you are and how “wrong” they are isn’t a worthwhile pursuit. Plus, if you’re more focused on building your case than you are on understanding your partner’s point of view, you’re not going to get very far. “If their partner is important to them, the ‘I’m right’ person needs to take the time to listen and be open to what their partner has to say,” Lambert said. “Finding middle ground or agreeing to disagree helps a relationship to thrive while both partners feel worthy of consideration.” Texting is great for sending emojis, wishing your partner good luck on their job interview or figuring out what’s for dinner. It’s not so great when you’re trying to resolve an argument because text messages can easily be misconstrued. “You can’t hear your partners tone of voice, nor read their body language, or interpret what their facial expressions may mean,” Brown said. “This is especially true as so much of our communication is non-verbal. There’s too much room to misinterpret someone when you aren’t sitting face-to-face or, at the very least, talking on the phone.” In making your point during an argument, you may inadvertently say something that hurts or otherwise invalidates your partner’s feelings. Even when you didn’t intend to cause any harm, it’s important to acknowledge that he or she may have been affected by what you said, sometimes in a lasting way. “While it may not have been your intention to cause harm to your loved one, the impact of your words or behaviors may very well have been harmful,” psychologist Jamie Goldstein said. ”When we overlook the potential for causing harm while in an argument, we further that harm through continuing to dismiss our sweetheart’s experience.” During an argument, we’re often so focused on what we’re saying that we’re not paying attention to our non-verbal behaviors. “Feelings that are common in conflict ― such as anger, frustration, and emotional pain ― tend to come with big energy,” marriage and family therapist Lynsie Seely said. “As a result, we may inadvertently ‘puff up’ or get big, slam a fist on the table, make large and abrupt gestures, get up into the other person’s personal space or yell loudly.” Sometimes, though, these cues are more subtle, like avoiding eye contact (by looking at your phone or turning toward the TV), rolling your eyes or using other facial expressions that convey contempt, Seely said. And you may not even realize you’re doing these things. “Body posture and non-verbal cues are extremely important to be aware of ― especially if either partner has relational trauma in their history,” she said. Instead, Seely recommends using deep breathing techniques or sensory mindfulness (rubbing something soft, squeezing a stress ball, smelling an essential oil) to help you stay calm and present, in spite of the difficult emotions you’re experiencing. “Assume a body posture of openness: Turning toward your partner, arms relaxed, soft eye contact, can be a great way to connect in the midst of conflict and sends the message to your partner that you’re on the same team,” she said. Need help? In the U.S., call 1-800-799-SAFE (7233) for the National Domestic Violence Hotline. By entering your email and clicking Sign Up, you're agreeing to let us send you customized marketing messages about us and our advertising partners. You are also agreeing to our Terms of Service and Privacy Policy.",
    "sentiment_val": -0.0178,
    "sentiment_sd": 0.4397,
    "month": "2019-04",
    "data$month": "2019-04"
  }
]
