[
  {
    "url": "https://www.huffpost.com/entry/best-amazon-shows_n_5a4d306ae4b06d1621bcb3e1",
    "published_date": "2019-02-02",
    "author": "todd van luling",
    "title": "What To Watch On Amazon Prime This Week (Jan. 27 - Feb. 2)",
    "text": "Streamline recommends “The ABC Murders” on Amazon Prime this week. Amazon debuted this new show on Feb. 1. Premise: Based on an Agatha Christie novel, this takes place in the 1930s and tells the story of a once-famous detective who longs for his glory years while spending much of his time alone. A serial killer starts to send messages to the detective, which sets off a cat-and-mouse mystery that, of course, involves murder. Stars: Rupert Grint and John Malkovich. How excited should you be? Amazon doesn’t have as many British crime shows as Netflix, so adding this highly stylized detective thriller should be a welcome move for fans of that genre. Malkovich elevates everything he stars in (even with a ridiculous accent this time around) and Grint looks nothing like Grint in this role, so that’s kind of fun. Although this show wallows in grimness, clever moments of humor peek through occasionally. Any reasons to be skeptical? This show plods along at a glacial pace. During multiple scenes, I wondered if my internet had slowed down and I was watching this at half-speed. The poor direction and dialogue make this hard to get through, so you really have to love detective thrillers to find enjoyment here. Sometimes I watch shows with hourlong episodes that feel too long, but it’s hard to say what should have been cut. That’s not the case here, as the show decides to spend a laughable amount of time focusing on shots of sinks and typewriters and other uninteresting inanimate objects. Will everyone be talking about this? Almost definitely not. Check out the trailer for “The ABC Murders” below. Read on for more recommendations. And if you want to stay up to date with what to watch on a weekly basis, subscribe to the Streamline newsletter. Amazon adds over 100 movies on Feb. 1, but not many notable ones. This is far more than Amazon (or Netflix) has typically ever added on a single day and I wonder if this portends a new strategy of mass volume for the streaming company. The full Amazon Prime list for the week: Jan. 29 Feb. 1 By entering your email and clicking Sign Up, you're agreeing to let us send you customized marketing messages about us and our advertising partners. You are also agreeing to our Terms of Service and Privacy Policy.",
    "month": "2019-02",
    "data$month": "2019-02"
  },
  {
    "url": "https://www.huffpost.com/entry/best-netflix-shows-stream_n_5a4d2d58e4b06d1621bcafc0",
    "published_date": "2019-02-02",
    "author": "todd van luling",
    "title": "What To Watch On Netflix That’s New This Week (Jan. 27 - Feb. 2)",
    "text": "Streamline recommends “Russian Doll” as the thing to watch on Netflix this week. The streaming service debuted this new show on Feb. 1. This is the best show I’ve seen so far this year. Premise: A “Groundhog Day”-inspired story that focuses on a woman who keeps dying and returning to a party for her 36th birthday. This video game programmer (and fashionable New Yorker) has to act like a detective to try to piece together why this happens to her, as she wonders whether her mother’s mental illness might be manifesting in her. Stars: Natasha Lyonne. How excited should you be? So excited. I loved this show and found myself having to binge this to the end, an easy task since each of the eight episodes is only about a half-hour long. The show does so many things well, most impressive of which is tackling dark philosophical questions while still being fun. Each character ― even the minor ones ― appears to have a fully realized backstory and speaks with witty, intelligent dialogue. Although the plot moves at a fast pace, this show has so many wonderful details, from subtle jokes to beautiful costuming, that deserve close attention. Any reasons to be skeptical? It does kind of feel tiresome that this is yet another show about rich New Yorkers. From the ridiculously expensive apartments to the casual use of hard drugs to the abundant orgy situations, I have to imagine this show feels like it takes place on a foreign planet to most people (although that comment might just be a self-own on my personal, more boring lifestyle). Will everyone be talking about this? Critics definitely will be, and it might even make lists of the best shows at the close of 2019. I could see this becoming popular too. It stars a couple of “Orange Is the New Black” actors and that show is super-popular, so maybe some of the widespread attention will transfer. Read on for more recommendations and news from the week. And if you want to stay up to date with what to watch on a weekly basis, subscribe to the Streamline newsletter.  “Velvet Buzzsaw” ― A satirical horror movie that ridicules the high-society art scene, while expensive artwork comes alive to kill the snobs. This stars Jake Gyllenhaal, John Malkovich and Toni Collette. “Bordertown,” Season 2 ― In yet another crime show on Netflix, a detective tries for a simple lifestyle and moves to a small town for family time, but guess what ― murders start happening. 1. Priyanka Chopra will produce a movie based on Netflix’s “Wild Wild Country” documentary and play the leading role of Rajneesh spokeswoman Ma Anand Sheela. It remains unclear whether this movie will debut on Netflix. 2. “Sex Education” will get a second season, which is unsurprising since Netflix claimed over 40 million households watched the show shortly after its debut.  Jan. 27 Jan. 29 Jan. 30 Feb. 1 Feb. 2 Big money interests are running the government — and influencing the news you read. While other outlets are retreating behind paywalls and bending the knee to political pressure, HuffPost is proud to be unbought and unfiltered. Will you help us keep it that way? You can even access our stories ad-free. You've supported HuffPost before, and we'll be honest — we could use your help again. We won't back down from our mission of providing free, fair news during this critical moment. But we can't do it without you. For the first time, we're offering an ad-free experience to qualifying contributors who support our fearless journalism. We hope you'll join us. You've supported HuffPost before, and we'll be honest — we could use your help again. We won't back down from our mission of providing free, fair news during this critical moment. But we can't do it without you. For the first time, we're offering an ad-free experience to qualifying contributors who support our fearless journalism. We hope you'll join us. Already contributed? Log in to hide these messages. By entering your email and clicking Sign Up, you're agreeing to let us send you customized marketing messages about us and our advertising partners. You are also agreeing to our Terms of Service and Privacy Policy.",
    "month": "2019-02",
    "data$month": "2019-02"
  },
  {
    "url": "https://www.huffpost.com/entry/best-shows-streamline_n_5a4d2c82e4b025f99e1f7dd7",
    "published_date": "2019-02-02",
    "author": "todd van luling",
    "title": "Here’s The New Show You Should Watch Right Now (Jan. 27 - Feb. 2)",
    "text": "Streamline recommends “The Other Two” as the show you should watch this week. Comedy Central premiered this new show on Jan. 24. I think this is the funniest show of the year so far. Premise: Two struggling New Yorkers have a little brother who essentially becomes the new Justin Bieber, or as an entertainment reporter in the show calls him, “the next big white kid.” As their brother’s fame rises to astronomical levels, the other two siblings try to figure out what’s next for their own lives. How excited should you be? If you like comedies and miss the time when television had numerous exceptional comedic shows that didn’t spend half of each episode exploring dark and dramatic storylines, then you have to check this out. Former “Saturday Night Live” head writers Chris Kelly and Sarah Schneider wrote and created this. (You should also listen to this podcast interview they did about putting together show.) Almost every single line of dialogue has a joke and almost every scene has a visual gag, which makes this feel like the contemporary successor to the Tina Fey-style of writing. Although the jokes never stop, the show also does an exceptional job in getting the details right about the entertainment industry and those trying to make it in that depressing world. Any reasons to be skeptical? In rare instances, the jokes can feel too relentless. Also, this style of writing lives and dies on whether the viewer finds the jokes funny. Although I loved the show’s sense of humor, you might want to bail on this immediately. Will everyone be talking about this? I could see this becoming both a critical and audience hit. Comedies in this style are increasingly rare. Given that people keep watching shows like “Parks and Recreation,” “Friends” and “The Office” on Netflix more than anything else, I think there’s a hunger for more straightforwardly funny shows like this. You can watch the trailer for “The Other Two” below. Read on for more recommendations and news from the week. And in the navigation bar above, you can choose specific recommendations for series streaming on Netflix and Amazon Prime.  1. New streaming services appear to be on the horizon. Apple’s long-awaited offering could launch as early as mid-April, while The Criterion Collection will start The Criterion Channel on April 8. How many subscriptions are you willing to pay for each month? I feel like I hit my limit a few subscriptions ago. 2. Hulu announced it will put more advertisements on the service later this year. The new ads will appear when users pause what they’re watching. The example the company gave showed a smiling Charmin bear holding toilet paper on the pause screen. By entering your email and clicking Sign Up, you're agreeing to let us send you customized marketing messages about us and our advertising partners. You are also agreeing to our Terms of Service and Privacy Policy.",
    "month": "2019-02",
    "data$month": "2019-02"
  }
]
