[
  {
    "url": "https://www.huffpost.com/entry/amy-coney-barrett-uses-term-offensive-to-lgbtq-community_n_5f85d1e7e4b0046440f63dc6",
    "published_date": "2020-10-13T16:08:33Z",
    "author": "HuffPost Video",
    "title": "Amy Coney Barrett Uses Term Offensive To LGBTQ Community",
    "text": "Microbio",
    "month": "2020-10",
    "data$month": "2020-10"
  },
  {
    "url": "https://www.huffpost.com/entry/trump-halts-coronavirus-stimulus-talks_n_5f7db247e4b0ba4c8583748e",
    "published_date": "2020-10-07T12:13:05Z",
    "author": "HuffPost Video",
    "title": "Trump Halts Coronavirus Stimulus Talks",
    "text": "HuffPost Video",
    "month": "2020-10",
    "data$month": "2020-10"
  },
  {
    "url": "https://www.huffpost.com/entry/leaked-reports-show-trump-ignored-covid-19-surge_n_5f90858ee4b0262d82885951",
    "published_date": "2020-10-21T18:54:49Z",
    "author": "HuffPost Video",
    "title": "Leaked Reports Show Trump Ignored COVID-19 Surge",
    "text": "HuffPost Video",
    "month": "2020-10",
    "data$month": "2020-10"
  },
  {
    "url": "https://www.huffpost.com/entry/obama-holds-rally-for-biden_n_5f983d2ae4b0cedc61db2718",
    "published_date": "2020-10-27T15:28:46Z",
    "author": "HuffPost Video",
    "title": "Obama Holds Rally For Biden",
    "text": "HuffPost Video",
    "month": "2020-10",
    "data$month": "2020-10"
  },
  {
    "url": "https://www.huffpost.com/entry/tweets-lies-parents-tell-kids_l_5f71415ec5b61af20e778901",
    "published_date": "2020-10-14T18:59:04Z",
    "author": "Caroline Bologna",
    "title": "35 Funny Tweets About The Lies Parents Tell Their Kids",
    "text": "Parenting is all about unconditional love, nurturing and family values. But it also involves a fair bit of bribery, wine and white lies. Fortunately the hilarious parents of Twitter are open about the times they, er, stretch the truth with their kids. We’ve rounded up 35 funny tweets about the lies parents tell their kids. Enjoy! Parents are allowed to be hypocrites. For example, I tell my kids it's wrong to lie AND that Baby Shark was destroyed in a fire at the internet factory I just wanted five minutes to drink my coffee so I sent my kid in the other room to look for a toy that’s in my pocket. Follow me for more parenting hacks. It's weird how we tell kids not to lie then tell them how good the picture they drew is. Two months until Christmas and I’m already running out of lies to tell my kids about the Amazon packages showing upKids: ooh! What is it?Me: I think daddy ordered a tool for his deck project...BORING lol[Husband walks in] what’s up?Me: Not much, I need you to build a deck Of all the lies I tell my kids, \"I can see it from here\" is my favorite. Don’t judge other parents for lying to their kids unless you plan on telling your own child their drawing of a “rocket” looks like a flaming space dildo. Common Parent Lies: \"There's no more.\" \"That's hot/spicy.\" \"Everyone is sleeping.\" \"Go hide, I'll come find you.\" I tell my kids they can be anything they want when they grow up b/c it’s important to for them to get used to hearing lies at any early age. Heard another parent tell their kid that when the ice cream truck plays its jingleit means they’ve sold out of ice cream. Using that now. Having you guys as kids is Father's Day gift enough.- lies dads tell their children \"I'm letting you win,\" is just one of the many lies I tell my kids. My friend tells her kids that her engine won’t start until her car hears their seatbelts go click and now I’m curious what other cute lies parents tell. The most creative lies I tell as a parent come from when my kids discover their artwork in the trash can. Lies I tell my kid: Running is the root of all evil. “No, we don’t lick people” and other lies we tell our kids. Someday I'll tell my kids I smoked pot in college but lie about smoking cigarettes. I don’t make the rules… Wait. Yes. I do. Hey. HEY. I MAKE THE RULES!! -lies I tell my kids. My toddler thinks that you have to line your tummy with good food first, so that you won’t get sick from the junk food I'm just gonna lay down and rest my eyes for a second, and other lies I tell my kids. If my son wants to watch one of his annoying shows that I’m not in the mood to tolerate I tell him that the main character is taking a nap. Works for now (he’s 4)! Wolves can blown down poorly constructed houses, and other lies I tell my children. The biggest lie we tell our kids: sorry buddy, McDonald’s doesn’t sell toys at breakfast. #DontJudgeMe #parenting I've decided to tell my kid Santa died instead of \"he doesn't exist\" bc when you're this deep in a lie, you stick to the story. Need to start lying to the children that the weekends are actually school days so they stop waking up so early LOL at parents who don't lie to their kids!Sorry son. They stopped making batteries for that toy. Guess we'll just have to throw it away. 1 Parent lie that continues to live on through generations is telling our kids we can't see to drive when the cabin light on in the car. My kids think the Tooth Fairy is allergic to dust and she can't come unless their rooms are super clean. \"I'll time you!\" - And other white lies I tell my kids My 6 year old asked where babies came from.I told him the truth.While I was sitting and basking in my pride at being an Honest Mom, he just stared before saying: “I wasn’t expecting that. That was inappropriate.” Then: “DID THE DOCTORS WATCH YOU DO IT”I shoulda lied. I’m pretty sure “ I’m not gonna say it again” is the biggest lie I tell my children. “When YOU’RE an adult you can do what YOU want.”- and other lies I tell my children Bored so I’ve decided to convince my 12yo that zebras are just stripy horses. Big money interests are running the government — and influencing the news you read. While other outlets are retreating behind paywalls and bending the knee to political pressure, HuffPost is proud to be unbought and unfiltered. Will you help us keep it that way? You can even access our stories ad-free. You've supported HuffPost before, and we'll be honest — we could use your help again. We won't back down from our mission of providing free, fair news during this critical moment. But we can't do it without you. For the first time, we're offering an ad-free experience to qualifying contributors who support our fearless journalism. We hope you'll join us. You've supported HuffPost before, and we'll be honest — we could use your help again. We won't back down from our mission of providing free, fair news during this critical moment. But we can't do it without you. For the first time, we're offering an ad-free experience to qualifying contributors who support our fearless journalism. We hope you'll join us. Already contributed? Log in to hide these messages. Of all the lies I've told my children, \"Try these beet pancakes, they're delicious!\" Is probably the cruelest. I’ve convinced my son the capital of Alabama is Sweet Home and the capital of West Virginia is Mountain Mama. Sure, he’ll fail the quiz, but he’ll be great at karaoke. 3-year-old: Daddy, are you cool?Me: Yes.It turns out I don’t feel bad about lying to children. By entering your email and clicking Sign Up, you're agreeing to let us send you customized marketing messages about us and our advertising partners. You are also agreeing to our Terms of Service and Privacy Policy.",
    "sentiment_val": 0.0547,
    "sentiment_sd": 0.3085,
    "month": "2020-10",
    "data$month": "2020-10"
  },
  {
    "url": "https://www.huffpost.com/entry/intel-officials-say-russia-likely-behind-hunter-biden-smear_n_5f8f20fce4b047b0085afa7d",
    "published_date": "2020-10-20T17:35:57Z",
    "author": "HuffPost Video",
    "title": "Intel Officials Say Russia Likely Behind Hunter Biden Smear",
    "text": "HuffPost Video",
    "month": "2020-10",
    "data$month": "2020-10"
  }
]
