[
  {
    "url": "https://www.huffpost.com/entry/robin-williams-daughter-gives-eric-trump-a-reality-check_n_651ad4b2e4b05c5fe1b6eb89",
    "published_date": "2020-08-11T11:27:36Z",
    "author": "HuffPost Video",
    "title": "Robin Williams’ Daughter Gives Eric Trump A Reality Check",
    "text": "HuffPost Video",
    "month": "2020-08",
    "data$month": "2020-08"
  },
  {
    "url": "https://www.huffpost.com/entry/call-police-vandalism_n_5f208c49c5b6b8cd63af281d",
    "published_date": "2020-08-24T13:00:29Z",
    "title": "Should I Call The Police To Report Vandalism? | HuffPost Latest News",
    "text": "by Alexander C. Kaufman Aug. 24, 2020 A police abolitionist explains the other options available when you see property damage. This is part of a HuffPost series looking at alternatives to policing. You can read the other pieces here. Someone is vandalizing property in my neighborhood. Should I call the police? If the average police officer makes about 14 arrests per year, less than one of those arrests will be for a violent crime. Twelve will be for “petty crimes like minor drug or alcohol possession, disorderly conduct, and vandalism,” according to research from Eastern Kentucky University criminologist Victor E. Kappeler. There is little evidence to suggest Black Americans commit these crimes at higher rates than white Americans. But if you call 911 and ask officers to come to your neighborhood to investigate vandalism, your Black neighbors are twice as likely to be arrested for it, a 2018 study in the Boston University Law Review found. Between 2001 and 2013, Black and Hispanic people made up 51% of New York City’s population over the age of 16, but accounted for 82% of misdemeanor arrests, which include things like vandalism, disorderly conduct, loitering and drinking in public. What if someone is causing serious damage, like breaking windows or slashing tires? “Is what you’re seeing worth someone’s life?” asked Tracey Corder, the deputy campaign director of the nonprofit Action Center on Race and the Economy. Because if you call the police, there is always a risk of escalation and violence, especially for Black or brown neighbors. In a study published earlier this year, Harvard University researchers Gabriel Schwartz and Jaquelyn Jahn examined fatal police violence across 382 U.S. metropolitan statistical areas between 2013 and 2017 and found Black people were six times more likely than white people to be killed by police. Years ago, Corder said, she was held up at gunpoint and robbed of her purse. Her brother went out looking for the thief, but her neighbor called the cops. Later, Corder said she saw the police cuffing her brother, whom they had profiled as the potential thief. This, she said, exemplifies the threat police pose to the community ― even when called in to address a harm to that same community. OK, but what if the insurance company requires a police report to file a claim? Something like this happened to Corder in 2012, when she was working on Barack Obama’s reelection campaign. Someone smashed the windows of the campaign field office. Rather than call armed police into the neighborhood, she and a colleague took photographs and fastidiously documented the damage. Then they went down to the police precinct to file a report. Sometimes that’s enough to satisfy an insurance company. In other situations, insurers can have appraisers come and assess what happened themselves. But what if I want justice? It depends what you mean by justice. If you want someone punished ― arrested, jailed and thrown into a criminal-justice system that largely targets the poorest and most vulnerable and hampers their ability to find jobs and housing ― that’s your prerogative. But there are other ways to make things right. In many communities, there are organizations that provide mediation between victims and offenders in hopes of finding restorative justice. What if it’s my house of worship or a religious cemetery that’s been vandalized ― especially at a moment when white nationalists are threatening Jews, Sikhs, Muslims and non-white Christians? This is where it gets complicated. Inviting armed police officers to guard a church, mosque or temple may make a place of spiritual solace “less welcoming to targeted communities like People of Color, people who live on the street, trans, gender non-conforming and disabled folks, immigrants, and Muslims,” according to guidelines published by the Unitarian Universalist Association, a liberal spiritual community that often congregates in churches. It’s also no guarantee of safety, given repeated discoveries of active white supremacists, anti-Semites and Islamophobes in police forces. There are other options. Following shootings targeting Jews over the past few years, Muslims arrived by the busload in some cases to form “peace rings” around synagogues. Others of multiple faiths raised money. Setting up buddy systems and phone trees within religious communities is one way of providing protection that doesn’t necessarily involve armed officers. To address vandalism, you could also train some clergy staff in de-escalation tactics, so once a would-be vandal is caught, they can be safely confronted and possibly reasoned with. That could be a first step toward restorative justice. “I never want to tell another marginalized group of people how to feel safe,” Corder said. “But if you see that and you call the police into your neighborhood, how likely is it that the police will get that person?” What are some other resources I can look into? Read other stories in this series",
    "sentiment_val": 0.0099,
    "sentiment_sd": 0.3254,
    "month": "2020-08",
    "data$month": "2020-08"
  },
  {
    "url": "https://www.huffpost.com/entry/call-police-mental-health-crisis_n_5f2036c3c5b6945e6e403b1a",
    "published_date": "2020-08-24T13:00:29Z",
    "title": "Should I Call The Police If I See Someone Having A Mental Health Crisis? | HuffPost Latest News",
    "text": "by Lindsay Holmes Aug. 24, 2020 Read this before you dial 911 during an encounter with someone experiencing severe symptoms of mental illness. This is part of a HuffPost series looking at alternatives to policing. You can read the other pieces here. How do I know if someone is having a mental health crisis? Indicators of someone experiencing a crisis can include threats to harm themselves or others, an inability to care for themselves, and extreme behaviors or emotions. Someone experiencing psychosis may also talk to themselves, either coherently or incoherently. But these are not necessarily a sign that the person is in immediate danger, said Jessica Isom, a psychiatrist based in Boston. “It is important to get a sense of what the level of distress is for the individual and not to react solely based on your own lack of familiarity with a person’s behavior or statements,” she said. I am pretty sure this person IS in crisis. Should I call the police? Calling 911, particularly when you don’t have a full picture of the person’s condition, could potentially exacerbate the situation. This is especially true if the person is Black or brown. “The police officer might be perceived as threatening and/or symbolic of an arrest rather than help,” Isom said. Officers can also make the situation worse. “Not all police officers are trained and competent to provide critical intervention services,” she said. Some first responders may also use stigmatizing language, which can further exacerbate the situation. Consider calling a crisis hotline first. The National Suicide Prevention Lifeline can direct you to a local crisis center. You can also call the state or county mental health services available near you, which often include a mental health crisis helpline. Isom also recommended asking the person if there’s a family member or friend they trust who you can call for them, which “can be useful to avoid confusing instructions and overwhelming chatter for the individual who likely has a limited ability to process information during the crisis.” What if the person in distress is someone I know? If it’s a partner or your child, calling their doctor should be the first step, said Jack Rozel, the medical director at resolve Crisis Services, which is available to residents of Allegheny County, Pennsylvania. If it’s a relative or a friend, ask them if they’re seeing a mental health professional and offer to contact their provider with or for them. You can also call a mental health crisis line and ask the counselor for help. If someone you know posts an alarming status on social media, you should also check in with them directly. If you are not comfortable doing that, Facebook, Instagram and Twitter also have options to flag the post for mental health concerns as well; the company will reach out to the person with resources and can involve emergency services as needed. (Just keep in mind this may lead to police involvement.) What if I’m scared this person is going to hurt me or another person? Mental illness does not equal violence. If a person is not actively threatening you or others, do not assume they’re dangerous because they’re in crisis. People with a mental illness are far more likely to harm themselves, and that’s why proper intervention is important. If someone is in a dangerous location, such as in the middle of the street on a bridge, “calm encouragement and avoiding sudden movements can result in a trusting environment where continued conversation has the chance to be more helpful,” Isom said. If it’s abundantly clear that a person in distress is a threat, calling 911 “is important as a measure of reducing the chances of unfortunate consequences,” according to Isom. “However, do try to elicit information about the person’s mental health background so that you and others can communicate to the police or EMS why the person is in distress and what limitations may be present for following commands,” she added. How can I help advocate for people living with a mental health condition? Even simple acts of kindness like “asking if they would like food or water can be a humanistic gesture,” Isom added. Getting involved with mental health organizations ― particularly local ones that focus on improving access to treatment ― is also a long-term step. Try connecting with a community chapter of a national organization like Mental Health America, the National Alliance on Mental Illness or the American Foundation for Suicide Prevention. You can also be more open about mental health in your own life. Share your experiences, encourage people to try therapy and correct someone if you hear them use a term or say something that’s offensive to those dealing with a mental illness. Where can I go for additional resources or information? BeThe1To, a resource for talking about suicide with others. Crisis Now, which offers a behavioral toolkit for crisis care when the situation arises. The Substance Abuse and Mental Health Services Administration, a government organization that provides substance use and mental health disorder information and services. The National Suicide Prevention Lifeline, which offers 24/7 free and confidential support for people in crisis or distress. Read other stories in this series",
    "sentiment_val": -0.0355,
    "sentiment_sd": 0.2933,
    "month": "2020-08",
    "data$month": "2020-08"
  },
  {
    "url": "https://www.huffpost.com/entry/trump-wanted-to-trade-dirty-puerto-rico_n_5f3ea6e6e4b0a38d353d8182",
    "published_date": "2020-08-20T16:31:54Z",
    "author": "HuffPost Video",
    "title": "Trump Wanted To Trade ‘Dirty’ Puerto Rico",
    "text": "Microbio",
    "month": "2020-08",
    "data$month": "2020-08"
  },
  {
    "url": "https://www.huffpost.com/entry/who-to-call-animal-abuse-neglect_n_5f06543bc5b63a72c33cc0c7",
    "published_date": "2020-08-24T13:00:29Z",
    "title": "What Should I Do If I See Someone Mistreating An Animal? | HuffPost Latest News",
    "text": "by Kelsey Borresen Aug. 24, 2020 Some instances of animal abuse or neglect warrant calling 911. But if the pet isn't in immediate danger, there are better options. This is part of a HuffPost series looking at alternatives to policing. You can read the other pieces here. If I see an animal being abused or neglected, should I call the police? Animal cruelty is against the law in every state, though standards for what constitutes illegal mistreatment vary. Animal cruelty may include physical attacks like beating or dog fighting, or neglectful behavior like abandonment, hoarding, tethering or failure to provide adequate shelter or veterinary care. In 2019, certain acts of intentional animal cruelty also became a federal crime. And researchers have found that people who harm animals are more likely to harm other people, too. If an animal is in immediate physical danger — a dog trapped in a hot car, a pet without shelter or water during extreme weather, an animal being beaten — you should call 911, said Mike Perkins, director of the Atlanta Humane Society’s cruelty investigation division. “911 operators can get the information to animal control and police departments in an expeditious manner, which will shorten the response time,” he told HuffPost. But if it’s not an emergency — like a tethered dog or a neighbor hoarding cats — do not call 911. Contact either your local animal control division, humane society or animal shelter, depending on what resources are available in your area. If you can’t figure out who to call, try the local police nonemergency number, 311, which can direct you to the correct division or organization if they don’t handle these cases themselves, said Candace Croney, director of Purdue University’s Center for Animal Welfare Science. Before reporting abuse or neglect to police or animal control, collect as much information as you can, including the date, time and address where it occurred; description of the property; description of the animal; any injuries or abuse it has sustained; and other potential witnesses. If you can safely get photo or video documentation of the abuse, those assets can be helpful too. What if I just suspect abuse or neglect is occurring? You should still file a report with your local animal control division or humane society. Croney also recommends reaching out to a veterinarian, veterinary college or animal shelter in your area, which may be able to point you in the right direction. Croney does not advise making direct contact or confronting the animal’s owner yourself. “Doing so could put your own safety at risk and could also potentially complicate or impede an official investigation,” she said. What about other animal issues — like if there’s a raccoon or coyote on my property? A wild animal like a coyote, bear or mountain lion may just be passing through. Keep an eye on it from inside your house ― do not go outside ― and see if it hangs around or moves along. If the animal stays or keeps coming back, it may be because it’s found a food source in your backyard. Remove any temptations when it’s safe to do so. “Take down wildlife feeders, move pet food indoors, fence off bee hives or gardens, block off access to shelter,” said Leslie Burger, assistant extension professor at Mississippi State University’s department of wildlife, fisheries and aquaculture. “These kinds of actions would eliminate most human-wildlife interactions that occur.” If this doesn’t resolve the situation, then you will need to contact your state’s wildlife agency. Calling the police is usually not the best option here, as they typically lack the specialized training needed in these scenarios. “Examples of this might include spotting a deer injured in a vehicle collision, seeing a raccoon staggering around in the open during the day or dealing with livestock damage by wildlife,” Burger said. “State wildlife organizations will have personnel such as conservation officers and biologists who are trained to handle these kinds of situations.” Where can I go for more information and resources? The Humane Society of the United States breaks down the different forms of animal abuse and neglect. The American Society for the Prevention of Cruelty to Animals outlines what to include when making a report. The U.S. Fish and Wildlife Service has a list of agencies by state if you’re dealing with a situation involving a wild animal. The Animal Legal Defense Fund has advice on what to do if you notice animal cruelty online or on social media. Read other stories in this series",
    "sentiment_val": -0.0797,
    "sentiment_sd": 0.321,
    "month": "2020-08",
    "data$month": "2020-08"
  },
  {
    "url": "https://www.huffpost.com/entry/republican-national-convention-2020-night-3_n_5f441b91e4b038507c2bd553",
    "published_date": "2020-08-24T19:56:35Z",
    "author": "HuffPost Video",
    "title": "Republican National Convention 2020 - Night 3",
    "text": "HuffPost Video",
    "month": "2020-08",
    "data$month": "2020-08"
  }
]
