[
  {
    "url": "https://www.huffpost.com/entry/easy-sheet-pan-recipes_l_5f5faa1fc5b68d1b09c5f9b7",
    "published_date": "2020-09-23T09:45:10Z",
    "author": "Kristen Aiken",
    "title": "Easy Sheet Pan Recipes For The Days You're Running On Empty",
    "text": "If you’re trying to juggle working from home, teaching from home or just being at home for what feels like 100 years during the pandemic, you may be suffering from cooking burnout. It’s likely you can’t muster the time, resources or energy to make a meal from scratch when it’s so much easier to just rip open a bag of Doritos and collapse on the couch. But it’d be a shame to miss out on all the home-cooked coziness that fall has to offer, because now’s the perfect time to turn on the oven and fill your house with all kinds of aromas: roasting chicken, sizzling potatoes, bubbling cheese. If you don’t think you have the energy for that, you need the 16 sheet pan recipes we’ve gathered below. The idea behind sheet pan meals is that you chop up your ingredients, toss them onto the sheet pan and pop them in the oven. When it comes out, dinner is ready and you only have to wash that one sheet pan. Check out some of our favorites below. There are even soups you can make on a sheet pan (you just toss the ingredients into a blender after they’ve been cooked). We promise, they don’t require that much more work than ordering takeout (and waiting for it, which is truly the hardest part). By entering your email and clicking Sign Up, you're agreeing to let us send you customized marketing messages about us and our advertising partners. You are also agreeing to our Terms of Service and Privacy Policy.",
    "sentiment_val": 0.0007,
    "sentiment_sd": 0.2768,
    "month": "2020-09",
    "data$month": "2020-09"
  },
  {
    "url": "https://www.huffpost.com/entry/adam-schiff-warns-trump-staff-to-get-out_n_5f6ca451e4b07b680e7e4579",
    "published_date": "2020-09-24T13:46:43Z",
    "author": "HuffPost Video",
    "title": "Adam Schiff Warns Trump Staff To Get Out",
    "text": "HuffPost Video",
    "month": "2020-09",
    "data$month": "2020-09"
  },
  {
    "url": "https://www.huffpost.com/entry/la-sheriffs-mislead-after-reporters-arrest_n_5f5fe668e4b0f7223915c3dc",
    "published_date": "2020-09-14T21:42:47Z",
    "author": "HuffPost Video",
    "title": "LA Sheriffs Mislead After Reporter’s Arrest",
    "text": "Microbio",
    "month": "2020-09",
    "data$month": "2020-09"
  },
  {
    "url": "https://www.huffpost.com/entry/911-call-from-intoxicated-jerry-falwell-jrs-house_n_5f64deeae4b062f46e345404",
    "published_date": "2020-09-18T16:18:46Z",
    "author": "HuffPost Video",
    "title": "911 Call From Intoxicated Jerry Falwell Jr.’s House",
    "text": "Microbio",
    "month": "2020-09",
    "data$month": "2020-09"
  },
  {
    "url": "https://www.huffpost.com/entry/trump-compares-himself-to-winston-churchill_n_5f5b743ae4b0ed4731909f73",
    "published_date": "2020-09-11T12:52:24Z",
    "author": "HuffPost Video",
    "title": "Trump Compares Himself To Winston Churchill",
    "text": "Microbio",
    "month": "2020-09",
    "data$month": "2020-09"
  }
]
