[
  {
    "url": "https://www.huffpost.com/entry/bill-oreilly-vs-andrew-yang_n_5e440a4fe4b086476a696233",
    "published_date": "2020-02-12T14:20:11Z",
    "author": "HuffPost Video",
    "title": "Bill O'Reilly vs. Andrew Yang",
    "text": "HuffPost Video",
    "month": "2020-02",
    "data$month": "2020-02"
  },
  {
    "url": "https://www.huffpost.com/entry/sanders-wins-new-hampshire-primary_n_5e4381a7e4b05327f5ecf3ed",
    "published_date": "2020-02-12T04:36:30Z",
    "author": "HuffPost Video",
    "title": "Sanders Wins New Hampshire Primary",
    "text": "HuffPost Video",
    "month": "2020-02",
    "data$month": "2020-02"
  },
  {
    "url": "https://www.huffpost.com/entry/the-best-lubes-for-women-vaginal-dryness_l_5e3aea99c5b6b5fb438b4dd3",
    "published_date": "2020-02-27T18:30:18Z",
    "author": "Danielle Gonzalez",
    "title": "Here Are The Best Lubricants For Women, Recommended By Experts",
    "text": "You’re ready to go ... except that you’re not. Things are heating up, but your body’s not keeping pace. Whether it happens with a partner during sex or solo with your favorite toy, vaginal dryness is never fun. It can result in feeling unsatisfied in the bedroom, experiencing discomfort or even pain during intercourse and masturbation. If it’s happened to you, you’re not alone. In fact, 17% of women ages 18 to 50, and 25% of women ages 50 to 59 have experienced vaginal dryness during sex, according to Women’s Health Concern. What causes vaginal dryness in the first place, and what can you do if you’re feeling dry down there when you don’t want to be? We took those questions to the experts and asked for their recommendations. Here’s what they said. There are plenty of reasons you might be feeling less than lubricated down there, ranging from major hormonal changes to just not being turned on, said Dr. Kecia Gaither, OB-GYN. Once you’ve ruled out with your doctor that the cause isn’t anything more serious, the problem could be as simple as adding a little extra moisture — down there and in general. “Think of how your mouth feels when you haven’t had enough water,” said Dr. Heather Jeffcoat, an LA-based physical therapist who specializes in vaginal discomfort. “Your vagina is just as unhappy.” But it’s important to remember that there is no “norm” for natural vaginal lubrication from arousal, either. “Some women naturally don’t produce much vaginal fluid,” Jeffcoat said. “Think of how your mouth feels when you haven’t had enough water. Your vagina is just as unhappy.” In that case, Gaither, the OB-GYN, recommends Replens Vaginal Moisturizer as a longer-lasting solution, which replenishes your body’s natural moisture for up to three days. Keep in mind there’s a difference between vaginal moisturizers and the lubricants you might have tucked away in your nightstand. “Lubricants are for short-term use to relieve vaginal dryness and discomfort during sexual activity,” Gaither said. “Moisturizers are for long-term use to relieve vaginal dryness on a day-to-day basis.” But, there are a lot of lubricants out there — water-based, silicone-based, and even CBD-infused lubes. So, what should you look for if you’re feeling less than lubricated? Personal lubricants are used to reduce friction, ease penetration and stimulate the senses. They come in a wide variety of formulas, fragrances and even flavors — so it’s important to do your research before deciding which lube will be best for you or your partner. Water-based lubricants are the most versatile because they’re easy to wash off and don’t degrade the latex in condoms (a thing oil-based lubes can do), according to Dr. Sonia Bahlani, an NYC-based gynecologist who specializes in pelvic pain and sexual health. The major downside to water-based lubes? They evaporate more quickly than silicone lubricants, and don’t work well in showers or pools. That could make them slightly “less fun” to use, Bahlani said. “I recommend ‘Good Clean Love’ and ‘Slippery Stuff’ water-based lubricants for patients who have vaginal dryness because they are organic and won’t alter pH levels, which can lead to UTIs or vaginal infections,” Bahlani said. Not all water-based lubricants are the same, said Jeffcoat, the LA-based physical therapist who specializes in vaginal discomfort. “The most important keywords to look for across the board are paraben-free, glycerin-free, alcohol-free and no petrochemicals,” Jeffcoat said. “Ones that are relatively inexpensive that I use in my offices are Slippery Stuff, Good Clean Love’s Almost Naked and Go Love CBD. Sliquid also has a water-based ‘Organics’ line that includes aloe vera which is soothing to many of my patients.” Aloe-based lubes, which have become popular with trendy sexual wellness brands like Dame Products, Maude and Unbound Babes, are technically water-based, but also include a combination of natural ingredients. Just remember to check the full list of ingredients to be sure they won’t interfere with condoms or be irritating, Bahlani said. Silicone lubricants are generally “more fun,” according to Bahlani, since they are slippery, last longer and are good for shower, pool or anal sex. But they can potentially damage silicone sex toys, legend has it. “When looking through the data, it’s really inconclusive and many call this a ‘myth,’” Bahlani said, “But as the durability of sex toys have improved, this seems to be less of an issue.” Oil-based natural lubricants like coconut oil can break down the latex in condoms, too. They can also alter the pH of the vagina, which can lead to more infections, Bahlani said. “I generally don’t recommend [oil-based lubes] as there are many organic paraben-free options that won’t cause the alteration in pH,” he said. That said, if you or your partner suffer from skin sensitivities or irritation, an all-natural lubricant like coconut or avocado oil might be worth exploring, according to Jeffcoat. She recommends the oil-based lubricant brand Yes for those situations. Just keep in mind that oil-based lubes aren’t condom safe. The experts agree: There are different solutions for different people. If you’ve upped your water intake, ruled out more serious concerns with your doctor, and still find yourself wanting to replace the old tube of lube in your nightstand, we’ve rounded up all of the expert-recommended solutions above into one easy-to-read list below. Take a look below at expert-recommended lubes and vaginal moisturizers for when you’re feeling dry down there: By entering your email and clicking Sign Up, you're agreeing to let us send you customized marketing messages about us and our advertising partners. You are also agreeing to our Terms of Service and Privacy Policy.",
    "sentiment_val": 0.1246,
    "sentiment_sd": 0.2703,
    "month": "2020-02",
    "data$month": "2020-02"
  },
  {
    "url": "https://www.huffpost.com/entry/bebe-rexha-doesnt-let-bipolar-disorder-define-her_n_5e56a9c4e4b00893b6c636fa",
    "published_date": "2020-02-26T17:21:55Z",
    "author": "HuffPost Video",
    "title": "Bebe Rexha Doesn’t Let Bipolar Disorder Define Her",
    "text": "Microbio",
    "month": "2020-02",
    "data$month": "2020-02"
  }
]
