[
  {
    "url": "https://www.huffpost.com/entry/ousted-hhs-watchdog-testifies-in-congress_n_5ecd37b2e4b025a9c81e998b",
    "published_date": "2020-05-26T15:26:47Z",
    "author": "HuffPost Video",
    "title": "Ousted HHS Watchdog Testifies In Congress",
    "text": "Microbio",
    "month": "2020-05",
    "data$month": "2020-05"
  },
  {
    "url": "https://www.huffpost.com/entry/harvey-weinstein-guilty_n_63f7c066e4b0c87f32f641b7",
    "published_date": "2020-05-13T19:56:45Z",
    "author": "HuffPost Video",
    "title": "Harvey Weinstein Guilty",
    "text": "HuffPost Video",
    "month": "2020-05",
    "data$month": "2020-05"
  },
  {
    "url": "https://www.huffpost.com/entry/quarantine-diaries-feel-good-news_n_5eab36a8c5b6a3d6b067096a",
    "published_date": "2020-05-21T22:40:00Z",
    "title": "Quarantine Diaries: Finding And Spreading Joy | HuffPost Entertainment",
    "text": "Quarantine Diaries is a communal project of stories from our readers about how they are managing their lives during the coronavirus crisis. In this piece, readers share how they are spreading joy within their homes and communities. You can read the five-part project here. ... We took all the extra time to reflect and spend it in a way that had a positive impact on our lives. We converted a portion of our living room into a makeshift studio. And we spend countless hours here every day. It is the highlight of our day, exchanging ideas, crafting, painting, creating, having fun productively and experiencing a creative flow that keeps us happy and going. It is our comfort zone and helps us express who we are. A tiny conversation with our mom led us to create a fundraiser, Art from the Heart, for the Akshaya Patra Foundation, a nonprofit in India that provides freshly cooked meals to school-going children and are helping the needy in the wake of COVID-19. My mom created the fundraiser on her Facebook profile, and we added photos of all the paintings we have created so far. Sonali Patodia, 42, from San Jose, California. Her 11½-year-old daughter, Ahanna, and 9-year-old daughter, Anousha, created the paintings above. ... I turned 21 in quarantine on April 5. A week later, my sister turned 17. We’re both part of the class of 2020. I am a graduating college senior, and she is a graduating high school senior. We’re feeling the pains of this loss along with all other graduating seniors. But somehow, we managed to make both our birthdays the most memorable we’ve ever had. For my birthday, she took me on a drive-thru scavenger hunt downtown commemorating major milestones in my life. For hers, I designed an indoor unicorn-themed escape room for her to solve. Without quarantine, we likely would not have been as present with each other as we were on our birthdays. The undivided attention we gave each other made it unforgettable. Eliza Tan, 21, from Charlotte, North Carolina ... I comic everything on my Instagram page, from my struggle juggling work from home to homeschooling my 5-year-old to the much-needed teletherapy sessions to my candid musings over the news to my gratitude to all the health care workers. Drawing comics about my experience has been my outlet during this strange time. It’s how I am coping. Lisa Lim, 45, from Queens, New York ... What do you do when you have no children and are locked down in your home? You get a hold of some of your improv friends and create a YouTube channel where a new story or poem is read by a different character every day to amuse and entertain other people’s children. Brett “Fish” Anderson, 46, from Cape Town, South Africa ... Our son Zeke was an inflatable chicken for Halloween this past year. During quarantine, with all of the neighborhood walks we’ve been taking, Zeke decided the chicken would bring joy to the neighbors and especially to the small kids in our area. Suzanne Karp, 52, from Santa Rosa, California ... I started these posts on Facebook and got such a positive, fun response I kept thinking up quarantine frustrations and posting about them. I think these posts put a bit of humor into the everyday accounts of “working from home,” and many of us are doing it while our spouses are doing the same. We pretty much are all going through the same experiences. I just put it on Facebook for my friends to share in the laugh. They laugh because they recognize themselves in many of the posts and they can laugh along. I hope you have a laugh, too. KaDee Thompson-Small, 57, from Fairview Heights, Illinois ... There are some children in Missouri City, Texas, who want to spread some kindness to children in their city. Khloe, Kaiya and Aiden are students in Fort Bend ISD [Independent School District], and they have big hearts. They wanted to do something special for other children during this stay-home period. They are giving away more than 100 new books to children. Khloe started a project called A Book and a Smile, and she has given more than 5,000 books to groups and organizations. They are saving their money to buy more books and a little library. We are sure these books will put a smile on lots of children’s faces. Billye Moutra, 64, from Missouri City, Texas ... We are a 30-member Episcopal church in the hills of northwest Connecticut currently without a priest. To keep us connected, informed and entertained during the pandemic, I began a daily two- to three-page newsletter to circulate to our members. Our daily email list has grown to over 110, with readers in England, California, Florida and Georgia. People seem to love it: “It’s a lifesaver,” writes one. “The best part of my day,” writes another. Bill Starr, 79, from Litchfield, Connecticut ... Read Other Topics in the SeriesDealing With KidsWorking Through it AllCoping & Staying SaneMaintaining Relationships ... Editors Erin E. Evans, Ron Nurwisah Reporters Emma Gray, Leigh Blickley, Matthew Jacobs, Taryn Finley, Claire Fallon, Zeba Blay Copy Editor Wendy Lu Art Direction & Design Yenwei Liu, Rebecca Zisser Illustration Christoph Abbrederis Audience Team Sarah Kenien, Celene Zavala We're bringing you the exclusives, scoops and hot takes on the news all your friends are talking about. Join our loyalty program to support our work and go ad-free. You've supported HuffPost before, and we'll be honest — we could use your help again. We won't back down from our mission of providing free, fair news during this critical moment. But we can't do it without you. For the first time, we're offering an ad-free experience to qualifying contributors who support our fearless journalism. We hope you'll join us. You've supported HuffPost before, and we'll be honest — we could use your help again. We won't back down from our mission of providing free, fair news during this critical moment. But we can't do it without you. For the first time, we're offering an ad-free experience to qualifying contributors who support our fearless journalism. We hope you'll join us. Already contributed? Log in to hide these messages. A HuffPost Guide to Coronavirus ...",
    "sentiment_val": 0.2445,
    "sentiment_sd": 0.2265,
    "month": "2020-05",
    "data$month": "2020-05"
  },
  {
    "url": "https://www.huffpost.com/entry/how-the-coronavirus-may-change-hollywood_n_5eb19bf6e4b0cf5707f7ed33",
    "published_date": "2020-05-05T16:48:31Z",
    "author": "HuffPost Video",
    "title": "How The Coronavirus May Change Hollywood",
    "text": "HuffPost Video",
    "month": "2020-05",
    "data$month": "2020-05"
  },
  {
    "url": "https://www.huffpost.com/entry/readjusting-to-life-after-coronavirus_n_5ec6acece4b05aef1eee92ec",
    "published_date": "2020-05-21T16:11:41Z",
    "author": "HuffPost Video",
    "title": "Readjusting To Life After Coronavirus",
    "text": "Microbio",
    "month": "2020-05",
    "data$month": "2020-05"
  },
  {
    "url": "https://www.huffpost.com/entry/trump-rejects-faucis-call-for-caution_n_5ebd3fb0e4b01a5290222c74",
    "published_date": "2020-05-14T12:51:04Z",
    "author": "HuffPost Video",
    "title": "Trump rejects Fauci’s call for caution",
    "text": "HuffPost Video",
    "month": "2020-05",
    "data$month": "2020-05"
  },
  {
    "url": "https://www.huffpost.com/entry/i-discovered-i-had-cancer-during-the-pandemic_n_63ffb433e4b0a96d9cd13948",
    "published_date": "2020-05-26T23:58:12Z",
    "author": "HuffPost Video",
    "title": "I Discovered I Had Cancer During The Pandemic",
    "text": "HuffPost Video",
    "month": "2020-05",
    "data$month": "2020-05"
  },
  {
    "url": "https://www.huffpost.com/entry/dhs-report-claims-china-covered-up-the-coronavirus_n_5eb04b7ee4b093cda06beaf3",
    "published_date": "2020-05-04T16:59:45Z",
    "author": "HuffPost Video",
    "title": "DHS Report Claims China Covered Up The Coronavirus",
    "text": "HuffPost Video",
    "month": "2020-05",
    "data$month": "2020-05"
  }
]
