[
  {
    "url": "https://www.huffpost.com/entry/biden-backs-athletes-opposing-ga-voting-law_n_6065ee7ae4b05201b04bed62",
    "published_date": "2021-04-01T15:46:06Z",
    "author": "HuffPost Video",
    "title": "Biden Backs Athletes Opposing GA Voting Law",
    "text": "Microbio",
    "month": "2021-04",
    "data$month": "2021-04"
  },
  {
    "url": "https://www.huffpost.com/entry/kevonstage-leveling-playing-field-black-comedians_n_60413ef1c5b60208555d3b0e",
    "published_date": "2021-04-29T14:21:29Z",
    "title": "KevOnStage Is Leveling The Playing Field For Black Comedians | HuffPost Entertainment",
    "text": "To read about the rest of the Culture Shifters, including comedian Bowen Yang and entrepreneur Erica Chidi, return to the full list here. Before the world locked down, Kevin Fredericks traveled across the country on his third self-produced and self-financed comedy tour, delivering his unique brand of humor that garnered him millions of fans. But when the coronavirus pandemic forced entertainment venues to close, the comedian had to find new ways to keep his fans laughing. Enter the “Keep Your Distance” comedy show, a stand-up event he and a few other comics created in the wake of COVID-19. The comedians perform for a live, socially distanced audience at an outside locale in Los Angeles, and fans can purchase tickets to watch the show from their homes online as well. What makes the show special, in Fredericks’ eyes, is that it allows Black comics to perform for audiences that may not otherwise ever see them. The show “has been a way to give comics an opportunity to still perform in front of a live audience safely and give people at home a chance to enjoy live comedy, also safely,” said Fredericks, who is better known as KevOnStage to his more than 1 million followers on social media. “It has also been a way to introduce people to comedians, and comedians to new audiences.” He views the show as a chance for comics who are traditionally underrepresented to continue to create new lanes for themselves. Virtually every industry has been hit hard by the pandemic. In entertainment, Black comedians have been disproportionately affected. Some had difficulty finding work before the virus took hold in the country, and COVID-19 only exacerbated many of the issues faced by comedians of color. “The pandemic, not only in entertainment, but for a lot of people, it immediately dried up all of our opportunities,” Fredericks, 37, said. “I always used my influence to pass along opportunities to people of color.” Without the ability to perform live, comedians have turned to Zoom and other online platforms for shows. “One of the drawbacks of streamed comedy is: It’s not real-time,” he said, explaining the reasoning for socially distanced shows. “As a comedian, that delay can be a killer. If that joke’s not working, you need to know immediately.” With its spread-out audience, the “Keep Your Distance” show keeps the comedians on track. But Fredericks hasn’t stopped there. In December, he launched the KevOnStage Studios app, a streaming platform for audiences to watch content from Black comedians, screenwriters and other entertainers who don’t normally appear on Netflix or Hulu. Subscribers can watch a variety of content like the “Real Comedians Challenge Show,” a full-length series featuring Fredericks and other comedians competing against each other in different challenges. In one episode, they learn how to apply makeup from YouTuber Jackie Aina, and in another, they write songs with gospel artist Jonathan McReynolds. The app already has over 15,000 subscriptions. Fredericks was born into a military family, and lived in a variety of places growing up. He started doing stand-up while he was in high school at a church talent show. The comedian worked what he called a “regular job” at aerospace company Boeing before realizing in 2013 that he could make a living doing comedy through YouTube. “I was essentially just making YouTube videos and posting those links on my Facebook page,” Fredericks said. “It started with people in Tacoma, [Washington], where I’m from, and then they started sharing my content with their friends and then their friends shared, and then slowly more and more people shared.” Today, Fredericks’ platform has grown from making funny YouTube videos with his friends to an authentic media empire. The viral internet star has amassed nearly 2 billion views across all platforms, but even he is still surprised when he gets flagged down in the airport by a fan. With his star only growing brighter, the comedian said he wants to continue to use his platform to open doors for new, diverse talent. We're bringing you the exclusives, scoops and hot takes on the news all your friends are talking about. Join our loyalty program to support our work and go ad-free. You've supported HuffPost before, and we'll be honest — we could use your help again. We won't back down from our mission of providing free, fair news during this critical moment. But we can't do it without you. For the first time, we're offering an ad-free experience to qualifying contributors who support our fearless journalism. We hope you'll join us. You've supported HuffPost before, and we'll be honest — we could use your help again. We won't back down from our mission of providing free, fair news during this critical moment. But we can't do it without you. For the first time, we're offering an ad-free experience to qualifying contributors who support our fearless journalism. We hope you'll join us. Already contributed? Log in to hide these messages. “We want to level the playing field for those people who are marginalized and give them a chance to showcase their talent and also go directly to the audience, as opposed to having someone in traditional Hollywood tell you that it’s not gonna work,” he said. “Instead, we’ll make it, put it out and let the audience decide if it’s going to work or not.”",
    "sentiment_val": 0.1908,
    "sentiment_sd": 0.2855,
    "month": "2021-04",
    "data$month": "2021-04"
  },
  {
    "url": "https://www.huffpost.com/entry/zenat-begum-playground-coffee-shop_n_6065c663c5b6b56bba289c88",
    "published_date": "2021-04-29T14:19:43Z",
    "title": "Zenat Begum Is Redefining What A Coffee Shop Can Be — And The Community It Serves | HuffPost Entertainment",
    "text": "To read about the rest of the Culture Shifters, including TV writer Cord Jefferson and activist Mariah Moore, return to the full list here. Zenat Begum opened Playground Coffee Shop with the goal of making it a community-oriented space to center and empower the shop’s Black and brown neighbors. Sometimes, that mission gets described as “radical.” Yet in so many ways, her approach isn’t radical at all. “Having access to health care shouldn’t be radical. Having access to food shouldn’t be radical. It is radical in that we are changing the ways that we have access to things and how we are able to distribute those kinds of resources to people. That, for me, is radical, is to be able to shift that power,” she said. “Radical is being able to use the same tools that white people and rich people and non-marginalized, non-Black people have used for years, to then restructure those things to serve us.” Founded in 2016, Playground Coffee Shop in Bed-Stuy, Brooklyn, is much more than a coffee shop. It supports artists from marginalized communities through a radio network and a bookshop selling books and art. A nonprofit, Playground Youth, runs free or donation-based classes on a variety of topics including poetry, sewing, health care access and voter registration. Pre-pandemic, the shop hosted lots of these classes and other community events, like art fairs, open mic nights and film screenings. Like many small businesses, Playground had to pivot last spring, when New York became one of the epicenters of the COVID-19 pandemic. Begum, 27, and her staff set up and stocked community fridges to help neighbors facing food insecurity. They built a sidewalk library for people to take and leave books by authors from marginalized backgrounds. During the summer, they distributed personal protective equipment and meals to Black Lives Matter protesters. Playground’s physical space sits in the same storefront that housed the hardware store run by Begum’s parents, who immigrated to the U.S. from Bangladesh. “A lot of my first experiences are not tied to being an American. It’s tied to being Bangladeshi first and being a child of immigrants first, and seeing my parents go through a trial and error for most of their life and trying to figure out what an American life looks like,” she said. She sees Playground as “a continuation of what my parents had given me via their hardware store,” which closed in 2015 — a space that provides for the community around it, a space built around “survival” and “safety.” “Why are we here? Why is there a business that’s opening, if not to help the people who are neighboring it or communing around it?” she said. “I know what it means to be in a very difficult place: being food insecure and being housing insecure for most of my life, and my parents having to deal with people foreclosing on our house and stuff like that. I know what it feels like to have things ripped away from you.” For Begum, Playground’s worker- and community-centered operation allows for greater agency and control in a system where Black and brown people are so often given little agency and control. It allows for marginalized people to directly build “systems of care and networks of care.” “That level of autonomy is very satisfying because you know, we’re actively talking about defunding the police, we’re actively talking about abolishing the police and what those structures look like,” she said. “And this is what that exactly looks like, is being able to trust your community members to know that, like, if shit hits the fan, as things become really difficult and people lose aid, that we will be there.” She’s conscious of how so much of this work has happened out of necessity and in the absence of government and institutional action, which the COVID-19 pandemic further illustrated. Throughout 2020, small-business owners and community leaders like Begum found innovative ways to step up and provide for their neighbors — but that didn’t have to happen. The effects of this broken system existed far before COVID-19, and without widespread change, they will continue long after. For Begum, that means continuing this community-centered work and building support systems from the ground up. “If we’re going to actively try to abolish this system that is so dangerous and so harmful for Black and brown people, we have to gain that trust within ourselves and create these networks. And it’s so important, more than ever, right now, for people to mobilize within their small communities because grassroots is the most effective, in my opinion,” she said. “I just hope that people have it within themselves to keep going because we need everybody.” If anything, Begum’s experience launching and growing Playground and building on that work during the pandemic has taught her that if you don’t have the tools, you can create them yourself. If you’re marginalized, you can use that marginalization as a strength. We're bringing you the exclusives, scoops and hot takes on the news all your friends are talking about. Join our loyalty program to support our work and go ad-free. You've supported HuffPost before, and we'll be honest — we could use your help again. We won't back down from our mission of providing free, fair news during this critical moment. But we can't do it without you. For the first time, we're offering an ad-free experience to qualifying contributors who support our fearless journalism. We hope you'll join us. You've supported HuffPost before, and we'll be honest — we could use your help again. We won't back down from our mission of providing free, fair news during this critical moment. But we can't do it without you. For the first time, we're offering an ad-free experience to qualifying contributors who support our fearless journalism. We hope you'll join us. Already contributed? Log in to hide these messages. “I can’t change the way that our restaurant industry is failing. But at the same time, if we don’t have adequate systems of care, we’re gonna lose a lot more people than we think,” she said. “If these government agencies are not going to help us, we’re going to do it ourselves, and I think that’s what changing your culture is and shifting your culture is: is to make yourself be seen and be heard.”",
    "sentiment_val": 0.2022,
    "sentiment_sd": 0.3,
    "month": "2021-04",
    "data$month": "2021-04"
  },
  {
    "url": "https://www.huffpost.com/entry/cop-mistakes-gun-for-taser-killing-motorist_n_6075e312e4b08385eb987031",
    "published_date": "2021-04-13T18:22:22Z",
    "author": "HuffPost Video",
    "title": "Cop Mistakes Gun For Taser, Killing Motorist",
    "text": "Microbio",
    "month": "2021-04",
    "data$month": "2021-04"
  },
  {
    "url": "https://www.huffpost.com/entry/derek-chauvin-guilty_n_607f49a3e4b0b7050540c8b9",
    "published_date": "2021-04-20T21:25:49Z",
    "author": "HuffPost Video",
    "title": "Derek Chauvin Guilty",
    "text": "HuffPost Video Senior Producer",
    "month": "2021-04",
    "data$month": "2021-04"
  },
  {
    "url": "https://www.huffpost.com/entry/erica-chidi-loom-sexual-reproductive-health_n_606b49eec5b68872efe982f1",
    "published_date": "2021-04-29T14:23:09Z",
    "title": "Erica Chidi Is Helping Black Women Understand Their Bodies In A Broken Health Care System | HuffPost Entertainment",
    "text": "To read about the rest of the Culture Shifters, including TV writer Cord Jefferson and activist Mariah Moore, return to the full list here. For Erica Chidi, knowledge is power. Or, to be more precise, understanding is power. In the course of a career largely devoted to women’s sexual and reproductive health care, Chidi has been a health educator, a doula, an advocate for reproductive justice for Black and incarcerated women and a startup founder. One thing has been consistent, through a litany of roles: She wants women — especially Black women — to understand their bodies, and to be understood. “Sexual reproductive health is the great equalizer,” Chidi told HuffPost in a Zoom conversation. She recalled her time as a doula in San Francisco, where she worked with well-off women and couples in the tech field in private practice and also provided those services to incarcerated women as a founding member of the Birth Justice Project. “Everyone, regardless of whether you are super wealthy, or you are not wealthy and in a super challenging situation, everybody wants the same information. Everyone wants to know how to protect themselves and take care of their bodies.” In 2016, Chidi and co-founder Quinn Lundberg launched the wellness company Loom with a cozy, hip brick-and-mortar space in Los Angeles that offered workshops on sex and reproductive health. For the past year, she has been working on a new digital expansion for Loom. The platform, which launches this spring, aims to make the same kind of classes and community found at the LA storefront accessible to a whole new swath of people. “I knew firsthand through my one-on-one health coaching and doula work over the years that giving someone the education about what they’re going through and what they’re about to experience can change outcomes for sure,” Chidi said. “But even if the outcome remains exactly the same, their experience is better because they have this awareness.” The child of a doctor and a nurse, both from Nigeria, Chidi was born in Champaign-Urbana, Illinois, and moved frequently as a child. When she was 10, after her parents divorced, she joined her father in South Africa, where she spent her adolescence. “Moving around just gave me a lot of insights on the human condition, and it gave me a lot of empathy for people in different environments, especially going from the States to South Africa, maybe four years or so after apartheid ended,” she said. “I’ve always had a very deep curiosity about other people, and being a woman, I always had a deep curiosity about the other women in my life.” Chidi was an early and voracious reader, and often joined her father, an endocrinologist and infectious disease specialist, on his hospital rounds. “I like to deeply understand things,” she said. “Coming from two parents in health care, I’ve always been really interested in what’s going on in my body.” Immersed in the health care world from a young age, she wasn’t only drinking in what she saw on those hospital visits, but filling her spare time reading medical encyclopedias. Teaching women about their bodies is a form of caregiving that brings together her passions for connection and for deep learning. “It’s such an innate thing,” she explained. “It’s an innate desire to support people in a way that will help them support themselves, like, you know, giving them a fishing pole to go catch their own fish.” Chidi believes that having a healthy and empowered sexual and reproductive life requires having all the information you need, but it also relies on being listened to, supported, and cared for as a whole person. “In the biomedical model, there isn’t a lot of time for access between a patient and their provider,” she pointed out. As she found in her work as a doula, in the context of pregnancy and childbirth, “that continuous support creates safety, and it helps a pregnant person feel like they are not alone.” Not everyone has access to that support under the current health care system. Loom looks to ameliorate that gap by helping women learn about and advocate for the care they need. “For me the purpose of Loom is to really be that partner for women through their sexual and reproductive health experiences and to deliver education in a compassionate, human-centered and strategic way,” she explained. “When someone takes our class, I’d want them to be able to ask more clearly for what they need and feel like they are a full person because they now have maybe some missing information that was making it hard for them to feel completely present in their own lives or in their own experience.” This is a complicated but urgent proposition in a broken American health care system — particularly for Black women, who are three times as likely to die of pregnancy-related causes as white women. Everyone wants the same knowledge and understanding around their sexual and reproductive health care needs — but not everyone lives with the weight of medical and environmental racism, or faces the same barriers to quality care. In addition to expanding Loom’s resources to a more widely accessible, online platform, Chidi has been exploring more targeted ways to make pregnancy and childbirth safer for Black women. Along with Stanford professor Dr. Erica Cahill, she published a guide to Black maternal care in The New York Times, meant to be used by both patients and caregivers to mitigate unconscious bias and focus on the complications Black pregnant people face at higher rates (like pre-eclampsia). Now, she said, they’re working on research to improve the guide before, eventually, trying to test it in clinical settings. We're bringing you the exclusives, scoops and hot takes on the news all your friends are talking about. Join our loyalty program to support our work and go ad-free. You've supported HuffPost before, and we'll be honest — we could use your help again. We won't back down from our mission of providing free, fair news during this critical moment. But we can't do it without you. For the first time, we're offering an ad-free experience to qualifying contributors who support our fearless journalism. We hope you'll join us. You've supported HuffPost before, and we'll be honest — we could use your help again. We won't back down from our mission of providing free, fair news during this critical moment. But we can't do it without you. For the first time, we're offering an ad-free experience to qualifying contributors who support our fearless journalism. We hope you'll join us. Already contributed? Log in to hide these messages. “It’s never really left my mind that I can’t build a business or a company or shift culture without bringing my people along and also trying to protect them at the same time,” Chidi said. “I’ve always been here for Black women and I will always be here.”",
    "sentiment_val": 0.3427,
    "sentiment_sd": 0.2601,
    "month": "2021-04",
    "data$month": "2021-04"
  },
  {
    "url": "https://www.huffpost.com/entry/jim-jordans-attack-on-biden-crumbles_n_60786279e4b02bed3c251462",
    "published_date": "2021-04-15T15:46:56Z",
    "author": "HuffPost Video",
    "title": "Jim Jordan’s Attack On Biden Crumbles",
    "text": "HuffPost Video",
    "month": "2021-04",
    "data$month": "2021-04"
  }
]
