[
  {
    "url": "https://www.huffpost.com/entry/hannity-threatens-kimmel-for-joking_n_609bc9f8e4b0bff36ae53003",
    "published_date": "2021-05-12T12:23:25Z",
    "author": "HuffPost Video",
    "title": "Hannity Threatens Kimmel For Joking",
    "text": "HuffPost Video",
    "month": "2021-05",
    "data$month": "2021-05"
  },
  {
    "url": "https://www.huffpost.com/entry/asian-americans-leading-art-activism_n_606b1f9fc5b68872efe946df",
    "published_date": "2021-05-05T13:32:27Z",
    "author": "Story By Marina Fang",
    "title": "Asian Americans Out Loud",
    "text": "ASIAN PACIFIC AMERICAN HERITAGE MONTH 2021 Asian Americans Out Loud Our project highlighting people who are leading the way forward in the face of trauma and fear in Asian communities across America. You can read more by visiting our APAHM  2021 homepage. Story By Marina Fang Illustration by Nicole Xu The week of March 15 was a lot of emotional whiplash. It began with the thrill of seeing so many overdue firsts for Asians in the Academy Award nominations, filmmakers and actors like Chloé Zhao, Riz Ahmed, Steven Yeun, Lee Isaac Chung and Youn Yuh-jung getting celebrated for their craft, in an industry where Asian artists have long been overlooked and marginalized. Less than 48 hours later, a white gunman in Georgia killed eight people during a shooting spree, including six women of Asian descent. Law enforcement sidestepped questions about whether the killings were racially motivated, saying the shooter had “a really bad day” and tying the killings to “a sexual addiction.” But Asian Americans? We knew what it was, after this year of racism — hell, a lifetime of racism. And Asian women? We knew exactly what it was, after experiencing the toxic combination of racism and misogyny our entire lives. Just ask any of us how many times we’ve been catcalled on the street by a creepy guy shouting a racial slur or making a face with slanted eyes. For Asian Americans, that one week, and the past 15 months, has been another perennial reminder that our existence in this country has always been conditional. And progress, if it happens, often moves one step forward, two steps back. AAPI voters were a consequential force in the 2020 election: Years of work by community-based political organizers and activists helped deliver key states for President Joe Biden and Vice President Kamala Harris. In Harris, Asian Americans got to elect one of our own. Across the country, more Asian Americans are running for and getting elected to political office, helping us be seen and heard and represented in the halls of power. One minute, we’re being celebrated for our achievements and held up as examples. The next, we’re considered foreigners in our own country, asked to “prove our American-ness,” scapegoated and reduced to stereotypes. We’re the butt of jokes and the target of attacks. Women pay their respects at a March 27 vigil in Monterey Park, California, to honor the victims of the massage spa shootings in Atlanta that left eight people dead, including six women of Asian descent. Damian Dovarganes via AP It feels like we can’t even fully process one violent attack before news of the next one breaks. In January 2020, when COVID-19 began spreading in China, Asian Americans began experiencing a surge in racist harassment and attacks. Asian-owned businesses saw a precipitous decline in business, with customers’ racist fears about the virus keeping them away. From last March through this February, the group Stop AAPI Hate received a staggering 3,795 reports of racist incidents against AAPIs. This winter, there was a wave of high-profile incidents, including several violent assaults of Asian American elders that resulted in deaths. And then, the Georgia shootings happened. Less than a month later, a gunman killed eight people at a FedEx distribution center in Indiana. At least four of the victims were members of the Sikh community, which has experienced a long history of discrimination and scapegoating. There’s nothing new or unprecedented or extraordinary about this. If anything, it’s all too ordinary, one chapter of a seemingly never-ending saga of anti-Asian racism in America. After 9/11, South Asians were targeted, scapegoated, demonized and subjected to undue scrutiny. During World War II, Japanese Americans were rounded up and incarcerated, their loyalties questioned. In the 19th century, Asian immigrants to the U.S. were deemed “the yellow peril” and branded as filthy disease carriers — not unlike the racist rhetoric and tropes fueling the current wave of racism. Chinese laborers in California were accused of taking white workers’ jobs, rhetoric that was used to justify decades of restrictive immigration laws against Asian Americans. And throughout world history, people of Asian descent have been subjected to colonialism and imperialism, exploited for our labor and displaced, creating generations of trauma. We’re so used to being omitted from our own narratives, whitewashed from movies and television and erased from the historical record. As historian Erika Lee notes in her seminal book “The Making of Asian America,” as much as 90% of the workforce building the transcontinental railroad in the American West during the 1860s were Chinese immigrants. Yet, in the official photographs commemorating the completion of the railroad in 1869 — the joining of the route’s western and eastern halves at Promontory Point, Utah — there’s a sea of white men. A group photo commemorating the ceremonial driving of the \"golden spike\" to complete the first transcontinental railroad at Promontory Point, Utah, on May 10, 1869. Photo by Andrew J. Russell/ClassicStock/Getty Images “Asian Americans have been both included and excluded from the country, sometimes simultaneously,” Lee writes in the book’s introduction. The model minority trope may be the best encapsulation of the weight of our conditional existence. A cynical strategy by white politicians and academics to portray us as “the good minorities,” it ignores structural racism, lumps all of us together, reduces us into props, pits us against other people of color and reinforces a racial hierarchy with whiteness always at the top. Generations of Asian Americans grew up with few, if any, real, authentic images of ourselves in pop culture. Instead, we got offensive accents and caricatures. We got “dragon ladies,” Mickey Rooney in yellowface, Long Duk Dong and Apu. We’re so used to hearing the dreaded “where are you really from?” question that we’ve learned to preempt it (“My parents are from China, but I grew up in Pittsburgh,” I say upfront, maybe too appeasingly). “The underlying assumption behind these questions is that Asians cannot possibly be real Americans and do not belong in the United States. Instead, they are perpetual foreigners at worst, or probationary Americans at best,” Lee writes. “The persistence in treating Asian Americans as outsiders in their own country has resulted in everyday racial slights as well as targeted violence, murder, and hate crimes.” Throughout the past year, we’ve been asked to comment on the unrelenting wave of anti-Asian racism tied to the COVID-19 pandemic, explain how it’s just one chapter of a centuries-long history and relive our traumas, when it would be nice to talk about, write about and create art about literally anything else. As “Saturday Night Live” cast member Bowen Yang put it in a “Weekend Update” segment at the end of March, addressing the unrelenting wave of anti-Asian racism: “I don’t even want to be doing this ‘Update’ piece. I wanted to do my character ‘Gay Passover Bunny.’” Umbrella terms like “Asian American” and “AAPI” can run the risk of glossing over the diversity of our communities and cultures, as well as the disparities within them. However, solidarity is vital to building paths to change. At various points in history, Asian Americans have recognized the need for a collective identity and the power of having strength in numbers, both among fellow Asian Americans and across communities of color. The pandemic has marked a new turning point in AAPI activism, galvanizing even more of us to get loud. “Too often, when our communities are in the news, it’s only in the context of traumatic events, like everything that has happened in the past 15 months. In these stories, we want to spotlight our whole selves.” But we don’t want to be defined by our traumas. We’re no longer fighting for crumbs, but the whole damn loaf. We’ve been making spaces for ourselves, making sure we’re not just getting a seat at the table, but sitting at the head of it. In the face of everything, we’ve found ways to spread joy, be resilient and triumph. Some of this work has happened directly in response to the pandemic and this year and a half of pain and fear and trauma. And some of it has been happening all along, sometimes without fanfare or recognition. For HuffPost’s Asian Pacific American Heritage Month series Asian Americans Out Loud, we are giving people their due, in profiles, features, essays and videos about AAPI people and organizations unapologetically breaking new ground and blazing trails. Too often, when our communities are in the news, it’s only in the context of traumatic events, like everything that has happened in the past 15 months. In these stories, we want to spotlight our whole selves. Advocates like Alice Wong have led the way in making sure presidential candidates can no longer ignore disability rights as a decisive, national issue. Amanda Nguyen is working to make her Sexual Assault Survivors’ Bill of Rights the law in all 50 states, and is asking important questions about what justice and accountability look like for survivors of sexual violence. We’ve been honoring and building on America’s history of cross-racial solidarity, marching in Black Lives Matter protests and trying to eradicate anti-Blackness from our families and communities. Community activists like Vivian Huang and Stanley Pun in the Bay Area are pushing for alternatives to policing, recognizing that our communities have also faced overcriminalization and harm at the hands of law enforcement — and that our fight as Asian Americans is stronger when we stand together with fellow communities of color. Tsuru for Solidarity, a group of Japanese Americans galvanized by the trauma of being incarcerated during World War II, now protest immigrant detention centers and advocate for Black reparations. And in whatever ways we can, we are telling our own stories and taking control of our own narratives. We’re breaking the stigma around topics we’ve traditionally been conditioned not to talk about, from mental health to sexual abuse. We’re working to preserve our heritage, from New York City’s Chinatown to Louisiana’s Filipino settlements. We’re reclaiming and decolonizing our stories and finding creative ways to tell them, like creating theater that satirizes the process of storytelling for the white gaze, or building games that incorporate our history and mythology. We’re here and we’re unstoppable. We are not a silent, invisible, nameless, faceless mass. We’re making waves, defying and obliterating the insidious stereotypes that have marginalized us for far too long. We’re telling our stories every day: yes, our traumas, but also our triumphs — and everything in between. More APAHM Stories How Welcome To Chinatown Is Preserving The Vibrancy Of Asian-Owned Small Businesses With ‘Endlings,’ Playwright Celine Song Dove Deep Into Asian Identity. She Won’t Be Stopping There. Japanese American Activists Support Black Reparations To Heal Wounds Past And Present",
    "sentiment_val": -0.0354,
    "sentiment_sd": 0.3224,
    "month": "2021-05",
    "data$month": "2021-05"
  }
]
