[
  {
    "url": "https://www.huffpost.com/entry/cheap-ski-snowboarding-winter-gear_l_61c25734e4b0d637ae87c322",
    "published_date": "2021-12-24T10:45:05Z",
    "author": "Janie Campbell",
    "title": "The Best Sites To Buy Cheap Ski, Snowboarding And Other Winter Gear",
    "text": "If you practically live on the slopes every winter, you probably have all the fancy gear, jackets, wool ski socks and snowsuits you need. But if you only occasionally go skiing or snowboarding, you know it’s beyone painful to pay retail price for all the specialized outerwear, base layers and other things you need to stay warm and dry for just a few days of wintery fun. There’s good news: A number of online retailers carry discounted or past-season winter and snow sports gear at lower cost, or they regularly offer accessible new lines at prices that don’t hurt as much. You could patiently wait for sales at other retailers or haunt your local secondhand store every spring, but these sites exist solely for the purpose of bringing you savings on cold weather outdoor gear every day. HuffPost may receive a share from purchases made via links on this page. Every item is independently selected. Prices and availability are subject to change. Amazon carries a lot of brands that are big in cold-weather clothing, but there are inexpensive gems to be found in off-brand products. For example, I have a similar version of snowboard jacket above in gray. The brand name Gemyse doesn't add any cachet to my life, but the jacket I bought has everything I need: armpit vents, a waterproof exterior fabric, ample pockets, warm insulation and a truly affordable price tag for snow sports.Left to right: Tough Headwear balaclava ski mask, $26; Gemyse men's snow jacket, $48+; Two pairs of Hylaea merino wool ski socks, $24+; Thermajohn men's thermal layer, $32+. Target has pretty decent cold-weather gear, from everyday puffer coats to a surprisingly feature-packed women's ski bib (which is currently sold out, but is still available in children's sizes) from the in-house All in Motion brand that, I swear, rivals my North Face bib — and it was a quarter of the price. Best of all: Much of what Target carries in this category comes in a wide range of sizes, including women's plus and men's big and tall. Left to right: Alpine Swiss men's insulated snow bib, $70 (regularly $120); Canada Weather kid's ski gloves, $18 (regularly $40); All In Motion children's waterproof snow bib, $40. We all know Nordstrom Rack for its good deals on clothes and shoes, but have you ever searched the site for snow sports? You'll find a mix of discounted ski jackets, bibs, and regular winter gear that'll get you to the slopes such as down jackets and waterproof insulated boots. It's the Rack, so you already know the deals.Left to right: Women's Sorel Caribou X waterproof lace-up boot, $70 (regularly $200); Noize Amelia waterproof women's snow jacket, $150 (regularly $275); men's Ugg Butte City shearling snow boots, $130 (regularly $190). Backcountry.com was started in a Utah garage by two guys selling avalanche equipment; it now offers just about every major outdoors brand and gear for everything from fishing, camping and surfing to skiing and snowboarding, along with its own intriguing house labels, Backcountry and Stoic. It has constant rotating sales. Left to right: Meninx snow helmet, $115+ (regularly $230); Stoic Daisy quilted pullover, $65+ (regularly $129); Vans standard XF snowboot, $120 (regularly $240); Stoic Gripper puffer glove, $18+ (regularly $44). Steep & Cheap is a discount website owned by Backcountry. Not everything is on sale, but deals abound — if you can snag your size before it's gone. In addition to clothing, the site also carries snowboards, boots and safety equipment like helmets for kids and adults. Fun fact: Items carried by both Backcountry and Steep & Cheap are usually cheaper here. Left to right: Mindbender 99Ti women's skis, $375 (regularly $750); women's Stoic anorak waterproof shell, $90 (regularly $199); men's Backcountry insulated anorak shell, $112 (regularly $279). When you don't spend a ton of time in freezing temps, paying an arm and a leg for fancy Merino wool base layers feels like a stretch. Enter Walmart, which carries inexpensive thermals brands like ClimateRight by Cuddl Duds that'll get you through your time on the mountain without making your checkbook cry — and they come in expanded sizes, too! Left to right: Cshidworld touchscreen ski gloves, $18+ (regularly $40); ClimateRight by Cuddl Duds women's thermal base layer, $12+; Snow Country men's big and tall insulated technical pants, $100. Outdoor Gear Exchange is a physical store in Burlington, Vermont, with a large web store to boot. If you're lucky enough to go in person, check out the massive consignment section with deals upon deals (you can even mail in clothes to consign if you're not anywhere near). Both in-store and online, you can find great savings on new merch from all the best snowsports brands, along with lots of equipment like boots, bindings, poles and helmets. Don't miss the store's blog full of helpful advice, such as how to size ski boots.Left to right: Fischer OTX gender-neutral trail touring boots, $180; The North Face men's Trail Grid fleece, $90; Marmot women's Montreal parka, $210+ (regularly $300). Sierra (formerly known as Sierra Trading Post) is owned by the parent company of TJ Maxx, Marshalls and HomeGoods, so you know you'll find a deal. The website is chock-full of discounted items, including an impressive sale collection of warm, tough winter socks for men, women and kids from the likes of SmartWool and Icebreaker. Left to right: Women's Bogner Evelia insulated down puffer, $400 (regularly $880); Head Day LYT snowboard, $199 (regularly $300); Smith Skyline men's ski goggles, $100 (regularly $180); women's Scarpa Made in Italy Gia Alpine ski boots, $299 (regularly $380). Bless the retailers that put their sale items in their very own outlet section so we can shop without full-price temptations. REI's outlet is great for deals on its own brand, plus select products from favorites like Patagonia, The North Face, Obermeyer, Outdoor Research and Helly Hansen. Left to right: Women's Patagonia Powder Town bib pants, $149+ (regularly $299); men's Woolrich merino wool hiking socks, $15 (regularly $20); Turtle Fur Freya knit hat, $34; The North Face 1996 Retro men's Nuptse vest, $160 (regularly $230). Surprise! ASOS can be a sweet spot for relatively inexpensive but trendy-looking ski gear, including gloves and goggles. Best of all, the retailer's snow gear selection includes ASOS's in-house brand with options in extended sizes including women's petite, tall and curve. Left to right: Women's retro belted ski suit, $209; men's water-repelling ski pants, $119; men's water-repelling ski suit, $199. Public Lands, which recently acquired Moosejaw and Mountain Steals, is an outdoor-forward online and brick-and-mortar retailer that’s part of Dick’s Sporting Goods. It carries most major outdoor brands and has a rewards program and regular sales that'll make everyone happy, from ski enthusiasts to hardcore campers and climbers. In addition to winter clothes, Public Lands also sells equipment like snowboards, skis and helmets. Left to right: Columbia men's Delta Ridge II down jacket, $150); Colombia women's Snowtrot Shorty snow boot, $75+ (regularly $100); Oakley unisex Flight Deck L snow goggles, $160+ (regularly $225). Mountain Hardwear's winter gear isn't cheap, but there's a fun little corner of the brand's website: the MHW outlet. Here you can find sale items at pretty deep discounts, although that brings the price point on par with many other national brands. For example, I snagged a pair of ultra lightweight down pants for $80 that normally retail for $275. They weren't cheap, but they were a deal that'll definitely last. (One huge bummer: Mountain Hardwear still doesn't make clothing in extended sizes for women.)Left to right: Men's Stryder full-zip sun and wind shell, $110; PCT 70-liter backpack, $180 (regularly $300); women's Dolores insulated flannel shacket, $60 (regularly $150). Columbia has sales fairly often, but they also have an ongoing \"deals\" section of the website. Grab clothes, shoes and equipment for both adults and kids for up to 50% off, some of it in larger sizes for both men and women. Left to right: Women's Apres Arson long down jacket, $150 (regularly $300); women's Keetley II insulated winter boot, $70 (regularly $140); men's Barlow Pass TurboDown jacket, $145 (regularly $290). Arc'teryx offers discounted past season outerwear, footwear and equipment in its outlet site, which is divided into men's and women's sections and will be closing soon, so shop it while you can! It doesn't make their products inexpensive, but you can find some decent savings on splurge-y items. The company also has a ReGear section that sells secondhand Arcteryx clothing that's been inspected and refreshed if necessary.Left to right: Women's Rho cold baselayer, $84 (regularly $120); women's Gore-Tex touring bib, $595 (regularly $850); men's Macai Gore-Tex ski pant, $560 (regularly $800). By entering your email and clicking Sign Up, you're agreeing to let us send you customized marketing messages about us and our advertising partners. You are also agreeing to our Terms of Service and Privacy Policy.",
    "sentiment_val": 0.1824,
    "sentiment_sd": 0.2054,
    "month": "2021-12",
    "data$month": "2021-12"
  },
  {
    "url": "https://www.huffpost.com/entry/healthy-holiday-coffee-drinks_l_61a521f2e4b0ae9a42b2042f",
    "published_date": "2021-12-01T10:45:02Z",
    "author": "Leigh Weingus",
    "title": "How Healthy Are Your Favorite Starbucks Holiday Coffee Drinks?",
    "text": "It’s officially that time of year: We’re making our list and checking it twice, and saying goodbye to pumpkin spice lattes and hello to peppermint mochas. Yep, it’s officially holiday-themed latte and mocha season at every coffee chain, but we took a look at the items on Starbucks’ popular menu in particular. Just how bad (or good) are those chestnut praline and salted caramel lattes? Which holiday coffee beverages are perfectly fine holiday treats, and which ones are full-fledged sugar and calorie bombs? Here’s what nutritionists had to say, plus some advice for making these drinks a little healthier (because honestly, none of them are too great!). Iced Sugar Cookie Almond Milk Latte: B+ No, you won’t find this at every coffee chain. But if you happen to swing by a Starbucks, you can be sure that this beverage won’t wreak much havoc on your health. “At only 150 calories, 3.5 grams of total fat, 0 grams of saturated fat and 25 grams of added sugar, this is a nice treat that will not totally ruin your day of nutrition intake,” said Kylene Bogden, a registered dietitian and wellness adviser for Love Wellness. But registered dietitian Tracy Lockwood Beckerman noted that the almond milk has a surprising downside. “It pulls in the lowest amount of protein, so it’s more likely to leave you hungry afterwards and craving more sweets,” she said. Gingerbread Latte: B- Starbucks uses a syrup that contains a whopping 38 grams of sugar, but some coffee shops use a spice blend that contains much less. Always read the nutrition facts if you’re being careful about your sugar intake. Chai Latte: B- Again, depending on where you go, a chai latte can either be pretty good for you or pack way too much sugar and no health benefits. “Because chai tea is typically a blend of top-notch spices like black tea, cinnamon, cloves, ginger and cardamom, it’s likely to contain the most health perks like improved circulation, heart health and digestion,” Beckerman said. “However, places may use chai tea concentrate, so it may not truly contain enough of the herbs and spices to lead to any health benefits.” At Starbucks, chai comes in the form of a syrup that’s loaded with sugar. A grande chai latte from Starbucks, for example, contains 42 grams of sugar. That’s way more than the recommended amount for adults — added sugars should be no more than 10% of your daily caloric intake, according to the USDA’s dietary guidelines. Beckerman’s advice? Only get chai lattes from coffee shops that don’t use a concentrate. Peppermint Mocha: C Bogden refers to the peppermint mocha as a “human health bomb,” noting that a grande peppermint mocha at Starbucks contains 54 grams of sugar. But if you visit a coffee shop that uses real peppermint instead of peppermint-flavored syrup, you may be able to get some health benefits. “Besides fresh breath, peppermint can improve digestion, congestion and may even help with headaches,” Beckerman said. “Plus, the antioxidants in peppermint may be able to improve immunity, too.” Eggnog Latte: C- Nutritionally speaking, the eggnog latte doesn’t look great at first glance. As Bogden noted, a grande at Starbucks has the most saturated fat across the board and 52 grams of sugar (yikes). The eggnog latte is by no means healthy, but Beckerman did note that there are some nutritional benefits — one being that it has 17 grams of protein. “Because we are working with the egg whites and milk, we are left with more robust nutritional makeup like vitamin A and D and a heftier protein profile than most of the other beverages,” she said. “Because of that, you are more likely to walk away more full and satisfied.” Chestnut Praline Latte: D The Starbucks chestnut praline latte is packed with sugar (although not the most sugar, at 39 grams for a grande). But Beckerman noted that it really doesn’t come with any health benefits, other than protein from the milk. Salted Caramel Latte: F Sorry, salted caramel latte lovers, but Bogden deemed this one the absolute worst holiday beverages at Starbucks: “470 calories, 10 grams of saturated fat, 59 grams of sugar — that’s more than double the daily recommended intake for added sugar.” Beckerman echoed this, adding, “Typically made with milk and caramel syrup or caramel sauce, this is a sugar-loaded beverage with little to no nutrition perks. You’ll be getting a little bit of protein thanks to the dairy milk, but nutritionally speaking, this one is pretty meek.” If you’re feeling a little bit down after finding out just how … not great a lot of these holiday coffee beverages are, worry not: With a few simple hacks, you can make your favorites a bit healthier. “With any of these lattes, the best idea is to kindly ask your barista for half the amount of flavoring pumps to reduce the amount of added sugar, no whipped cream, and to adjust the milk to your dietary and health preferences,” Beckerman said. “You can also ask them for the smallest size possible so you can get a dose of the goodness without it bogging down your health.” Or better yet, Bogen said, make these beverages at home. “In order to mass-produce these lovely little drinks, these companies must order ingredients in bulk,” she said. “Tons of preservatives are added to basic ingredients when you buy them in bulk — for example, you will find additives like potassium sorbate and carrageenan in Starbucks whipped cream. When you make them at home, these delicious drinks can be made almost entirely from whole foods.” A little indulgence, especially around the holidays, is always a good idea. Should you have most of these holiday coffee drinks every day? Probably not — but with a tweak or two or smaller size, you should free to sip away (in moderation!) this December. By entering your email and clicking Sign Up, you're agreeing to let us send you customized marketing messages about us and our advertising partners. You are also agreeing to our Terms of Service and Privacy Policy.",
    "sentiment_val": 0.1445,
    "sentiment_sd": 0.2554,
    "month": "2021-12",
    "data$month": "2021-12"
  },
  {
    "url": "https://www.huffpost.com/entry/how-to-cook-in-a-tiny-apartment-kitchen_l_61a7a139e4b0451e550fad9b",
    "published_date": "2021-12-06T10:45:09Z",
    "author": "Taylor Tobin",
    "title": "How To Make A Big Holiday Feast In A Tiny Apartment Kitchen",
    "text": "The holidays are a prime time for entertaining and whipping up impressive eats to share with friends and family. But if you live in a petite apartment, with kitchen counters that are best measured in square centimeters rather than square feet, hosting your crew for a festive meal can feel like a terrifying challenge. Fear not, though: With a bit of organization, some strategic menu planning and a determined attitude, you can turn your cozy flat into the perfect setting for a fun, satisfying and relatively low-stress feast. Read on for small-space holiday entertaining tips from pro chefs and event planners with plenty of firsthand experience where tiny apartment kitchens are concerned. When you have limited space in your kitchen and your home in general, an uncomplicated approach to party hosting is in your best interest as well as your guests’. When putting together your menu, “don’t overcomplicate it,” advises chef Dan Churchill of Charley St. in New York City. “Using fewer ingredients can actually mean a better (and less stressful to prepare) dish,” Churchill says. “I would concentrate on roasting and creating dishes that require one pan; that way, you can build flavors together and load up your oven and leave the rest of your kitchen for putting together sauces, sides, and so forth.” And speaking of which... Recipe developer and food blogger Jason Goldstein of Chop Happy insists that the best move for a holiday dinner in a small space is “an all-in-one dish. For example, I would make a slow cooker dish like brisket with potatoes or rib roast with seasonal vegetables. This allows you to save room and have both a main dish and a side handled.” Check out some of our favorite one-pot recipes. If you leave all your party cooking until the day of the event, it virtually guarantees a stressful situation. Instead, “Top Chef” alum and chef/restaurateur Spike Mendelsohn urges you to “make sure you’ve prepped everything the day before so you’re not doing everything at the last minute.” “Try to spread out the preparation of your meals,” says chef and recipe developer Laura Ritterman of Recipe Fairy. “Baking your desserts and freezing them, and then making your sides a couple days before, can help you avoid having to cook everything on the same day. Then you simply need to reheat the food on the day of!” Even if you get a great head start on your prep work by cooking several dishes ahead of time, there will inevitably still be kitchen work to do on the day of the party. To accomplish those tasks as cleanly and quickly as possible, follow the advice of Portland, Oregon, chef (and “Top Chef” vet) Sara Hauman and “pull ingredients out of the cabinet or fridge and group them together depending on the recipe, then do one or two recipes at a time.” Hauman says that “trying to tackle it all at once generally leaves me feeling overwhelmed and way more likely to forget an important step” ― but breaking up the workload makes the to-do list feel far more manageable. A lack of counter space may be the single biggest obstacle to cooking for a party in an apartment kitchen. Luckily, it’s a problem that’s easy to fix with a bit of imagination (and a few temporary structures). “When you don’t have a ton of countertop space, it’s time to start thinking about other flat surfaces for things like chopping and ingredient storage,” says New York-based chef and nutrition consultant Julia Chebotar. “If you have the space and extra money, invest in a rolling foldable kitchen island or cart. If you’re running short on either, take a look around your apartment for a quick fix. Do you have a coffee table you could clear off? Or maybe a slim television console or desk that’s light enough to drag closer to the kitchen? These make great temporary solutions.” If the idea of rearranging furniture or household items feels daunting, start your repurposing adventure with something small and simple, like this suggestion from personal chef Robbie Held of Health Held in Hand: “[Try] sliding a cutting board across the sink for instant counter space.” Cooking a big meal in a small space might seem like an all-appliances-on-deck endeavor, where you’ll need pots on the stove, pans in the oven, containers in the microwave, sauces in the blender, veggies and proteins in the slow cooker... and a chaotic mess all over your counters (and in your head). However, chef and cookbook author Priyanka Naik assures us the cooking process doesn’t have to go down like that. “My recommendation is to build a menu where the majority of the dishes can be made on either the stovetop or in the oven, [which lets you] avoid opening and closing the oven door while cooking on the stovetop and to avoid excess heat from the oven,” she says. “I know this from experience ― trust me!” “If I have to make a dish that requires ‘roasted stuffed peppers’ but every other dish is made on the stovetop, I’ll just half and sear the peppers in a non-stick skillet on the stovetop and cover it with a lid to help the peppers cook through and get charred,” Naik notes. “This works [just as well as] turning on the oven, preheating it, greasing a baking sheet and opening and closing oven doors.” Many traditional holiday meals (like roast turkey) are large-format dishes that require a great deal of oven and counter space to properly cook and serve. When hosting in a less-than-spacious home, it’s smart to consider alternatives to the typical festive fare that don’t take up quite as much kitchen real estate. For instance, event producer and entertaining expert Amber Mayfield of To Be Hosted in New York likes to swap out a big roast for a hearty and flavorful pasta dish, like “a short rib lasagna (or eggplant lasagna if you want to go meatless) or a bountiful seafood pasta. Some easy side dishes: roasted vegetables, garlic mashed potatoes, a beautiful salad, dinner rolls, or cornbread.” If you’re dead-set on making a turkey in an apartment kitchen, avoid the full bird in favor of smaller pieces. Detroit-based chef and restaurateur Max Hardy suggests “options like turkey breast or turkey chops as an alternative.” The point of hosting a holiday party, in theory, is to spend time with loved ones. However, when said loved ones are milling in your small kitchen to chat and grab drinks and tie up the traffic flow through your workspace, you might find yourself wishing they’d spend time somewhere else. Luckily, recipe developer Ashley Schuering of The Grocery Addict knows an easy way to relieve this kitchen congestion: “Offer an apps-and-drink station to keep people out of the kitchen. I don’t know what it is, but people always seem to want to congregate in there, even if it’s tiny and hectic. Giving them something to eat and drink and ― most importantly ― the agency to serve themselves is the primary goal here.” Heather Ramsdell, senior editorial director of The Spruce Eats, also views redirection as essential, encouraging us to “draw the crowd away from your kitchen. Put all beverages somewhere else. A big batch cocktail is super festive.” She notes that you can “lure [people] out by placing essentials outside of your kitchen. Have places for coats and bags. Have plenty of water, all of the ice, all of the drinks, and all of the snacks located outside of the kitchen. Borrow a cooler if you can.” In spite of the challenges of entertaining in a small space, one advantage is that there’s “less space to clean up when it’s all said and done,” Hardy suggests. That said, waiting until the party ends to do all the dishes, wipe down every surface and deal with empty glasses and bottles can prove overwhelming, even in a little apartment. Big money interests are running the government — and influencing the news you read. While other outlets are retreating behind paywalls and bending the knee to political pressure, HuffPost is proud to be unbought and unfiltered. Will you help us keep it that way? You can even access our stories ad-free. You've supported HuffPost before, and we'll be honest — we could use your help again. We won't back down from our mission of providing free, fair news during this critical moment. But we can't do it without you. For the first time, we're offering an ad-free experience to qualifying contributors who support our fearless journalism. We hope you'll join us. You've supported HuffPost before, and we'll be honest — we could use your help again. We won't back down from our mission of providing free, fair news during this critical moment. But we can't do it without you. For the first time, we're offering an ad-free experience to qualifying contributors who support our fearless journalism. We hope you'll join us. Already contributed? Log in to hide these messages. Executive chef Nick Ritchie of Signature Kitchen Suite in Napa Valley, California, advises: “If you stick to keeping your process organized and cleaning as you go, your holiday cooking will be a lot less stressful, and you’ll be able to relax at the end knowing you don’t have a mountain of dishes waiting for you to complete. I use the same rule of thumb when preparing food in commercial kitchens as well.” By entering your email and clicking Sign Up, you're agreeing to let us send you customized marketing messages about us and our advertising partners. You are also agreeing to our Terms of Service and Privacy Policy.",
    "sentiment_val": 0.2351,
    "sentiment_sd": 0.2537,
    "month": "2021-12",
    "data$month": "2021-12"
  },
  {
    "url": "https://www.huffpost.com/entry/how-much-eggnog-can-you-drink_l_61ae8960e4b07c4c95c1b939",
    "published_date": "2021-12-13T10:45:07Z",
    "author": "Alexandra Emanuelli",
    "title": "Is That Eggnog Going To Make You Feel Sick? Here's What To Look Out For.",
    "text": "It’s the holiday season. Throw out the pumpkin spice lattes and pour yourself eggnog, the little black dress of drinks, perfect for adding to everything from breakfast coffees to spiked evening cocktails. But one too many eggnogs can cause a less-than-jolly experience, especially in terms of digestive distress. Let’s unpack why that is and whether there is such a thing as too much eggnog (unfortunately, yes) so you can celebrate the season without giving up this favorite tradition. “Eggnog is just an alcoholic Christmas milkshake,” registered dietitian and nutritionist Amanda Frankeny told HuffPost. “Think what’s in it: heavy cream, milk, sugar, whipped eggs and alcohol.” And with the recommended serving size a paltry half a cup, eggnog is easy to over-indulge. High in fat and sugar, a single serving contains one-third of the fat Americans should eat daily. Add spirits such as bourbon, whiskey, brandy or rum and you can increase your risk of dehydration-related effects (aka a hangover) as well as digestive discomfort (more on that later). While food is neither morally good nor bad, just nutritionally different, we can easily overlook how much we consume over the holiday season, especially when it is a liquid. That can impact how we physically feel if we imbibe too heavily. The final breakdown tallies old-fashioned eggnog at 200 calories per half-cup with 24 grams of sugar and 10 grams of fat. For many Americans, this drink is a no-go at face value. People with diabetes, lactose intolerances, or egg and dairy allergies, as well as those abstaining from alcohol would all find this drink to be problematic. For the rest of people who don’t mind ice cream and whipped cream every so often, imbibing a glass or two can still raise a red flag to the digestive system. “For some, the heavy combination of sugar, heavy cream, milk and alcohol could be a disaster waiting to happen,” Tracy Lockwood Beckerman, a registered dietitian, told HuffPost. “That’s because all of these can compound into a difficult-to-digest situation, requiring digestive enzymes like lactase, sucrase and alcohol dehydrogenase to kick into high gear all at the same time. This could lead to gas, diarrhea, cramping or abdominal pain within 30 minutes to a few hours after drinking.” The most common ingredients and foods that can cause diarrhea were identified in an article by Harvard Health Publishing. Drumroll, please: eggnog’s main components — sugar, dairy and alcohol — are on the list. Rich, delicious foods like cream contain more fat and are slower to digest. This is great when we want to feel satiated and prevent feeling hungry, but it can be less than ideal when we overeat or combine other foods that are slower to digest. “Eggnog is made with ‘heavy’ ingredients that, eaten in exclusion of anything else, might cause stomach distress,” registered dietitian Barbara Ruhs said. “Cream is full of fat and that takes longer to digest. Raw or pasteurized raw eggs are not typically consumed at any other time, so the novelty to the GI tract can also be problematic.” “My recommendation is to enjoy eggnog in small doses — treat eggnog as you would a glass of expensive champagne — sip it and serve in small doses,” Ruhs said. While most of us won’t stop at half a cup of the sweet stuff (and the dietitians we spoke to concede that the correct portion size is different for everyone), what feels right for you depends on your sensitivities, tolerances and a whole host of other factors. “Indulging during this time of year isn’t going to overhaul your long-term health,” Frankeny explained. “We all can get carried away at holiday parties! The best thing you can do is note that you had too many sips, feel the repercussions, ponder why you might have done that, and move on!” Most commercially available eggnogs are pasteurized, so the risk of falling ill from uncooked eggs is pretty minimal. They have been cooked and held at 160 degrees Fahrenheit to ensure that foodborne illnesses, such as salmonella, E. coli, listeria and campylobacter, are no longer present. If you choose to make your eggnog, start with pasteurized eggs, as this process can be pretty challenging and potentially dangerous for newbies. But even if we are chugging store-bought, pasteurized eggnog, a tummy ache is possible. “Be aware of how long your eggnog sits out during holiday parties,” Frankeny warned. “Don’t let this perishable item stay at room temperature for no more than two hours, or else it should be discarded. It can also be kept safe in a fridge.” The classic holiday party scene of a bowl of eggnog dusted with nutmeg and left out all night for guests to enjoy may be nostalgic and Rockwellian, but it is an invitation for food poisoning. Keep your eggnog in the fridge and serve individually. Frankeny elaborated, “always be aware of an off color, scent or flavor, which may mean your drink has gone bad, even if it’s before the actual expiration date.” You may have seen someone add alcohol to a dubious vat of eggnog (or other concoction) and explain that the alcohol has antibacterial properties, so all is well. Not so fast. Despite that being true (when you scraped your knee as a kid, your parent may have wiped your leg with rubbing alcohol), alcohol’s antibacterial properties can take weeks to take effect. “Some may think that alcohol can ‘kill’ any bacteria that is in the drink, but that’s just not the case. Alcohol does not prevent bacteria from growing and it does not sterilize bacteria if added to a drink or consumed at the same time,” Ruhs said. The added alcohol in your drink may also be adding to your digestive discomfort. “Alcohol absorption into the body happens in the small intestine, Frankey explained. “The presence of fatty food or drinks can significantly slow the absorption of alcohol into the bloodstream because these things sit in the stomach longer. The slower alcohol is absorbed, the slower it affects the body.” An alt-nog might be a better option if dairy is tricky for you. Oat, soy, nut and seed varieties are widely available and typically contain fewer calories and less sugar, should that be of concern. “Vegan options may be slightly easier to digest than the non-vegetarian versions, however, they are still susceptible to foodborne illness,” Ruhs said. “Keep them in the fridge after opening and don’t let them sit out for too long without refrigeration.” But not all is lost when it comes to downing the traditional version of the drink. “In terms of nutrition, dairy acts as a fabulous source of calcium,” Frankeny shared. “A half-cup of eggnog delivers about 13% of your daily dose. It also packs in magnesium, phosphorus and vitamins A and D. You’ll get about 4-6 grams of protein, too. However, if you’re allergic to dairy, lactose intolerant or looking for a lower-fat option, skip the milk and cream and try the vegan nogs.” By entering your email and clicking Sign Up, you're agreeing to let us send you customized marketing messages about us and our advertising partners. You are also agreeing to our Terms of Service and Privacy Policy.",
    "sentiment_val": -0.0411,
    "sentiment_sd": 0.2951,
    "month": "2021-12",
    "data$month": "2021-12"
  }
]
