[
  {
    "url": "https://www.huffpost.com/entry/trump-wanted-to-beat-the-fk-out-of-protesters_n_60d5f4a6e4b0f1f0905a06cf",
    "published_date": "2021-06-25T15:15:58Z",
    "author": "HuffPost Video",
    "title": "Trump Wanted To ‘Beat The F**k’ Out of Protesters",
    "text": "Microbio",
    "month": "2021-06",
    "data$month": "2021-06"
  },
  {
    "url": "https://www.huffpost.com/entry/jill-biden-shares-major-difference-since-trump-era_n_60dc89d8e4b087a9ad9b63ac",
    "published_date": "2021-06-30T15:07:49Z",
    "author": "HuffPost Video",
    "title": "Jill Biden Shares Major Difference Since Trump Era",
    "text": "HuffPost Video",
    "month": "2021-06",
    "data$month": "2021-06"
  },
  {
    "url": "https://www.huffpost.com/entry/5-everyday-ways-to-teach-your-kid-to-be-a-proud-lgbtq-ally_l_60c10246e4b059c73bd5214c",
    "published_date": "2021-06-09T22:02:31Z",
    "author": "Catherine Pearson",
    "title": "5 Everyday Ways To Teach Your Kid To Be A Proud LGBTQ Ally",
    "text": "So many parents want to raise children who are LGBTQ allies, but it isn’t always clear how to do that instead of just paying lip service to the idea, particularly for non-LGBTQ families. These conversations can feel difficult, especially if you never had them in your own household growing up. But parents should not assume allyship is something their child will just learn on their own, no matter how kind they are. “Unfortunately, anti-LGBTQ policies and rhetoric are all too common in our communities and institutions. Children are incredibly perceptive and when they see people around them discriminating against LGBTQ people, whether it’s a school administrator, classmate or someone in public, they’re seeing that behavior as a norm,” explained Melanie Willingham-Jaggers, interim executive director of Gay, Lesbian & Straight Education Network (GLSEN), a group that works to make schools safe for lesbian, gay, bisexual and transgender students. But raising good allies is definitely doable, and it can be done through simple but powerful daily strategies. Here are a few to have in mind. While the children’s book world still has a long way to go in terms of representation, there are many amazing titles that can open up family conversations about gender identity and sexual orientation. (For example, here’s a helpful list of 17 of them. Or consider these 15.) Children’s books are so powerful because they can provide kids with “mirrors” (where they see their own experience or their family’s own experience reflected back at them) as well as “windows” (where they learn to care about people whose experiences are different than their own). Plus, reading together strengthens bonds and develops trust between parents and kiddos as they sit next to each other and crack open the pages. “For young children, it’s important to start honest conversations about difference and identity early on and help them understand the importance of respecting all people regardless of their gender, race, disability or any other identity,” Willingham-Jaggers said. “There are a lot of great picture books and other tools geared toward early learners that can help you break down these topics in an age-appropriate way,” Willingham-Jaggers added. Also important? Books help families educate themselves together, without parents putting the burden on LGBTQ people to be their guide. As any parent knows, getting kids to listen is hard — really, really hard. But being a true ally hinges on being able to be a good listener. “A common misstep folks make when trying to be allies is centering themselves in the conversation,” said Willingham-Jaggers. “Teaching your child to be an effective ally is about teaching them to listen to the needs of others, not act in the ways that they think other people would want.” That can be as simple as noticing when your child has done a good job listening to a friend or sibling and pointing it out to them, since praise can be a highly effective tool when it’s clear and genuine. But it’s also important to model good listening yourself. Some experts recommend using the acronym “WAIT” as a gut-check. It stands for “Why Am I Talking?” and it can be a good reminder to check in on your own motivations for opening your mouth. “Teaching your child to be an effective ally is about teaching them to listen to the needs of others, not act in the ways that they think other people would want.” Another simple way parents can model allyship is to introduce themselves to others with their pronouns, Willingham-Jaggers suggested. “To show that you’re committed to creating welcoming spaces and avoid making generalizations about groups of people,” she added. You’re also helping to root children in gender-neutral language so they don’t have to unlearn certain habits or assumptions later down the road. That said, parents should know that learning to use gender-neutral language can take some practice, and that’s totally OK! “There are three parts to empathy: the intellectual part where you understand what empathy is and what it does, the inner part where you actually feel what others are feeling, and the action part where you actually do something for the individual you feel empathy for,” Kai Kafferly, an educator with Outschool who offers classes on LGBTQ history and allyship, told HuffPost. “All three of these parts need to be brought together to teach empathy.” Because kids learn so much through play, it can help to test out different scenarios with your kids where you might ask them to put themselves in someone else’s shoes and consider how they’d feel. That can be done one on one, Kafferly said, or sometimes in a classroom setting. Don’t expect too much of kids under the age of 4, who just don’t have the cognitive ability yet to see beyond their own perspective. But for slightly older children, role play can be “a very mind-opening experience,” Kafferly said. Parents understandably want to protect their children, particularly young children, from hard topics like prejudice, bias and discrimination. And your instinct might be to totally keep them away from distressing news events. But remember, queer people do not have the luxury of being able to avoid discussing those topics, and avoidance only sends the message that you think they are somehow taboo. Let your children know that you’re open to their questions and that if you don’t know the answer to something, you will look into it together. Of course, do all of this in a developmentally appropriate way, without overwhelming children with too much information. Young kids, in particular, need information to be clear and digestible — and you should expect to talk about these topics again and again. Also, know that you can begin talking to kids about all of this at any age, so don’t fret that you have totally missed the boat if you haven’t begun yet. “It’s never too late to learn about allyship,” Willingham-Jaggers said, “and teaching older children about appropriate language and accurate definitions for gender, sexuality and other aspects of identity is a great place to start.” By entering your email and clicking Sign Up, you're agreeing to let us send you customized marketing messages about us and our advertising partners. You are also agreeing to our Terms of Service and Privacy Policy.",
    "sentiment_val": 0.2046,
    "sentiment_sd": 0.3384,
    "month": "2021-06",
    "data$month": "2021-06"
  },
  {
    "url": "https://www.huffpost.com/entry/joe-rogan-explains-why-trumps-fking-dangerous_n_60cb47bbe4b0486bcb0fff61",
    "published_date": "2021-06-17T12:56:14Z",
    "author": "HuffPost Video",
    "title": "Joe Rogan Explains Why Trump’s ‘F**king Dangerous’",
    "text": "HuffPost Video",
    "month": "2021-06",
    "data$month": "2021-06"
  }
]
