[
  {
    "url": "https://www.huffpost.com/entry/gabby-petito-mystery_n_6144b451e4b0d15c4d2f36c7",
    "published_date": "2021-09-17T15:24:29Z",
    "author": "HuffPost Video",
    "title": "Gabby Petito Mystery",
    "text": "HuffPost Video",
    "month": "2021-09",
    "data$month": "2021-09"
  },
  {
    "url": "https://www.huffpost.com/entry/new-trump-lawsuit-brings-out-the-laughs_n_614b2ef2e4b0f830c1ea17f4",
    "published_date": "2021-09-22T13:22:06Z",
    "author": "HuffPost Video",
    "title": "New Trump Lawsuit Brings Out The Laughs",
    "text": "Microbio",
    "month": "2021-09",
    "data$month": "2021-09"
  },
  {
    "url": "https://www.huffpost.com/entry/latina-beauty-secrets_l_614204fae4b0dda4cbd7161b",
    "published_date": "2021-09-21T09:45:04Z",
    "author": "Esther Akutekha",
    "title": "9 Latinos Share The Beauty Secrets They Learned From Their Communities",
    "text": "There are 21 countries in Latin America, but even more cultures within it that each embrace their own unique beauty rituals. While genetics determine the texture of one’s hair, the shape of their eyes or the tone of their skin, community values really shape the ways that beauty and culture collide in our everyday lives. A 2016 study by Univision found that Latinas learn about beauty from their moms at a young age, with 66% saying they were told maintaining their appearance is important. That belief may be shared across Latin America, but specific practices vary from country to country. We spoke to nine people with roots throughout Latin America about the cultural beauty tips they’ve learned from their mamis, papis and extended communities. Here’s what they say keeps their people looking good. “People in my culture take their appearance very seriously,” Monica Veloz told HuffPost. ”When I go to the Dominican Republic, my entire family, their hair is DONE!” Growing up in New York City, Veloz visited Dominican salons weekly, admiring the stylists’ commitment to beauty and thinking, “I want to look like this when I get older. I want to look fine every day.” It has long been customary for Afro-Latinas like Veloz to relax their hair straight, so it took until her mid-20s to be comfortable with her natural texture. She didn’t know anything about makeup until high school. But everything she knows Veloz learned from her mother and aunt, who got her ready for her middle school prom. “My aunt put mascara on my bottom lashes, my mom gave me blush, and I felt so transformed!” To this day, Veloz is a makeup minimalist, which she says is common among Dominicanas, but hair remains a big priority. Carolyn Aronson’s adopted parents made a conscious effort to connect her to Latin culture, and that’s how she realized that her natural flair for beauty was actually part of her heritage. “The Latin culture did everything just a little bit more,” she said. When she eventually met her Puerto Rican birth family, Aronson also connected with their love of natural ingredients. “People on the island of Puerto Rico are ... very in-tune with nature and keep their ingredients on the healthy side,” she said. Speaking with her birth mom exposed her to natural Puerto Rican beauty practices. “I got to hear my mother talking about how she uses coconut oil under her eyes,” she said. “They really tend to use ‘straight from the earth’ products for beauty.” Jamé Jackson’s Haitian family has a minimalist and natural approach to skin care. “My dad figured everything could be solved with aloe vera, black castor oil or apple cider vinegar,” she said. That approach was passed down to Jackson, who applies aloe vera gel over moisturizer and sprays her hair with homemade rosewater. According to Jackson, the entire island embraces a more simplistic approach to beauty, especially when it comes to aging. “Beauty means so much there without even trying ― I feel like in America, a lot of it is trying. We’re trying to look young. In the islands, no one’s trying to look younger. We’re just embracing the things that we have and the beauty of that.” They showed her that “beauty starts from within, then you pair it with color.” She noticed how much Haitians love a loud accent, even with an otherwise plain outfit. To this day, Jackson wears a red lip everywhere. “Everything is vibrant. When I wear neutrals or brown or beiges, I feel basic. This is not who God called me to be!” Get her favorite MAC Cosmetics Quite the Standout for $22. Julissa Prado’s mother taught her that “there’s nothing more Latino than natural living,” a principle she observed in her predominantly Latin Los Angeles neighborhood. When it came to hair, however, not all natural textures were equally embraced. “It was the norm not only in my family, but pretty much with all Latinos, that if they had texture in their hair they would straighten it,” Prado said. “The perception that curly hair was not done, that it was messy, was very normal growing up.” As a result, “I hated my curly hair and I would do the most to straighten it,” she said, even letting her cousin use a clothes iron to stretch out her strands. “My curly hair was like a dirty secret that I didn’t want people to know.” These days, Prado has let go of negative thoughts about her curls, a journey that started in ninth grade, when she learned about European standards of beauty from future Black Lives Matter co-founder Patrice Cullors. She still believes in the power of plants and turns to aloe vera for skin and scalp issues. When Buffy Hernandez was growing up in Los Angeles, everybody sprayed down their hair with Aquanet. But the women back in Belize had a more natural approach to beauty. Her aunts’ skin “was always soft ’cause they were always moisturizing. One used apple cider vinegar to tighten and remove dark spots and blemishes and breakouts. And coconut oil,” she said. Hernandez also remembers how most of the women had a simple routine of a little lipstick or gloss, a spritz of Elizabeth Arden and cold cream. Hernandez’s own mother, however, taught her how to use red lipstick and it remains a staple in her makeup kit to this day. Get her favorite KVD Studded Kiss Creme Lipstick for $10. Joseph Carillo got his love of makeup from his mom, who to this day still wears a black smoky eye everywhere. And his love of fragrance comes from his dad, who was big on cologne. Outside of his parents, though, his Mexican family didn’t embrace a lot of makeup. “My other three aunts wore tinted moisturizer and mascara. Super simple ladies. I think my mother was always just wanting to be more guapa or pretty. She was that girl,” he said. Growing up in El Paso, Texas, he was surrounded by Mexican culture and looked for glamour inspiration to TV stars like Aracely Aràmbula ― whose character on the Mexican telenovela ”Soñadoras” rocked red, crimped pigtails with bold lips ― as well as Cuban-American Daisy Fuentes, one of few Latinas represented on American TV in the ’90s. When comparing Arambula’s attention-grabbing look to what he usually saw on American television, Carillo said: “It was just so bold!” “Using bold color is definitely part of our heritage. I’m not afraid to do a bold lip color,” he said. Venezuela is well known for producing beauty pageant winners. “We look for women who are beautiful inside and out,” said Rosi Ross. “If you check the background of Miss Universe, they are not just beautiful outside.” Still, there’s a cultural expectation that one must always leave the house well dressed with their hair done, no matter what, Ross said. “You need to look good even if you are going to the 7-Eleven.” In Ross’ family, beauty was seen as empowering, with their grandmother preaching to always look your best because “the first time people talk to you, they’re going to remember.” In Venezuela, beauty is also seen as holistic, and even though people like Ross appreciate over-the-counter products with active ingredients like The Ordinary Buffet, they also love natural ingredients such as sugar and honey to hydrate the skin, and cinnamon to brighten the skin. Get The Ordinary Buffet for $16.80. Giovanna Campagna’s Colombian mami taught her that one should “take joy and pride in putting aside time for yourself,” including hair, skin and nails. Campagna believes that this attitude is key to lifelong beauty and that “by putting in just little bits of time into nurturing your beauty and your skin, over time it adds up to aging really gracefully and aging well.” Colombians love natural ingredients like honey, calendula oil and rosewater, Campagna said. While they value consentida, or pampering, Colombians are careful to not overdo it when it comes to aggressive peels, treatments or facials. “There isn’t that much of a facial culture like we see here in the states,” Campagna said. Older women in Campagna’s family, like her late centenarian great aunt, taught her a “less is more” approach to beauty, relying on gentle nurturing care for the skin, including a gentle cleanser and moisturizer to feel great at every stage of life. “Brazilian people, as a culture, are my definition of beauty,” said Amanda Walker, who inherited her people’s love of natural ingredients like avocado oil and making hair treatments using papaya, banana, coconut oil, eggs, yogurt, avocado and aloe vera. She also pointed out Brazilians’ affinity for cleanliness. “They take multiple showers, they’re always clean, always smelling good and looking fresh,” and have well-groomed hair, she said. As a content creator, Walker inspires women to embrace and care for their natural curls ― a feature she says is often stigmatized in society, especially Latin culture. Her Afro-Indigenous mom taught her about natural and inner beauty, and now Walker influences her mom to lean into natural hair. Get her favorite hair mask, Sol de Janeiro’s Triple Brazilian Butter Hair Repair Treatment Mask, for $36. HuffPost may receive a share from purchases made via links on this page. Prices and availability subject to change. By entering your email and clicking Sign Up, you're agreeing to let us send you customized marketing messages about us and our advertising partners. You are also agreeing to our Terms of Service and Privacy Policy.",
    "sentiment_val": 0.3379,
    "sentiment_sd": 0.3115,
    "month": "2021-09",
    "data$month": "2021-09"
  },
  {
    "url": "https://www.huffpost.com/entry/harry-meghan-officially-out-of-royal-family_n_63d2a4b3e4b0c8e3fc7cbaa3",
    "published_date": "2021-09-09T14:19:52Z",
    "author": "HuffPost Video",
    "title": "Harry & Meghan Officially Out Of Royal Family",
    "text": "HuffPost Video",
    "month": "2021-09",
    "data$month": "2021-09"
  },
  {
    "url": "https://www.huffpost.com/entry/small-home-products-that-will-instantly-make-life-better_l_613e447ae4b0628d095ca794",
    "published_date": "2021-09-13T12:23:42Z",
    "author": "Janie Campbell",
    "title": "Small Home Products That Will Instantly Make Life Better",
    "text": "Ever find something that immediately transforms your life? It’s a great feeling! I’ve gotten that lasting buzz from all the solutions on this list, from simpler devices like the smart plugs and portable sound machine to majorly labor-saving appliances like the robot mop and germ-trapping air purifier. The portable washing machine was an absolute game-changer when I moved into a place without washer hookups, and I’d had no idea they even existed. From an outlet expander you can actually plug multiple things into without crowding to a dishwashing brush that won’t get grimy in your sink, check out these practical products that can make a huge positive difference in your home every day, too. HuffPost may receive a share from purchases made via links on this page. Prices and availability subject to change. Some reviews have been edited for length and/or clarity. By entering your email and clicking Sign Up, you're agreeing to let us send you customized marketing messages about us and our advertising partners. You are also agreeing to our Terms of Service and Privacy Policy.",
    "sentiment_val": 0.2561,
    "sentiment_sd": 0.2126,
    "month": "2021-09",
    "data$month": "2021-09"
  }
]
