[
  {
    "url": "https://www.huffpost.com/entry/mitch-shredded-for-racist-filibuster_n_605b5c6be4b006686d958152",
    "published_date": "2021-03-24T15:30:39Z",
    "author": "HuffPost Video",
    "title": "Mitch Shredded For Racist Filibuster",
    "text": "Microbio",
    "month": "2021-03",
    "data$month": "2021-03"
  },
  {
    "url": "https://www.huffpost.com/entry/zuckerberg-deflects-blame-for-capitol-riot_n_605cebf6e4b08ae92de51687",
    "published_date": "2021-03-25T19:56:10Z",
    "author": "HuffPost Video",
    "title": "Zuckerberg Deflects Blame For Capitol Riot",
    "text": "Microbio",
    "month": "2021-03",
    "data$month": "2021-03"
  },
  {
    "url": "https://www.huffpost.com/entry/republican-defends-racist-comments_n_6050f1bfe4b0a98080284184",
    "published_date": "2021-03-16T17:51:20Z",
    "author": "HuffPost Video",
    "title": "Republican Defends Racist Comments",
    "text": "HuffPost Video",
    "month": "2021-03",
    "data$month": "2021-03"
  },
  {
    "url": "https://www.huffpost.com/entry/courteney-cox-puts-her-thanksgiving-meme-to-bed-good-vibes-only_n_64077a9be4b0c62918de9401",
    "published_date": "2021-03-12T18:19:50Z",
    "author": "HuffPost Video",
    "title": "Courteney Cox Puts Her Thanksgiving Meme To Bed | Good Vibes Only",
    "text": "HuffPost Video",
    "month": "2021-03",
    "data$month": "2021-03"
  },
  {
    "url": "https://www.huffpost.com/entry/indoor-dining-dangers_n_603d278be4b0da1140cdc6be",
    "published_date": "2021-03-01T17:25:02Z",
    "author": "HuffPost Video",
    "title": "Indoor Dining Dangers",
    "text": "Microbio",
    "month": "2021-03",
    "data$month": "2021-03"
  },
  {
    "url": "https://www.huffpost.com/entry/dr-anthony-fauci-slaps-down-south-dakota-gov_n_603cf523e4b0c680c9481601",
    "published_date": "2021-03-01T14:03:08Z",
    "author": "HuffPost Video",
    "title": "Dr. Anthony Fauci Slaps Down South Dakota Gov",
    "text": "HuffPost Video",
    "month": "2021-03",
    "data$month": "2021-03"
  },
  {
    "url": "https://www.huffpost.com/entry/hersheys-chocolate-tastes-like-vomit_l_60479e5fc5b6af8f98bec0cd",
    "published_date": "2021-03-22T09:45:02Z",
    "author": "Courtney Iseman",
    "title": "Why Hershey's Chocolate Tastes Like ... Well, Vomit",
    "text": "“So that’s why American chocolate tastes so terrible!” a Daily Mail headline exclaimed in 2017. The case, it seemed, had been cracked on what was behind — at least to Europeans — American chocolate’s long-standing reputation of inferiority. And when we’re talking about American chocolate, the conversation almost always revolves around Hershey’s. Summing up European sentiment, the article’s author Imogen Blake refers to the taste of American chocolate as tangy and slightly sour. Ask an American and while they might disagree that the overall taste is bad, they’re likely to recognize that there is a somewhat more acidic quality to United States chocolate compared to chocolate from, say, Belgium or the United Kingdom. This, the Daily Mail article (among others) alleges, is due to the presence of butyric acid in Hershey’s chocolate. Butyric acid is also found in rancid butter, parmesan cheese and, sorry, vomit. It’s a provocative claim: American chocolate tastes like vomit because it literally shares properties with vomit! How true is it, though? The Daily Mail had reached out to Hershey’s for comment to no avail; the company isn’t too vocal in the press when it comes to refuting claims or answering individual questions. But Hershey’s director of corporate communications, Jeff Beckman, did get in touch with HuffPost, stating there have been a lot of “urban legends” and “inaccurate and just plain false reporting” on the brand’s chocolate over the years. “[There] are the claims that Hershey adds butyric acid to its chocolate,” Beckman said. “This is not true. ... We do not add [butyric acid] to our chocolate.” Still, the flavor remains. So, if Hershey’s chocolate does contain butyric acid, how is it finding its way in when Hershey’s is adamant that they do not intentionally put it there? Butyric acid is a chemical that can be found in your gut, a fatty acid resulting from good bacteria breaking down dietary fiber. It also naturally occurs in milk, butter, parmesan cheese, red meat, vegetable oils and sauerkraut. It’s sometimes added to foods and perfumes for its flavor and aroma properties—some of its molecules smell like apple, pineapple, apricot and pear, for example. “Butyric acid can [also] act as a [food] preservative,” said Sofia Rengman of Perstorp, a Swedish company that produces specialty chemicals including butyric acid, explaining that the chemical can donate a hydrogen ion, penetrate bacteria and kill it. She adds, though, that butyric acid is uncommon in food preservation because there are “cheaper, more efficient, less stinky options.” In an article for the Penn State News back in 2000, Julie Nariman wrote that butyric acid comes from the milk fats in chocolate: “In a process called lipolysis, the fatty acids in the milk decompose, resulting in a rancid or ‘goaty’ taste.” Nariman continued on to assert that Hershey’s purposefully puts its chocolate through lipolysis, a claim that has been echoed from Reddit boards to the Daily Mail. While Hershey’s will not comment on its chocolate-making process for proprietary reasons, Beckman did acknowledge the presence of something called lipase. “Lipase is a naturally occurring enzyme that is present in all dairy milk,” Beckman said. Lipase catalyzes the breakdown of fats to release fatty acids, also known as the process of lipolysis. In other words, even if Hershey’s isn’t actively adding butyric acid, it’s possible it is finding its way in through the chocolate’s other ingredients and production. Few people know exactly how Hershey’s chocolate is made, thanks to the brand’s caginess. If you’ve taken the factory tour at Hershey Park in Hershey, Pennsylvania, well, congratulations: You’re as much an expert on the process as nearly anyone else. Brands like Hershey’s are extremely proprietary, said candy historian and author Susan Benjamin. She adds that these companies aren’t working based on a recipe, as even a careful recipe yields slightly different results each time. Hershey’s would be using a formula, dictating exact percentages of each ingredient. “There are no accidents in these formulas,” Benjamin told HuffPost. In other words, maybe butyric acid isn’t an explicit ingredient in the equation, but it’s also not ending up there as some inadvertent byproduct the brand can’t control. If we’re to believe Hershey’s claims, the most logical explanation for butyric acid’s presence in the brand’s chocolate is that it comes from the milk. “We make our milk chocolate with fresh fluid dairy milk that comes in every day from the dairy farms that surround our chocolate plant in Pennsylvania,” Beckman said. “Small amounts of butyric acid naturally occur in fresh dairy milk and are in the dairy milk that people drink every day.” If there are no accidents in Hershey’s streamlined chocolate-making, then why leave in the potentially sour taste of butyric acid coming from the candy’s milk? It could have something to do with preserving a legacy with perfect consistency. Michael D’Antonio, author of “Hershey: Milton S. Hershey’s Extraordinary Life of Wealth, Empire, and Utopian Dreams,” explained that Milton S. Hershey developed his famous chocolate with an emphasis on fresh milk, choosing to establish his soon-to-be kingdom in rural Pennsylvania among dairy farms for access other chocolate makers hadn’t previously thought to prioritize. Another priority for Hershey, which would seal the brand’s fate as the chocolate producer in America, was stability. “Milton and some helpers spent a lot of time locked up [...] trying to figure out how to mass-produce chocolate that would hold up a long time and ship great distances,” D’Antonio said, adding that Hershey also wanted to be able to do business in hot summer months. At this time, the start of the twentieth century, chocolate was more of a rare luxury, only available in small batches in cities where it was made, and not during summer, when it would melt and spoil. Hershey endeavored to make chocolate something always accessible to everyone, safely and reliably delicious, and he succeeded in this goal of shelf stability and ubiquity. “Hershey’s did for chocolate what a lot of industries did for Americans both before but certainly after World War II, in that they made previously ‘special occasion’ things readily accessible,” said Jason Liebig, a candy and brand historian. “In 1900, a chocolate bar might have been a pretty special treat, but by 1955, it was a far more typical occurrence.” Part of the process to achieve this stability and year-round accessibility, D’Antonio said, involved spoiling the milk. This would be just to the point where the spoiling wouldn’t happen in the actual chocolate: the milk was safe and the chocolate’s flavor and quality was sustained. This method produced milk chocolate with that slight hint of tang. This product, with this flavor, came to be what Americans knew and loved as chocolate, providing the Hershey’s brand with a formula they’d stick with for consistency. So, while Hershey’s may not take the extra step of adding butyric acid, they are using that fresh milk, which has butyric acid in it, and this continues to yield that familiar flavor. Beckman explained another reason for the difference in flavor between Hershey’s and European chocolate: “The drivers of our distinctive flavor are the use of higher amounts of milk cooked at a lower temperature so the milk and sugar do not caramelize,” Beckman said, adding that European milk chocolates, because of cooking at a higher temperature, have more caramel flavor notes. Beckman said this is not an “acidic” flavor, but merely different than the flavor of European chocolate. Taste is subjective; there’s a reason people continue to question the origin of Hershey’s unique flavor and experts continue to weigh in. What’s not subjective is the fact that butyric acid is found in milk, which is in Hershey’s chocolate, and that butyric acid can create notes of sourness and tang — which, yes, some sensitive tasters, or those used to European chocolate, could feel is reminiscent of vomit ... where butyric acid also hangs out. How, then, did this “vomit” flavor come to be associated with all American chocolate, and not just Hershey’s? The answer is simple: Hershey’s invented chocolate as a mainstream treat, therefore becoming the brand every other brand would look to. Plus, in American chocolate’s early days, Benjamin said, there weren’t hard lines between candy producers. “Candy companies made candy for each other,” she said. “Wilbur Chocolate was making chocolate for Hershey’s, and Hershey’s was making chocolate for other companies.” Big money interests are running the government — and influencing the news you read. While other outlets are retreating behind paywalls and bending the knee to political pressure, HuffPost is proud to be unbought and unfiltered. Will you help us keep it that way? You can even access our stories ad-free. You've supported HuffPost before, and we'll be honest — we could use your help again. We won't back down from our mission of providing free, fair news during this critical moment. But we can't do it without you. For the first time, we're offering an ad-free experience to qualifying contributors who support our fearless journalism. We hope you'll join us. You've supported HuffPost before, and we'll be honest — we could use your help again. We won't back down from our mission of providing free, fair news during this critical moment. But we can't do it without you. For the first time, we're offering an ad-free experience to qualifying contributors who support our fearless journalism. We hope you'll join us. Already contributed? Log in to hide these messages. “It’s hard to imagine now, but in the way that Samsung provides things like screens for Apple’s iPhones, Hershey was providing milk chocolate and cocoa to all sorts of competing candy manufacturers,” Liebig said. As Hershey’s became the dominant chocolate on shelves across America, its formula and flavor became the dominant chocolate experience. Brands either emulated the Hershey’s flavor or were sharing the formula in production partnerships. This became what all Americans knew as chocolate. As D’Antonio points out, through generation after generation, many American children first experience chocolate from Hershey’s. They know this is a treat, something that everyone likes, and they form a lasting association between that Hershey’s flavor and indulgence. Adding that so much of the reasoning behind a person’s favorite foods is nostalgia and memory, D’Antonio said, “I know a lot about chocolate, I’ve had chocolate from all over the world, and somehow I still associate Hershey’s with what tastes best.” By entering your email and clicking Sign Up, you're agreeing to let us send you customized marketing messages about us and our advertising partners. You are also agreeing to our Terms of Service and Privacy Policy.",
    "sentiment_val": 0.1847,
    "sentiment_sd": 0.2517,
    "month": "2021-03",
    "data$month": "2021-03"
  }
]
