[
  {
    "url": "https://www.huffpost.com/entry/house-lawmaker-contracts-covid-19-after-both-vaccine-doses_n_60182ca9e4b00be026d339d4",
    "published_date": "2021-02-01T16:21:38Z",
    "author": "HuffPost Video",
    "title": "House Lawmaker Contracts COVID-19 After Both Vaccine Doses",
    "text": "HuffPost Video",
    "month": "2021-02",
    "data$month": "2021-02"
  },
  {
    "url": "https://www.huffpost.com/entry/mcconnell-is-warned_n_602bc8cae4b03836dd7d35ee",
    "published_date": "2021-02-16T13:25:01Z",
    "author": "HuffPost Video",
    "title": "McConnell Is Warned",
    "text": "Microbio",
    "month": "2021-02",
    "data$month": "2021-02"
  },
  {
    "url": "https://www.huffpost.com/entry/diverse-childrens-books-not-about-diversity_l_60248b6cc5b6ddb35815a4f8",
    "published_date": "2021-02-11T20:38:12Z",
    "author": "Catherine Pearson",
    "title": "Diverse Children’s Books That Aren’t About Diversity",
    "text": "Children’s book publishers have come a long way in addressing disparities in representation, but kid lit still remains disproportionately white. Estimates suggest, for example, that only about 30% of books for young children published in the last two decades or so feature Black characters. Fortunately, there has been a flowering of more diverse books over the past few years, particularly those featuring Black, Indigenous and characters of color whose race or ethnicity is not central to the plot. Diverse Book Finder, a free catalog of more than 2,000 picture books with BIPOC characters from researchers at Bates College, calls these “any child” books. A classic example of an “any child” book is “The Snowy Day,” which was one of the first children’s books to center around a Black character — and one to feature a character whose race wasn’t key to the plot in any way. There’s something powerful about books featuring kids who are growing up, making friends, playing in the snow, using their imaginations and enjoying life, and who also just happen to be BIPOC. As the novelist Rumaan Alam said in a 2016 Slate article, “Must every book featuring black faces force our children to confront the tortures of our past and the troubles of our present? These are important things that our black and brown children must learn — but they must also learn the pleasure of reading a story in the relaxed, quiet moments before bed, reading not to learn but to feel safe, feel loved, laugh, wonder.” Of course, stocking up on “any child” books alone won’t teach children about the power of representation, but it is an important step. With that in mind, here are 15 new(ish) diverse books that aren’t explicitly about diversity. This story is part of a HuffPost Parents project called I See Me, a series for all parents and kids on the power of representation. We know how important it is for kids to see people that look like them on the biggest stages, from politics to sports and entertainment and beyond. Throughout February, we’ll explore the importance of representation in teaching kids about difference, acceptance, privilege and upstanding. By entering your email and clicking Sign Up, you're agreeing to let us send you customized marketing messages about us and our advertising partners. You are also agreeing to our Terms of Service and Privacy Policy.",
    "sentiment_val": 0.2151,
    "sentiment_sd": 0.28,
    "month": "2021-02",
    "data$month": "2021-02"
  },
  {
    "url": "https://www.huffpost.com/entry/everyblackgirl-black-girls-advocacy_n_60076ca0c5b6ffcab9687b18",
    "published_date": "2021-02-01T16:30:12Z",
    "title": "This Organization Fights For Black Girls Targeted By Overpolicing And School Pushout | HuffPost Voices",
    "text": "Vivian Anderson was living in Brooklyn, New York, in 2015 when a friend told her about video clips of a white police officer dragging a young Black girl from her desk and body-slamming her to the ground. Videos showed then-Spring Valley High School police officer Ben Fields in Columbia, South Carolina, flipping over the 16-year-old girl, identified as Shakara, toppling her desk and dragging her across the floor. Like many Black women who have become overwhelmed by the traumatic experience of seeing videos of police violence against other Black women and girls, Anderson had braced herself to watch the videos. But instead, she stumbled upon another video out of Spring Valley High. It was a clip featuring Shakara’s classmate: Niya Kenny, a high school senior at the time who was being released from jail. She had been arrested under a vague South Carolina “disturbing schools” law after encouraging her peers to take out their cellphones and film Fields, who was called to their math class after Shakara got into a verbal disagreement with their teacher about having her phone out. Anderson, who now resides in Columbia, still remembers how she felt when she watched interviews of Kenny being asked why she decided to speak up for her classmate. “She was like … ‘Because she had nobody else,’” Anderson said. “I get emotional every time I think about it. … I remember my heart just felt like somebody had punched it ... and all I felt was, ‘Here’s a girl calling folks to action.’” “This girl should not have to be carrying this weight alone,” Anderson said she remembered thinking at the time. “Our mission often is to create a world where every Black girl thrives and it’s our belief until the world around her thrives, she’s not going to be safe.” So in 2016, Anderson launched EveryBlackGirl, Inc., a national campaign and program that centers and supports Black girls. The disproportionate discipline used against Black boys often dominates mainstream conversations surrounding racial biases and school discipline. EveryBlackGirl emphasizes to Black girls that they are loved and supported by Black women everywhere. “Our mission often is to create a world where every Black girl thrives and it’s our belief until the world around her thrives, she’s not going to be safe,” Anderson said. That mission has continued to fuel the organization’s work over the years. Most recently, Anderson traveled to Osceola County, Florida, to visit a Black teen who was body-slammed by a school resource officer at her high school. “The incident in Osceola, Florida, tells us that we cannot stop fighting against the overpolicing of Black girls because they are not stopping,” she said. “This is not new.” Then, in Rochester, New York, police officers handcuffed and pepper-sprayed a 9-year-old girl during a call about a family disturbance. Anderson sees parallels to the 2015 incident in South Carolina. “I think about the 9-year-old responding to the officer that said ‘stop acting like a child’ and she said, ‘I am a child.’ And it just reminds me of Niya when she said, ‘I stood up because I knew she had no one else,’” Anderson said. “Our girls keep standing, so we have to keep fighting so our voices are louder. Our girls need to hear and see us standing for them.” And last year, EveryBlackGirl jumped into action after a 15-year-old Black high school student in Michigan, identified by her middle name, Grace, was jailed in May for not doing her online schoolwork during the COVID-19 pandemic. EVERYBLACKGIRL’S WORK ON THE #FREEGRACE CAMPAIGN Grace was detained at a juvenile detention center after Oakland County Circuit Court Judge Mary Ellen Brennan found she had violated one of the terms of her probation by failing to “submit any schoolwork.” The teen, who has ADHD and receives special education services, was placed on probation in April in a case involving allegations of theft and assault, according to ProPublica. For months, people across the U.S. advocated for Grace’s release through the #FreeGrace campaign. EveryBlackGirl joined widespread efforts to advocate for the teen — who was eventually released and sent home in July. The organization posted Grace’s story on social media, joined rallies and sought support from elected officials. Then, in October, the program invited Grace to speak at its annual conference, which was held virtually in collaboration with the Justice 4 Black Girls organization. “You deserve better than your mistakes,” Grace said, according to ProPublica. “You just need to keep your head up, and I know it will be hard some days, but the most important thing is that you get back up the next day and you show them who you really are.” “Your past does not define you,” Grace said. “I learned that so well in these last months.” Anderson said she wanted to give Grace, who is now 16, the opportunity to share her story to emphasize that young people should “have autonomy over their voice, their bodies.” THE SPRING VALLEY HIGH INCIDENT AND OVERPOLICING IN SCHOOLS Six years ago, the Spring Valley High incident in South Carolina reminded Anderson just how important it is for Black girls to feel loved and heard. When Fields, a deputy and school resource officer, got physical with the teen, Kenny stood up and yelled about his use of force. She was later arrested, led out of school in a paddy wagon and spent hours in jail at an adult detention center for protesting the officer’s actions. Both Kenny and Shakara were charged with disturbing schools. A South Carolina law, which has since been amended, made it a misdemeanor crime for students to “disturb” or “act in an obnoxious manner” at school. Charges against Kenny and Shakara were later dropped. Fields, who was criminally investigated, did not face federal charges. After meeting Kenny and Shakara — and traveling back and forth from New York to South Carolina to host “healing circles” with people in the community — Anderson eventually decided to move to Columbia because she didn’t want to become a so-called “drop-in activist.” The case gained national attention, and the American Civil Liberties Union filed a lawsuit challenging the constitutionality of the “disturbing schools” statute in 2016. Two years later, South Carolina Gov. Henry McMaster (R) amended the statute, removing a crucial link in the state’s school-to-prison pipeline. The Department of Juvenile Justice in South Carolina saw a decrease in disturbing schools arrests in the wake of the ACLU’s lawsuit, according to a 2017 report. BLACK GIRLS ROBBED OF THEIR GIRLHOOD Through her work, Anderson has seen how the adultification of Black girls ― in which society views and treats Black girls as being more mature than they are ― robs them of their girlhood, which she said can “interrupt their development.” It also leaves them more vulnerable to violence and school pushout. Issues including adultification, overpolicing, police violence and the school-to-prison pipeline impact Black girls at disproportionate rates. Black female students in kindergarten through 12th grade received more out-of-school suspensions than girls of any other race across the U.S., according to the National Center for Education Statistics, which analyzed data from public schools from the 2013-14 school year. A 2018 report from the United States Government Accountability Office found that Black girls were disproportionately “disciplined for subjective interpretations of behaviors, such as disobedience and disruptive behavior.” A New York Times analysis published in October found that Black girls were over five times more likely than white girls to be suspended at least once from school, according to the most recent data collected from the Education Department. EVERYBLACKGIRL’S PROGRAMMING AND WORKSHOPS EveryBlackGirl hosts conferences and events, including training sessions for adults to help equip them with tools to support and empower Black girls in their everyday lives. The organization also hosts what Anderson calls healing circles to provide young girls who have experienced trauma the opportunities to share ways they believe EveryBlackGirl can support them. The idea is to center Black girls and give them the agency to decide what kind of support they need. In 2018, EveryBlackGirl took 11 girls to Johannesburg, South Africa, to encourage them to feel connected to Africa and to see the “different ways that Black girls show up” across the diaspora, Anderson said. The following year, Anderson took a group, which included one boy, to Antigua to continue the mission of expanding Black children’s world views. Anderson wants to instill in the Black youth she works with that “wherever you land on this planet, you belong.” “Policing and safety don’t necessarily go together.” EVERYBLACKGIRL’S PLANS FOR 2021 EveryBlackGirl will continue to analyze ways to address overpolicing in schools and to support campaigns that advocate for police-free schools across the U.S., Anderson said. “Policing and safety don’t necessarily go together,” she said. She hopes the nonprofit will eventually have its own facility to serve as an educational hub for Black girls and boys. The hub would allow the organization to build off its efforts to teach young people the importance of economic development. Over the summer, EveryBlackGirl hosted an entrepreneurship camp that allowed girls the opportunity to develop their own business ventures, like creating aromatherapy candles, making lip glosses and baking Jamaican beef patties. “It’s just another way to also start talking about what economic development within Black girls looks like,” Anderson said.",
    "sentiment_val": 0.0345,
    "sentiment_sd": 0.2925,
    "month": "2021-02",
    "data$month": "2021-02"
  },
  {
    "url": "https://www.huffpost.com/entry/major-fake-n95-bust_n_602ec5e2e4b0d50edf780063",
    "published_date": "2021-02-18T19:47:41Z",
    "author": "HuffPost Video",
    "title": "Major Fake N95 Bust",
    "text": "HuffPost Video Producer, HuffPost",
    "month": "2021-02",
    "data$month": "2021-02"
  },
  {
    "url": "https://www.huffpost.com/entry/win-for-freebritney-movement_n_6026b0cde4b0dc291d204f92",
    "published_date": "2021-02-12T16:40:23Z",
    "author": "HuffPost Video",
    "title": "Win For #FreeBritney Movement",
    "text": "Microbio",
    "month": "2021-02",
    "data$month": "2021-02"
  },
  {
    "url": "https://www.huffpost.com/entry/faucis-prognosis-for-normal_n_60340077e4b0388505d13780",
    "published_date": "2021-02-22T18:58:18Z",
    "author": "HuffPost Video",
    "title": "Fauci’s Prognosis For Normal",
    "text": "Microbio Producer, HuffPost",
    "month": "2021-02",
    "data$month": "2021-02"
  }
]
