[
  {
    "url": "https://www.huffpost.com/entry/long-running-trump-line-comes-back-around_n_6113d0fde4b00ae3ab49a24f",
    "published_date": "2021-08-11T13:24:47Z",
    "author": "HuffPost Video",
    "title": "Long-Running Trump Line Comes Back Around",
    "text": "HuffPost Video",
    "month": "2021-08",
    "data$month": "2021-08"
  },
  {
    "url": "https://www.huffpost.com/entry/sunscreens-that-wont-burn-your-eyes_l_611284b7e4b034426d4fac6a",
    "published_date": "2021-08-12T09:45:07Z",
    "author": "Katie McPherson",
    "title": "5 Sunscreens For Your Face That Won't Burn Your Eyes",
    "text": "Here’s a myth we’d like to immediately dispel: Sunscreen is only necessary in the summer, while at the beach or playing sports outdoors. In fact, as experts have been arguing for years, protecting your skin from the sun should be part of your year-round routine given the negative consequences of prolonged exposure to sunlight. Daily sunscreen use protects against skin cancer, premature aging, wrinkles, dark spots and more, according to The Skin Cancer Foundation (and every dermatologist and esthetician ever). But what if applying your SPF is so painful that you tend to avoid it? But for many, burning eyes go hand-in-hand with daily sunscreen application, and the discomfort only gets worse if water or sweat causes the product to run into your eyes. But what causes the burning, and are there sunscreens that can protect you without the sting? Victoria Fu and Gloria Lu, cosmetic chemists and co-founders of Chemist Confessions, said there are numerous ingredients in sunscreen that could cause eye irritation. “Sometimes chemical filters, volatiles (ingredients that evaporate) used to lighten up sunscreen textures, fragrance or even preservatives can be culprits for irritation,” Lu told HuffPost. “We recommend avoiding light, fluid textures, especially if you’re experiencing watery, burning eyes.” “What I really think it is, is the chemical blockers,” said Heather Summe, a board-certified dermatologist at Northwell Health and chief of the division of dermatology at Lenox Hill Hospital. “Physical blockers sit on the surface of the skin and reflect UV radiation, and chemical blockers also sit on the surface of the skin but they absorb the UV radiation. I think the ones people often complain sting the eyes are the ones in the chemical category.” As such, you should look for mineral sunscreens. They’re also sometimes labeled as physical SPF, physical actives or mineral actives. Sunscreen can also include fragrance, texture-related ingredients or skin care additives. Any of these can be irritating when applied near the eyes. “Sprays or gels are more likely to have alcohol added to them, and those are likely to sting if they’re near the eyes,” Summe said. “Fragrance is a big one, and a lot of these sunscreens will have various botanicals added to them.” If your eyes burn as a result of fragrance or botanical ingredients, some mineral formulas may still cause stinging eyes. In that case, you may have to try a few different products to pinpoint the cause of your sensitivity. “Minerals can be a good alternative to try,” Lu said. “But one thing to note is that mineral formulas also can vary far and wide, so it’ll still take a little experimenting.” Summe said not to trust marketing phrases like “mineral-based” on the front of the package. Flip the bottle over and check the active ingredient list. “Physical blockers are what you want when you’re using it around the eyes,” she said. “A lot of sunscreens will contain a mix of physical and chemical blockers, but they’ll market it as a mineral-based sunscreen, and it’s one of my big pet peeves. There’s always going to be various inactive ingredients, but if you’re looking for a mineral sunscreen, the only two things you should see in the active ingredients are zinc oxide and/or titanium dioxide.” When using a mineral sunscreen formula, it’s important to ensure you use enough. Summe recommends a nickel- or quarter-sized dollop to cover your face adequately. “Many 100% pure mineral formulas free of possible triggers don’t have the best textures,” Fu said. “As a result, user application won’t be great, compromising your sunscreen protection.” Sunscreens made specifically for the face, especially ones from well-known skin care brands, seem like they would be a safe choice for those with sensitive eyes. But Summe cautions consumers against falling for good branding. “In terms of ones specifically marketed for the face, they’re just more cosmetically elegant,” she said. “It’ll feel more like a luxurious cream or lotion. It’s more about the texture and the appeal of them; they’re not necessarily less irritating or less likely to burn. A lot of it is just marketing.” Summe recommends the following sunscreens for patients complaining of burning eyes. HuffPost may receive a share from purchases made via links on this page. Prices and availability subject to change. By entering your email and clicking Sign Up, you're agreeing to let us send you customized marketing messages about us and our advertising partners. You are also agreeing to our Terms of Service and Privacy Policy.",
    "sentiment_val": 0.0619,
    "sentiment_sd": 0.2996,
    "month": "2021-08",
    "data$month": "2021-08"
  },
  {
    "url": "https://www.huffpost.com/entry/judge-hammers-pro-trump-lawyers_n_61279ad7e4b0d24f13494692",
    "published_date": "2021-08-26T13:35:52Z",
    "author": "HuffPost Video",
    "title": "Judge Hammers Pro-Trump Lawyers",
    "text": "Microbio",
    "month": "2021-08",
    "data$month": "2021-08"
  }
]
