[
  {
    "url": "https://www.huffpost.com/entry/superstar-sprinter-suspended-over-weed-test_n_60df275de4b091663eac39e3",
    "published_date": "2021-07-02T14:42:39Z",
    "author": "HuffPost Video",
    "title": "Superstar Sprinter Suspended Over Weed Test",
    "text": "Microbio",
    "month": "2021-07",
    "data$month": "2021-07"
  },
  {
    "url": "https://www.huffpost.com/entry/scotus-upholds-voting-restrictions_n_60ddd243e4b0b47324375f9d",
    "published_date": "2021-07-01T14:28:11Z",
    "author": "HuffPost Video",
    "title": "SCOTUS Upholds Voting Restrictions",
    "text": "HuffPost Video",
    "month": "2021-07",
    "data$month": "2021-07"
  },
  {
    "url": "https://www.huffpost.com/entry/summer-recipes_l_60dcad6fe4b0b9e497e1b589",
    "published_date": "2021-07-02T09:45:00Z",
    "author": "HuffPost",
    "title": "Summer Recipes That Always Work, Whether You're Entertaining Or Not",
    "text": "Summer plans are still a bit wonky this year, so you may not always know exactly how many people you’ll be hosting over a long holiday weekend ― if any at all. For these occasions, we’ve rounded up a list of fresh, summery, low-maintenance dishes that can either be served as part of a larger menu or solo for a quiet night in. If you want to light up your grill, maybe you’d like some grilled corn with Sriracha aioli or a grilled Caesar salad. If you’re more in the mood for a DIY salad bar, there’s a host of marinated and composed salads waiting for you below. And if you don’t feel like cooking at all, a magnificent summer cheese board is calling your name. Next time you’re wondering what to make, this list will be your best friend. By entering your email and clicking Sign Up, you're agreeing to let us send you customized marketing messages about us and our advertising partners. You are also agreeing to our Terms of Service and Privacy Policy.",
    "sentiment_val": 0.1418,
    "sentiment_sd": 0.2015,
    "month": "2021-07",
    "data$month": "2021-07"
  },
  {
    "url": "https://www.huffpost.com/entry/a-new-push-to-legalize-weed_n_60f5722be4b0fb665f80550a",
    "published_date": "2021-07-19T12:33:05Z",
    "author": "HuffPost Video",
    "title": "A New Push To Legalize Weed",
    "text": "Microbio",
    "month": "2021-07",
    "data$month": "2021-07"
  },
  {
    "url": "https://www.huffpost.com/entry/pink-blasts-sexist-uniform-penalty_n_60fee323e4b0be5c272751f6",
    "published_date": "2021-07-26T16:25:15Z",
    "author": "HuffPost Video",
    "title": "Pink Blasts ‘Sexist’ Uniform Penalty",
    "text": "HuffPost Video",
    "month": "2021-07",
    "data$month": "2021-07"
  },
  {
    "url": "https://www.huffpost.com/entry/perimenopause-gen-x-millennial_l_60f051a5e4b0a771e801e3c8",
    "published_date": "2021-07-16T09:45:20Z",
    "author": "Catherine Pearson",
    "title": "Perimenopause: The Women's Health Issue No One's Talking About Enough",
    "text": "Arianna Sholes-Douglas remembers the moment her body was in the grips of perimenopause ― though she didn’t recognize it for what it was at the time, despite being an OB-GYN and integrative health physician focusing on women’s health. Sholes-Douglas was performing a C-section, a surgery she estimates she had done over a thousand times, and her brain just blanked. “I had a total brain freeze. I couldn’t remember what to do,” she recalled. “It was very scary, and I didn’t know who to talk to or what to do.” At first, she worried it was early-onset Alzheimer’s. But the big changes she’d been experiencing in cognitive function were hormonal. She was going through perimenopause, the transitional period before menopause when a woman’s body starts making less estrogen until eventually her ovaries stop releasing eggs. And she’s not alone about being in the dark. Many Gen X women and cusp millennials — who are at the age range when perimenopause has begun or could soon start — have far too little support and information. “We haven’t been educated. Patients haven’t been educated. Doctors haven’t been educated. There really hasn’t been a resource that’s been reliable for women, so they are caught off-guard,” said Sholes-Douglas, who went on to write the book “The Menopause Myth: What Your Mother, Doctor, and Friends Haven’t Told You About Life After 35.” “Because in their minds, they’re thinking menopause is an old lady issue,” she added. “They think it’s only relevant when they stop having a period.” But that’s not true. So here are three important things “Xennial” women should know about perimenopause: There aren’t lines around when perimenopause begins, in part because it varies by individual and also because the types of symptoms are so broad. The term perimenopause really just means “around menopause.” It’s also a stretch of time that can drag on for a while. Many women start to experience symptoms five or even 10 years before they stop having a period (though the average is about four years). And given that full menopause can happen when women are in their 40s or 50s, perimenopause can begin when they’re in their early 40s or even mid-30s. “Since 5% to 7% of women are fully menopausal by age 45 (they’ve gone that magical full year without a period), they could be experiencing these symptoms at age 40, not thinking a thing about menopause — because these symptoms can be very vague and don’t come with a big sign ‘You are entering perimenopause,’” said Mary Jane Minkin, an OB-GYN with Yale University and founder of the informational website Madame Ovary. If you’re a woman in your 30s or 40s who is planning to have children (and many women are) and you’re fretting that you might instead enter perimenopause, don’t freak out. It’s very much still possible for women to get pregnant during this phase, though it’s definitely worth bringing up with your doctor if you have concerns. When most people think menopause, they think of hot flashes. And many (if not most) women getting closer to menopause will experience hot flashes, or brief feelings of being overheated, at some point — ranging from pretty mild to really severe. But there are so many other symptoms that can come along with perimenopause, including missed periods or periods that are heavier or lighter than usual, mood swings, changes in cholesterol levels and bone density, urinary incontinence and cognitive fuzziness. “Many [women] get disrupted sleep ― usually falling asleep quickly as they are exhausted, but are then up at 1 a.m., sometimes with a hot flash, sometimes without. They may have headaches, they may be achy, they may have some vaginal dryness or urinary leakage (although that usually comes later),” Minkin said. Perimenopause can affect your sexual health and well-being, as well. “The sexual aspect part of perimenopause is something I deal with a lot,” Sholes-Douglas said. “Women are very much caught off-guard when they experience a decline in libido, vaginal pain, vaginal dryness — and they don’t know why.” But while the possible symptoms associated with perimenopause are wide-ranging, they all really come back to the hormonal changes women go through in the run-up to menopause, as estrogen and progesterone levels fall — or rise and fall in uneven spikes. Though there’s far more information available to women and health care providers now than had been the case a few decades ago, and many active support communities have flourished, perimenopause is still something women aren’t adequately educated about, according to experts. Minkin said Gen X women are probably “slightly better prepared, but not dramatically so.” Sholes-Douglas was more emphatic: “Most women are just not prepared.” There are a few reasons for this, one of which is that there simply isn’t a test doctors can perform to see if women have entered perimenopause. “Hormone levels may not show much,” Minkin said. For example, a doctor might do an estradiol test to check your estrogen levels, but since normal levels during a menstrual cycle range wildly (from 45 to 350 picograms per milliliter), it’s hard to know where your level should be. “Let’s say we draw a blood level of 50. Well, is that normal? It may be. But if your level should be 300, that’s low,” Minkin explained. “It’s a tough diagnosis to make at the time,” she added. “When the patient goes that year without the period, you can then say, ‘Well, hey that was all perimenopausal!’” On top of which there is a lack of consensus about how to treat symptoms of perimenopause even if it is clear that’s the issue. Hormone therapy, which involves taking supplemental hormones, is one option, but some past studies have indicated it can come with other health risks. Some doctors might recommend lifestyle changes to help manage symptoms; in other cases, women might take medications to more directly address such symptoms as vaginal dryness or mental health changes. Unfortunately, a lot of this ends up falling on women. They end up needing to connect the dots in their own symptoms and find health care providers who have experience dealing with perimenopause. Which is why it is so important for Xennial women to be aware of what’s happening in their bodies now, or what lies just ahead. “I’ve had countless patients tell me they went to the doctor and told them they suspected they were perimenopausal, and the doctor said: ‘Oh, you’re too young for that. You’re too young for that,’” Sholes-Douglas said. “You should not assume that your doctor is going to know more about this than you do,” she added. “On some level, obviously they will. But don’t underestimate the power you have.” By entering your email and clicking Sign Up, you're agreeing to let us send you customized marketing messages about us and our advertising partners. You are also agreeing to our Terms of Service and Privacy Policy.",
    "sentiment_val": 0.0477,
    "sentiment_sd": 0.2403,
    "month": "2021-07",
    "data$month": "2021-07"
  },
  {
    "url": "https://www.huffpost.com/entry/biden-slams-big-lie_n_60edf15fe4b0c2cc972eab09",
    "published_date": "2021-07-13T19:56:54Z",
    "author": "HuffPost Video",
    "title": "Biden Slams ‘Big Lie’",
    "text": "Microbio",
    "month": "2021-07",
    "data$month": "2021-07"
  },
  {
    "url": "https://www.huffpost.com/entry/the-gop-claps-for-covid_n_60ec44f3e4b0274a1dc10e2b",
    "published_date": "2021-07-12T13:27:23Z",
    "author": "HuffPost Video",
    "title": "The GOP Claps For COVID",
    "text": "Microbio",
    "month": "2021-07",
    "data$month": "2021-07"
  },
  {
    "url": "https://www.huffpost.com/entry/cleveland-baseball-team-changes-name_n_60fae2e3e4b0167d359f710b",
    "published_date": "2021-07-23T15:35:07Z",
    "author": "HuffPost Video",
    "title": "Cleveland Baseball Team Changes Name",
    "text": "HuffPost Video",
    "month": "2021-07",
    "data$month": "2021-07"
  },
  {
    "url": "https://www.huffpost.com/entry/us-gymnast-sunisa-lee-wins-gold_n_6102ce6be4b0de4995a9d9ee",
    "published_date": "2021-07-29T15:48:44Z",
    "author": "HuffPost Video",
    "title": "U.S. Gymnast Sunisa Lee Wins Gold!",
    "text": "Microbio",
    "month": "2021-07",
    "data$month": "2021-07"
  }
]
