[
  {
    "url": "https://www.huffpost.com/entry/why-do-we-get-tattoos_n_62c6155fe4b0359fa476af81",
    "published_date": "2022-07-06T23:06:07Z",
    "author": "HuffPost Video",
    "title": "Why Do We Get Tattoos?",
    "text": "Microbio",
    "month": "2022-07",
    "data$month": "2022-07"
  },
  {
    "url": "https://www.huffpost.com/entry/what-do-you-know-about-womens-health_n_62e3fd74e4b00fd8d83eeb8c",
    "published_date": "2022-07-29T15:32:04Z",
    "author": "HuffPost Video",
    "title": "What Do You Know About Women's Health?",
    "text": "HuffPost Video",
    "month": "2022-07",
    "data$month": "2022-07"
  },
  {
    "url": "https://www.huffpost.com/entry/jon-stewart-slams-senators_n_62e2d99ee4b07f83766d6bf9",
    "published_date": "2022-07-28T18:46:54Z",
    "author": "HuffPost Video",
    "title": "Jon Stewart Slams Senators",
    "text": "HuffPost Video",
    "month": "2022-07",
    "data$month": "2022-07"
  },
  {
    "url": "https://www.huffpost.com/entry/fox-news-comforts-trump-after-bad-poll_n_62e406a4e4b0d0ea9b76b7d8",
    "published_date": "2022-07-29T16:11:16Z",
    "author": "HuffPost Video",
    "title": "Fox News Comforts Trump After Bad Poll",
    "text": "Microbio",
    "month": "2022-07",
    "data$month": "2022-07"
  },
  {
    "url": "https://www.huffpost.com/entry/teen-triumphs-over-gaetz_n_62e2e293e4b0d0ea9b753a4c",
    "published_date": "2022-07-28T19:25:07Z",
    "author": "HuffPost Video",
    "title": "Teen Triumphs Over Gaetz",
    "text": "HuffPost Video",
    "month": "2022-07",
    "data$month": "2022-07"
  },
  {
    "url": "https://www.huffpost.com/entry/how-to-pack-a-cooler_l_62cc331de4b0aa392d41fdd2",
    "published_date": "2022-07-14T09:45:00Z",
    "author": "Jen Karetnick",
    "title": "How To Pack A Cooler That'll Stay Ice Cold, According To Experts",
    "text": "Have you ever wondered why the cooler you bought says your ice will last five days, but yours melted in five hours? Maybe it’s not false advertising. Perhaps you didn’t choose the right cooler for the job, or you’re packing your cooler incorrectly. Or both. Here’s what you need to know if you want to properly chill this summer. Coolers come in such a range of styles, materials and sizes that it’s easy to get confused. But generally, like crabs, they fall into two basic categories: hard- and soft-shell. From there, the choices become more tailored. Hard coolers are made out of metal, rotationally molded (rotomolded) plastic, polypropylene or Styrofoam. Soft coolers are offered in neoprene, nylon, vinyl, canvas and cotton. To make it more confusing, soft-sided coolers can also be their own sort of hybrid category, with a removable plastic form that gives it interior structure, such as the Artic Zone Deep Freeze cooler, which also has flip lid and is zipperless. As for the shapes, these include the familiar rectangular box with a fitted lid as well as picnic baskets, duffel bags, backpacks, drawstring bags, tote bags, wine bags, buckets, bar carts, beer barrels, collapsibles, compartmentalized coolers and more. They also come with built-in accessories including zipper pockets and cargo netting, all-terrain wheels, retractable or telescoping handles, tow arms, cup holders, cutting boards, dry baskets, punch butler trays, fish rulers, bottle openers, tanks and taps for dispensing and foam-bench tops for sitting. Are you overwhelmed yet? It’s best to assess the task for which you need a cooler: hiking, fishing, camping, cooling wine bottles, throwing barbecues or even just trips to the grocery store to take home your perishables in hot weather. Practically speaking, a household should have a couple of different sizes and styles on hand, ranging from an insulated bag for taking lunch to the office to a large, heavy-duty rotomolded cooler that guarantees several days of cold storage. These are handy for entertaining, camping, fishing and emergency food accommodation. In fact, a good rotomolded cooler can hold the contents of your refrigerator or freezer if the power goes out. If you live in a region where climate emergencies like hurricanes or wildfires often occur, this is a necessity. Tracy Sinclair, head of marketing for Wild Fork, a company that sends out a variety of meats to its customers, recommends placing already-chilled foods or gel packs (not ice) in the bottom of any kind of cooler. Why? Food freezes at a cooler temperature than water. The frozen food will perform like gel packs, which also freeze colder than water. When placed at the bottom of the cooler, both solidly frozen proteins and gel ice packs are less exposed to heat from the opening of the bag. Then, Sinclair suggests using ice packs to separate your chilled food from the rest of your items. After that, “next come the drinks — layer in sodas, beer and wine.” She also recommends adding fresh ice packed in Ziploc bags on top of these. “They work to keep everything cool while at the same time keeping the ice fresh for drinks,” she said. “Finally, on the top you can place salads and fruits.” For an extra layer of protection, pack a small cooler the night before with your items and stick it in the refrigerator or freezer. Some of the newest backpack-style coolers even contain gel-like insulation or come with custom-made, removable ice packs that fit into the sides. Whenever you use fresh ice to pack drinks and perishables, keep in the mind that air is the enemy of ice. The more tightly you pack with product and ice, the better insulated your cooler. Additionally, the ratio of ice to product should be 2 to 1. Both Michael Perez, regional chef and chef de cuisine of Loro Dallas and Shane McBride, director of operations and partner at New York and Palm Beach’s Pig Beach BBQ, recommend Yeti coolers for entertaining. “Yeti coolers are literally the best at keeping food and drinks cold. Although clunky, [they’re] totally worth it,” said Perez, who services customers who wait in line outside in 100-plus degree heat with an impressive multiple-Yeti set-up. McBride admires the brand for its dimensions. “A standard Yeti cooler will fit an entire case of beer inside, or the equivalent number of seltzer or soda cans,” he said. “Lay cans flat on their sides in two rows to maximize cooler space.” And you can just as easily apply their common-sense advice to other popular brands such as Igloo, Orca, RTIC, Coleman or BrüMate. To begin, Perez recommends layering about 3 inches of ice in the bottom ― you’re probably thinking that this goes against the advice above, but he adds kosher salt to the ice, which changes everything. Salt makes ice melt, and melting ice absorbs energy, which lowers the freezing point. So from the bottom of the cooler up, you’re lowering the temperature below freezing. Next, he said, “Add your beer, seltzers, water and soda. Stack these on one half of the cooler, alternating every layer with ice.” But with these layers, don’t salt the ice; here, you want the ice to stay whole as long as possible. Finally, Perez said, leave the other side for food. Again, build up with solid foods on bottom, a layer of unsalted ice and your most delicate items on top. If you’re not including food and using the cooler strictly for drinks, follow McBride’s tips. “Organize your cooler in sections: Split your cooler up by type of beer, or beer/soda/water so thirsty guests/campers can easily find their favorite drink without fishing through the cooler,” he said. “Label the inside of your cooler lid to make the drinks even easier to find.” And, he said, don’t forget to “top the cooler with ice to completely cover your cans. This method will have everything in your cooler ice cold within two hours.” It will also fill in any little air pockets that can attack your ice prematurely. No matter how good the technology of the insulation and how tight the T-latches, cooler ice is going to melt. Guess what: It’s supposed to. At the end of an advertised five or seven or 10 days of chilling, you should have very cold water remaining, maybe with some slivers of ice in it. As long as the interior temperature of the cooler interior is cold enough to keep food from spoiling — the same as your refrigerator at 40 degrees Fahrenheit — your cooler did its job. Remember that the coldest temperatures in your cooler will be when the ice becomes partly water, and adding salt can reduce the temperature of ice water to as low as minus 5 degrees Fahrenheit. You can add dry ice to most brands of rotomolded coolers as long as you have some kind of ventilation or spout that allows the evaporating gas to escape. If you’re not sure if your cooler can take the extreme cold, you can line it with cardboard or Styrofoam to prevent damage. When handling dry ice, you should always wear gloves or oven mitts, and you can either crush the dry ice or leave it whole. Store fish or cuts of meat in layers with ice until you can remove them and place in a freezer ― and it’s OK if the food directly touches the dry ice ― just make sure you never ingest it. If you want to be on the safe side, make sure you wrap the dried ice in paper. Just as with regular ice, empty space is a no-no, so fill it with crinkled newspaper. This will keep the dry ice from evaporating too quickly. To dispose of the ice afterward, leave it outside. Dumping it into your sink can wreck your plumbing. Finally, don’t forget to clean your cooler, both after using it and before using it the next time. As the barbecue chefs advise, a clean cooler performs better than a dirty one. By entering your email and clicking Sign Up, you're agreeing to let us send you customized marketing messages about us and our advertising partners. You are also agreeing to our Terms of Service and Privacy Policy.",
    "sentiment_val": 0.0627,
    "sentiment_sd": 0.2491,
    "month": "2022-07",
    "data$month": "2022-07"
  },
  {
    "url": "https://www.huffpost.com/entry/greatest-final-jeopardy-answer-ever_n_62df9931e4b0aad58d1eb566",
    "published_date": "2022-07-26T07:35:13Z",
    "author": "HuffPost Video",
    "title": "Greatest Final Jeopardy Answer Ever",
    "text": "Microbio",
    "month": "2022-07",
    "data$month": "2022-07"
  },
  {
    "url": "https://www.huffpost.com/entry/10-cult-brands-so-popular-they-dont-need-to-advertise_n_62c7c7b7e4b045168460aaf3",
    "published_date": "2022-07-08T05:59:19Z",
    "author": "HuffPost Video",
    "title": "10 Cult Brands So Popular They Don't Need To Advertise",
    "text": "Microbio",
    "month": "2022-07",
    "data$month": "2022-07"
  }
]
