[
  {
    "url": "https://www.huffpost.com/entry/david-s-pumpkins-almost-never-was_n_635e9951e4b023ac31c66c3d",
    "published_date": "2022-10-30T15:33:37Z",
    "author": "HuffPost Video",
    "title": "David S. Pumpkins Almost Never Was",
    "text": "Microbio",
    "month": "2022-10",
    "data$month": "2022-10"
  },
  {
    "url": "https://www.huffpost.com/entry/time-for-trump-to-speak_n_635697e7e4b0e376dc1a01ec",
    "published_date": "2022-10-24T13:49:27Z",
    "author": "HuffPost Video",
    "title": "Time For Trump To Speak",
    "text": "HuffPost Video",
    "month": "2022-10",
    "data$month": "2022-10"
  },
  {
    "url": "https://www.huffpost.com/entry/shooting-attacks-near-worshippers-on-yom-kippur-in-germany_n_635ac3ece4b023ac31c31028",
    "published_date": "2022-10-27T17:46:20Z",
    "author": "HuffPost Video",
    "title": "Shooting Attacks Near Worshippers On Yom Kippur In Germany",
    "text": "HuffPost Video",
    "month": "2022-10",
    "data$month": "2022-10"
  },
  {
    "url": "https://www.huffpost.com/entry/acne-unprofessional_l_634d876ae4b08e0e6086488d",
    "published_date": "2022-10-19T19:05:12Z",
    "author": "Monica Torres",
    "title": "Acne Is Still Seen As Unprofessional In The Workplace. That Needs To Change.",
    "text": "After years of dealing with acne, certified nursing assistant Hayley Wester decided to forego wearing makeup at work to “let her skin breathe.” After showing up at her Denver, Colorado, office, she was in for a rude awakening. The personal decision prompted unsolicited acne advice from her colleagues and invasive questions including, “Have you tried vitamin C?” and “Have you tried washing your face?” or “Have you tried drinking water? Once, she was even pulled into a meeting with a supervisor about the “concern” from others over her skin condition. “While makeup isn’t a pre-requisite to working as a CNA, it can just be a little uncomfortable for patients,” she recalled the supervisor telling her. “I remember asking him, ‘So are you telling me that I have to wear makeup when I come to work?’ And he said, ’It’s up to you, but we have just gotten a couple of comments... [wondering] if you’re OK, or if you want to see a dermatologist and get your skin under control, or [if you will consider] covering up some of the redness. He was trying to be nice about it, but I don’t think you can be nice about something like that,” she said. Wester said the conversation was “very embarrassing,” but she agreed to wear some makeup. She quit the job less than a week later without another lined up. “I couldn’t imagine continuing to work for a company that would pull me into their office about a skin condition that is very clearly out of my control,” Wester said, adding that the conversation made her feel extra self-conscious because she did not know who raised the concern. “You go around feeling even more insecure than before because you’re thinking, ‘Well shoot, it could be this person, could be this person.’ It adds so much stress on top of an already stressful job.” Studies have shown that people instinctively perceive people with acne as less successful in their careers. One study in Dermatology and Therapy found that when global respondents looked at pictures of the same person with either digitally-superimposed acne scars or clear skin, people with facial acne scars were seen as less likely to be successful, confident, healthy, happy, and more likely to be insecure and shy. Respondents said people in the pictures with acne scars were less likely to have a promising future (78% vs. 84%) and less likely to be hired for a job (78% vs. 82%) than those without scars. Shannon Garcia, a psychotherapist at States of Wellness Counseling in Illinois and Wisconsin, has seen how adult acne can cause her patients to become more socially isolated and less confident at work. “When it comes to work, they worry about not appearing ‘adult enough’ or ‘mature’ since acne is better known as an adolescent issue. It has affected their confidence when it comes to interviews, meetings and introducing themselves to clients and/or coworkers,” Garcia said. “During particularly difficult flare-ups, their anxiety can cause them to want to avoid attending professional events, preferring to hunker down at home until the flare-up subsides.” Wester posted on her Instagram account, myuglyacne, where she documents her acne journey, “No one talks about how stressful it is to have acne and start a new career. It’s a weird thing and topic because we have been conditioned to be ashamed of it and to hide it for the sake of being ‘professional.’” A post shared by Hiiii I’m Hayley (@myuglyacne) In a 2014 survey of over 200 employed women between 25 to 45 years old, almost half reported that they had difficulty concentrating at work “some” or “all of the time” because of their acne, and 12.3% took it a step further saying they had missed work or school in the past month because of an acne breakout. Toni, a mental health professional in the San Francisco Bay area who asked to be identified by her first name, said, “There’s a stigma that acne means the person is unclean, lazy, doesn’t care about their skin, etc., when that is further from the truth. Those perceptions can certainly negatively impact the way the person is perceived in the workplace.” Toni has an Instagram account dedicated to acne positivity and skincare, and she told HuffPost that she had experienced this stigma. A post shared by Toni (@skinlikewhoa) “I’ve felt judged by others in the workplace because of my acne,” she said. “Though I have never been directly approached with any comments, I have noticed the stares that come with having a breakout on my face.” People with acne can face pressure to cover up acne breakouts with makeup while working, said Lavinia Rusanda, a Canada-based chemical engineering intern. “I’ve seen it come from a place of a lot of people seeing acne as un-hygienic. ‘You don’t take care of yourself,’” she said. Rusanda has talked about not covering up her acne on her TikTok account. She said people should wear makeup for themselves, not for other people. Sometimes you just gotta wear a pimple patch to work when your hormonal acne is bleeding! ❤️ #acnepositivity #acneproblems #acneskin #acnetreatment #acneisnormal #skinpositivity #skincare #skincaretips #acneskincare #beautyhack #beautytips #skincarehack “I definitely encourage people to not wear makeup out of the sense that they have to because wearing it for you is so much better than waking up in the morning and making it feel like a chore,” Rusanda said. Rusanda added she had not received negative feedback about going makeup-free at work, which she attributes to being public about acne on her social media accounts. Suppose you are thinking of transitioning away from wearing makeup over your acne at work. In that case, she recommends doing things that make you feel confident, like wearing your favorite outfit or doing your hair your favorite way. Wester believes that the stigma of acne in the workplace will phase out as more young people enter the workforce. “I see a lot of younger generations coming in and their refusal to wear makeup, refusal to cover up tattoos, their ‘nope, this is who I am. You’re either going to hire me, or you’re not’ [attitude],” she said. “That is such a great attitude to have towards workplaces because nothing is really going to change unless people start accepting others for who they are, and I feel like that really includes skin conditions.” It can also help to recognize that you’re not the only person dealing with body image issues at work. “While you may feel alone in your adult acne, you are not alone in struggling with body image,” Garcia said. “You might sit in that work meeting dreading how people will look at your acne. Your coworkers are focused on their own insecurities. They are thinking about their hair, clothing, weight, teeth, nose; you name it. As a therapist, I have heard it all.” If you get comments from friends and family about acne flare-ups, Rusanda recommends taking a step back and reminding yourself that the person is not in your head. “Realize they might be uninformed and educate them,” she said. Rusanda advises using language like, “I would appreciate it if maybe in the future you don’t point it out because I already know what’s going on with my skin. I’m also very educated on what products I should be using, and I’m working on that, so I don’t really need that advice, but I appreciate your concern.“ Wester said she used to swallow her discomfort and pretend to listen when people would share unsolicited acne opinions with her at work. Now she calls it out and shuts it down. “I’ll say, ’You know this is my skin condition that is between myself and my healthcare professional, my dermatologist who is helping me with this. Anything that you can suggest, I’ve already tried, so I’d really like to not discuss my skin.′ That immediately shuts it down,” she said. “I know it has definitely made some people feel really embarrassed because they’ll start to profusely apologize... I’m OK with being the one to say that if it means they won’t ask other people about their skin conditions.” By entering your email and clicking Sign Up, you're agreeing to let us send you customized marketing messages about us and our advertising partners. You are also agreeing to our Terms of Service and Privacy Policy.",
    "sentiment_val": 0.0813,
    "sentiment_sd": 0.2076,
    "month": "2022-10",
    "data$month": "2022-10"
  },
  {
    "url": "https://www.huffpost.com/entry/trump-the-religious-right_n_634c8555e4b04cf8f379c37f",
    "published_date": "2022-10-16T22:27:33Z",
    "author": "HuffPost Video",
    "title": "Trump & The Religious Right",
    "text": "Microbio",
    "month": "2022-10",
    "data$month": "2022-10"
  },
  {
    "url": "https://www.huffpost.com/entry/trumps-deadly-downplay_n_63532e43e4b04cf8f383adc5",
    "published_date": "2022-10-21T23:41:55Z",
    "author": "HuffPost Video",
    "title": "Trump’s Deadly Downplay",
    "text": "HuffPost Video",
    "month": "2022-10",
    "data$month": "2022-10"
  },
  {
    "url": "https://www.huffpost.com/entry/world-saving-spacecraft-passes-test_n_6345db1ee4b08b7387dc1c01",
    "published_date": "2022-10-11T21:07:42Z",
    "author": "HuffPost Video",
    "title": "World-Saving Spacecraft Passes Test",
    "text": "HuffPost Video",
    "month": "2022-10",
    "data$month": "2022-10"
  },
  {
    "url": "https://www.huffpost.com/entry/harvey-weinstein-is-part-of-hollywoods-bigger-problem_n_6344b55ce4b04cf8f370c481",
    "published_date": "2022-10-11T00:14:20Z",
    "author": "HuffPost Video",
    "title": "Harvey Weinstein Is Part Of Hollywood’s Bigger Problem",
    "text": "Microbio",
    "month": "2022-10",
    "data$month": "2022-10"
  },
  {
    "url": "https://www.huffpost.com/entry/free-speech-or-violence-how-white-supremacists-are-targeting-the-first-amendment_n_6349d500e4b03e8038d42124",
    "published_date": "2022-10-14T21:30:40Z",
    "author": "HuffPost Video",
    "title": "Free Speech or Violence?: How White Supremacists are Targeting the First Amendment",
    "text": "Microbio",
    "month": "2022-10",
    "data$month": "2022-10"
  },
  {
    "url": "https://www.huffpost.com/entry/wisconsin-holiday-parade-horror_n_633f4e4fe4b0b7f89f4a09fb",
    "published_date": "2022-10-06T21:53:19Z",
    "author": "HuffPost Video",
    "title": "Wisconsin Holiday Parade Horror",
    "text": "Microbio",
    "month": "2022-10",
    "data$month": "2022-10"
  },
  {
    "url": "https://www.huffpost.com/entry/trumps-new-grift_n_634e0027e4b0e376dc0fada1",
    "published_date": "2022-10-18T01:23:51Z",
    "author": "HuffPost Video",
    "title": "Trump’s New Grift",
    "text": "Microbio",
    "month": "2022-10",
    "data$month": "2022-10"
  },
  {
    "url": "https://www.huffpost.com/entry/climate-protesters-target-van-gogh_n_63499774e4b033f594425a23",
    "published_date": "2022-10-14T17:08:04Z",
    "author": "HuffPost Video",
    "title": "Climate Protesters Target Van Gogh",
    "text": "HuffPost Video",
    "month": "2022-10",
    "data$month": "2022-10"
  }
]
