[
  {
    "url": "https://www.huffpost.com/entry/sleazy-but-legal_n_620fe071e4b072da3982e6ea",
    "published_date": "2022-02-18T18:07:45Z",
    "author": "HuffPost Video",
    "title": "“Sleazy but legal”",
    "text": "HuffPost Video",
    "month": "2022-02",
    "data$month": "2022-02"
  },
  {
    "url": "https://www.huffpost.com/entry/how-to-slug-your-skin-the-right-way_l_621517f8e4b0ef74d726eb14",
    "published_date": "2022-02-25T10:45:01Z",
    "author": "Joline Buscemi",
    "title": "How To 'Slug' Your Skin The Right Way, According To Dermatologists",
    "text": "Slugging isn’t new, but the uptick in articles and social media videos might make it seem like a recent phenomenon. The practice of “slugging” involves spreading a layer of an occlusive (typically a petroleum jelly like Vaseline, or a healing ointment like the popular ones made by Aquaphor or CeraVe) over the entire face while sleeping at night. It has a close cousin in the beauty routines of the mid-1900s, when women wore thick cold creams on their skin overnight to prevent wrinkles. Why try slugging? The benefits are twofold: Not only does it “hold in” all the moisture from the products you apply underneath, it also prevents dry air from further dehydrating skin. “If you have severely dry skin that struggles to maintain hydration, slugging could be a great option to help prevent water loss, keeping skin moist and nourished,” said Geeta Yadav, a board-certified dermatologist in Toronto. “It’s also great for those who have intentionally caused skin damage through in-office aesthetic treatments like peels and laser resurfacing treatments, or those who have unintentionally injured their skin with severe sunburn or through over-exfoliation with an OTC or prescription retinoid,” Yadav said. But not everyone is as big a proponent of slugging as the numerous positive TikToks might make you assume. Writer Jessica DeFino, who asks her readers to Please Stop Slugging, even points out that petroleum jelly — which is what Vaseline and similar occlusives are made of — is a purified petrochemical, a fossil fuel and therefore a contributor to climate change. And just the idea of smearing Vaseline over your face might have you imagining the breakouts that will appear soon after. Plus, we’re all probably using too many products anyway, so is there any real benefit to adding another one? First, some good news: petrolatum is noncomedogenic, meaning it won’t clog pores and cause breakouts. But there’s a caveat. Depending on your skin type, it may still contribute to acne. “Even though it’s not comedogenic, as an occlusive, it can trap oils or other comedogenic ingredients in the skin and could potentially contribute to breakouts,” said Hadley King, board-certified dermatologist in New York City and a clinical instructor of dermatology at Weill Cornell Medicine. This means that slugging is best for those with normal to dry skin types, or those experiencing irritation and eczema. King advises that those with combination or acne-prone skin skip it, but others may find it beneficial. “For dry skin, particularly in a dry environment that will exacerbate transepidermal water loss and dryness of the skin, applying an occlusive like petrolatum can be very helpful,” King said. Yadav likes to think of slugging as a “factory reset” for skin, giving skin the opportunity to heal itself. “Think about how you help heal a wound on your skin, like a cut: You slather it in a product like Neosporin (which not only contains healing antibiotics, but petrolatum), then cover it to keep it protected. Slugging works similarly — keeping the skin moist, then protecting that moisture with an occlusive formula,” Yadav said. While petroleum jelly alone is most often used, it might not actually be the best option. “For slugging, the emphasis is on the occlusive, but ideally this still should be combined with humectants and emollients for optimal moisturizing results,” King said. Like what, then? Beauty influencer @uglyducklingskincare recently provided, via Instagram, a group of slugging products to try. We’ve listed them, along with some other suggestions, ahead. If you’d prefer to avoid fossil fuel byproducts entirely but still want to try slugging, oils and thicker night creams are good alternatives to petrolatum, and can be used the same way. “Occlusives are oils and waxes, which form an inert layer on the skin and physically block transepidermal water loss,” King said. This includes petroleum, but also other substances like beeswax, mineral oil, silicones, lanolin and zinc oxide. Humectants include hyaluronic acid and glycerin, and emollients include cholesterol, squalene, fatty acids, fatty alcohols and ceramides. Yadav recommends using a product like SkinCeuticals Hydra Balm Moisturizing Ointment. “In addition to containing petrolatum, it has rose hip oil and squalane for added moisture. I use it on my patients to help them heal after more intensive procedures, like deeper chemical peels and laser skin resurfacing,” Yadav said. Whatever you choose to use, make sure you start with clean skin. Then, follow up a thin layer of hydrating moisturizer before sealing it in with your chosen occlusive. “Some suggest cleansing and going straight to the petrolatum-based product, but I disagree — if your skin is very dry, the occlusive will seal in that dryness,” Yadav said. Be cautious if you’re using any topical prescription medications, since using an occlusive on top of them could increase their potency. Other strong ingredients, like AHAs, vitamin C and retinoids should be skipped, too. “By sealing in ingredients that can irritate the skin, you’re increasing the likelihood of sensitizing your complexion and diminishing the moisture barrier,” Yadav said. Slugging might not be the best choice for every skin type, but for those with dry, irritated skin that needs some TLC, it can seal in hydration and help skin heal. HuffPost may receive a share from purchases made via links on this page. Every item is independently selected by the HuffPost Shopping team. Prices and availability are subject to change. By entering your email and clicking Sign Up, you're agreeing to let us send you customized marketing messages about us and our advertising partners. You are also agreeing to our Terms of Service and Privacy Policy.",
    "sentiment_val": 0.1283,
    "sentiment_sd": 0.2461,
    "month": "2022-02",
    "data$month": "2022-02"
  },
  {
    "url": "https://www.huffpost.com/entry/kyla-pratts-career-longevity_n_620d75b2e4b09b520fe2228b",
    "published_date": "2022-02-16T22:07:46Z",
    "author": "HuffPost Video",
    "title": "Kyla Pratt’s Career Longevity",
    "text": "Microbio",
    "month": "2022-02",
    "data$month": "2022-02"
  },
  {
    "url": "https://www.huffpost.com/entry/olympians-rally-for-mikaela-shiffrin_n_62045747e4b0a6dd1f4f9b72",
    "published_date": "2022-02-10T00:07:35Z",
    "author": "HuffPost Video",
    "title": "Olympians Rally For Mikaela Shiffrin",
    "text": "Microbio",
    "month": "2022-02",
    "data$month": "2022-02"
  },
  {
    "url": "https://www.huffpost.com/entry/justin-eduafo-challenging-misconceptions-black-teens_n_61f9810ce4b067cbfa22faa2",
    "published_date": "2022-02-09T16:00:06Z",
    "title": "Justin Eduafo Is Challenging People's Misconceptions | HuffPost Voices",
    "text": "As Told To Taryn Finley Justin Eduafo, 18, is a high school senior and student athlete in Dayton, Ohio. A proud son of an immigrant father, he just wants to make his family proud while he carves out his own path in life. He’s interested in studying dentistry when he goes to college. I have a lot more depth to me than what others may give me credit for. Some people probably view me as one-dimensional, as if I’m only an athlete who’s not that smart or just plays video games and stuff. But I’m more than that. I’m empathetic and I like to help people. I’m in AP classes and getting the best grades of my high school career. And I love fashion, video games and music. I’m interested in things people would probably be surprised to learn. I go to a private Catholic high school in a city that’s pretty segregated, though my school is becoming more diverse. Every senior class at my school experiences a spiritual retreat called Kairos. It’s a transformative tradition that includes self-reflection, prayer and affirmations. I was really happy to be there, mostly because I was grounded and glad to be out of the house at the time. But it proved to be a really cool experience. Our class wrote letters to each other. I wasn’t familiar with a lot of people in our Kairos group, but I was surprised to read in their letters to me that some of them were intimidated by me. I guess since I was always hanging out with the popular group they thought I was different than I was when they got to know me on the retreat. A lot of times, I’m more observant than talkative. Maybe people thought I was unapproachable, but that couldn’t be further from the truth. I’m better friends with the people I went on this retreat with now. I really enjoy helping people. I’m also trying to be a bit more outgoing and welcoming now that I know how some people view me. I know their opinions don’t really matter in the grand scheme of things, but I want people to know that they can ask me for help if they need it. It’s not the first time people have had misconceptions of me. I’ve always experienced microaggressions going to predominantly white institutions my whole life. I remember another soccer player telling me to “go back to your country” during a game. I was just like, well, I was born in Dayton, so I don’t even know what you’re talking about. I try to just brush racist and xenophobic remarks off. I’m not about to get as stressed out as the person who said it. Conversations and policies around immigration can be really unfair. I feel like people are always trying to come to the U.S. for a better life or just a better opportunity. And obviously, the majority aren’t criminals or people planning to do something bad. So treating them all as if they’re that, it’s just unfair to those who are just trying to have a better life. My dad emigrated from Ghana to live in the United States nearly 30 years ago. He didn’t have much money to support his schooling growing up. His family members had to sell their belongings just to pay tuition each year. He worked so hard to be able to migrate here, become a doctor and get recertified. Any time I’m struggling, I think of him. I take pride in my family’s story and my heritage. There are a lot of Ghanaians in my area, so it hasn’t been hard to find community with those who share the same ethnic background. But when I was younger, I didn’t know as much about my heritage or our native tongue as my older sisters. That was isolating and frustrating. I’ve become more confident in it as I have visited my relatives and met my cousins in Ghana. Being the child of immigrant parents usually means pressure for first-generation kids to have dreams that involve medical school, law school or engineering. My dad and my stepmom sat me down to talk about that not too long ago. They were like, “Whatever you want to do, as long as it’s not something completely insane and within the bounds of reality,” they’ll support me in it. I was already focused on dentistry, but that lifted a weight off my shoulders. Now I know if there’s anything else that comes up that I want to do, they have my back. Big money interests are running the government — and influencing the news you read. While other outlets are retreating behind paywalls and bending the knee to political pressure, HuffPost is proud to be unbought and unfiltered. Will you help us keep it that way? You can even access our stories ad-free. You've supported HuffPost before, and we'll be honest — we could use your help again. We won't back down from our mission of providing free, fair news during this critical moment. But we can't do it without you. For the first time, we're offering an ad-free experience to qualifying contributors who support our fearless journalism. We hope you'll join us. You've supported HuffPost before, and we'll be honest — we could use your help again. We won't back down from our mission of providing free, fair news during this critical moment. But we can't do it without you. For the first time, we're offering an ad-free experience to qualifying contributors who support our fearless journalism. We hope you'll join us. Already contributed? Log in to hide these messages. I’m excited for the next chapter of my life as I apply for colleges. I’m looking at the Ohio State University, the University of Dayton or the University of Cincinnati so that I can stay somewhat close to family. I’m excited to meet a more diverse group of people when I’m in college. I just want to build more of a sense of independence. The most important things for me in life right now are upholding my family values and finding my path in life for my own happiness. That can be hard when you’re a teen. I have a lot to be thankful for, especially in the age of COVID-19. I feel like being happy comes from within. My family and knowing that I have control over my future make me genuinely happy.",
    "sentiment_val": 0.2185,
    "sentiment_sd": 0.2651,
    "month": "2022-02",
    "data$month": "2022-02"
  },
  {
    "url": "https://www.huffpost.com/entry/ukraine-citizen-defenders-photos_n_621801a5e4b0d1388f11fb26",
    "published_date": "2022-02-28T16:43:38Z",
    "title": "These Are The Citizens Stepping Up To Defend Ukraine | HuffPost Exposure",
    "text": "February 28, 2022 Ukraine had a troubled past on its way to statehood. Even though the nation can claim its fair share of credit as a participant in shaping the history of Europe, it has had very little time to enjoy its independence. The country has been invaded and reinvaded for centuries, often passing between empires. Ukrainians have endured a wide variety of tyrants, and now they hold their breath as they battle another. Amid the new and possibly much more horrific stage of the ongoing tensions, Ukrainians have flocked to territorial defense units ― a reserve branch of the military that trains civilians to defend their cities in case of a full-scale invasion. Such units accept and train volunteers between the ages of 18 and 57, who, upon signing up, commit to weekend drills, target practices and occasional weeklong training camps. Army instructors, often veterans who have already seen the front line in eastern Ukraine, administer the training. A recently passed law, with the unambiguous title “Foundations of National Resistance,” has given these civilian units a supporting role to the Ukrainian army in case of war, and envisions them having partisan duties in case of occupation. It also benefits the volunteers, allowing for the purchase of arms and legalizing their privately owned weapons in the event of mobilization. The Territorial Defense Units have seen a massive influx of recruits since the law was passed in January. Ukrainians have also been arming themselves at an unprecedented rate. Maryana Zhaglo, 52, is a Kyiv native, a marketing analyst and a mother of three. She is one of the people who recently purchased a weapon, the Ukrainian-made rifle Zbroyar Z-15. Zhaglo says she became a reservist out of a desire to defend her birthplace. “Territorial defense for me is defending my city, my home,” she said. “My motivation is my family, my city and my country.” Zhaglo enrolled in the territorial defense on a dare from her friend from Donetsk, who had to move to Kyiv after Russian-backed separatists took over his city in 2014. “If anything starts, I’ll show up and be ready to follow orders,” she said. “My whole family is here. We have nowhere else to go, and we shouldn’t be going anywhere. This is my country, I was born here and I want to be ready to defend it.” The process of joining a civilian unit like Zhaglo’s is not as simple as just volunteering. If a person is interested, they can first attend an intro training session. If they want to join, they have to undergo a rigorous health and psych evaluation, supply copies of numerous documents, and then sign a contract to become a reservist. The process might take two to three weeks before the volunteer gets sworn in. Borys Cherkas, 45, went through this process long before the current crisis. In 2017 he volunteered as a reservist. Now he is preparing for an exam to become a junior lieutenant of his local Territorial Defense Unit. Cherkas has a history Ph.D., works as a researcher at the National Academy of Sciences of Ukraine, and is a part-time teacher at a school in the suburbs of Kyiv. Cherkas is pleasantly surprised by the number of middle-aged and older recruits in the last few months. “You know that Cossacks would not send out their young to fight when they’d go on military campaigns,” he said. “So I think the youth should not be left out as the last line [of] defense ― it should be older folks taking the punch.” Yuriy Boyko, 68, is a retired army colonel. He started his military service in the Soviet army in 1970, took part in Soviet military involvement as an adviser during the Iran-Iraq War in the ’80s, and finished his career in the Ukrainian army after the fall of the Soviet Union. After his retirement, he went into information technology and started his own firm. Quoting Sun Tzu, Boyko said: “The greatest victory is one which requires no battle.” . . See more photos of the citizens helping to defend Ukraine below: Art Directors: Isabella Carapella and Christy Havranek Senior Photo Editor: Chris McGonigal Copy Editor: Alexander Eichler Big money interests are running the government — and influencing the news you read. While other outlets are retreating behind paywalls and bending the knee to political pressure, HuffPost is proud to be unbought and unfiltered. Will you help us keep it that way? You can even access our stories ad-free. You've supported HuffPost before, and we'll be honest — we could use your help again. We won't back down from our mission of providing free, fair news during this critical moment. But we can't do it without you. For the first time, we're offering an ad-free experience to qualifying contributors who support our fearless journalism. We hope you'll join us. You've supported HuffPost before, and we'll be honest — we could use your help again. We won't back down from our mission of providing free, fair news during this critical moment. But we can't do it without you. For the first time, we're offering an ad-free experience to qualifying contributors who support our fearless journalism. We hope you'll join us. Already contributed? Log in to hide these messages.",
    "sentiment_val": 0.1621,
    "sentiment_sd": 0.2167,
    "month": "2022-02",
    "data$month": "2022-02"
  },
  {
    "url": "https://www.huffpost.com/entry/jada-adams-prioritizing-happiness-black-teens_n_61f19d2ce4b0061af259a29c",
    "published_date": "2022-02-09T16:00:06Z",
    "title": "Jada Adams Is Prioritizing Happiness Over Everything | HuffPost Voices",
    "text": "As Told To Taryn Finley Jada Adams is a first-year student at the University of Georgia studying entertainment and media studies. Originally from North Brunswick, New Jersey, Jada and her family moved to Columbia, South Carolina, in 2014 to get closer to her maternal family. She found some challenges finishing her senior year of high school during the pandemic, but she’s learned a really crucial lesson on the meaning of happiness that she isn’t willing to compromise on. I’m a creator. I create positive energy, music, good ideas and out-the-box thinking. I found my calling combining all of those things. I learned how to rhyme in either first grade or kindergarten. Those rhymes turned into music when my mom, who used to rap herself, taught me how to spit. I wrote my first rap back then. My brother started making me beats on his computer. He’d invite his friends over, and I’d perform for them. More than 10 years later and I’m still performing. I hang up my reserved and awkward demeanor when I hit the stage as Jada Beatz to perform. I write about mostly what’s going on, more inspirational music. I’ve already released an EP and written a theme song for an organization called Every Black Girl. My goal is to really inspire my peers to reach their full potential. When COVID-19 hit in 2020, however, optimism couldn’t be the only thing that sustained me. The pandemic hit junior year going into my senior year of high school. It separated me and my classmates from friends, teachers and community at a time when we needed it the most. Right before the school shut down, one of my friends who went to my high school died. It wasn’t COVID-related, but that didn’t make it any less devastating. I couldn’t wrap my head around it. It just didn’t make sense. We were just all at school having a normal day on Thursday. That Friday, school was canceled, and Saturday we got the news. We gathered at the school that day to pay tribute to our classmate and lean on one another, but we never went back to school after that. We had to grieve in our homes and over Zoom. It was different. I found a space in my house to process my friend’s death, the pandemic and everything else. I asked myself, “What am I thinking? What am I feeling?” It’s hard to put into words exactly if you’re angry, if you’re grateful, if you’re whatever. One of the most important lessons that came out of the pandemic for me was to prioritize my happiness. So I make sure that in every single minute of my life, I’m doing something that makes me happy. Sometimes that looks like me prioritizing time with my family over an assignment. Other times, that looks like me pouring into my music, which has allowed me to foster and build community. In summer 2021, I gathered seven up-and-coming female artists to record. I didn’t realize it at the time, but I was cultivating a space for sisterhood among other Black girls. Some of these girls had never been in the studio, but when I heard them rap live or sing live, I knew I wanted to make some bomb music with them. At the beginning, some girls were like, “Oh, I can’t write.” I just think by the end, they were writing their own verses and we became best of friends and we ended up putting out a collaborative album. I dream about what I want my life to look like. I’d like to be in the studio with my favorite artists one day, including Beyoncé. I dream of spending more quality time with my family in a big house in the future. And I dream of taking my talents to heights unimaginable. As for 2022, however, I’m dreaming of making new friends on campus and finishing my next album.",
    "sentiment_val": 0.1696,
    "sentiment_sd": 0.2629,
    "month": "2022-02",
    "data$month": "2022-02"
  },
  {
    "url": "https://www.huffpost.com/entry/russia-escalates-crisis_n_62150a57e4b0853343c835c0",
    "published_date": "2022-02-22T16:07:51Z",
    "author": "HuffPost Video",
    "title": "Russia Escalates Crisis",
    "text": "Microbio",
    "month": "2022-02",
    "data$month": "2022-02"
  }
]
