[
  {
    "url": "https://www.huffpost.com/entry/beauty-sales-black-friday-cyber-monday_l_636c6546e4b04925c8941007",
    "published_date": "2022-11-19T10:45:16Z",
    "author": "Tessa Flores",
    "title": "The Best Cyber Monday Beauty Deals 2022",
    "text": "True joy is cracking open a fresh pot of your favorite moisturizer or a crisp new tube of volumizing mascara. Greater joy is knowing you’ve saved a little bit (or a lot) of cash in the process. And now that the most quintessential time in holiday shopping deals is here, you can. For this year’s Cyber Monday, some of beauty’s most revered and well-known brands have offered up hair care, skin care and cosmetics at steep discounts, and it’s going on right now. In the list below, find out where to score Dermologica’s classic microfoliant, Ilia’s entire lineup of skin-conscious makeup, Peter Thomas Roth’s clinical formulations and much, much more. We’ll be updating this story daily, so keep checking back for the scoop on the newest deals. HuffPost may receive a share from purchases made via links on this page. Every item is independently selected by the HuffPost Shopping team. Prices and availability are subject to change. By entering your email and clicking Sign Up, you're agreeing to let us send you customized marketing messages about us and our advertising partners. You are also agreeing to our Terms of Service and Privacy Policy.",
    "sentiment_val": 0.3843,
    "sentiment_sd": 0.3789,
    "month": "2022-11",
    "data$month": "2022-11"
  },
  {
    "url": "https://www.huffpost.com/entry/letitia-wright-blasts-the-hollywood-reporter_n_637d0ff8e4b0aef010628830",
    "published_date": "2022-11-22T18:07:52Z",
    "author": "HuffPost Video",
    "title": "Letitia Wright Blasts The Hollywood Reporter",
    "text": "HuffPost Video",
    "month": "2022-11",
    "data$month": "2022-11"
  },
  {
    "url": "https://www.huffpost.com/entry/famous-people-that-are-related-and-all-happen-to-work-in-showbiz_n_6386284de4b06ef4a548acda",
    "published_date": "2022-11-29T15:42:05Z",
    "author": "HuffPost Video",
    "title": "Famous People That Are Related And All Happen To Work In Showbiz",
    "text": "Microbio",
    "month": "2022-11",
    "data$month": "2022-11"
  },
  {
    "url": "https://www.huffpost.com/entry/brooklinen-black-friday-cyber-monday-2022_l_636d1bb7e4b06d3e425891ef",
    "published_date": "2022-11-16T10:45:26Z",
    "author": "Kristen Adaway",
    "title": "Brooklinen’s Black Friday And Cyber Monday Sale 2022",
    "text": "Given the amount of time you spend sleeping, you deserve bedding that’s cozy, comforting and worthy of snuggling up in. While the old reliable sheets you’ve been loyal to since 2010 may be getting the job done, there’s nothing wrong with a little bedroom upgrade every now and then. That’s where the cult-favorite luxury bedding brand Brooklinen comes in, and you can get its opulent home essentials for much lower prices right now. Now through November 30, you can get 25% off everything on Brooklinen’s website, excluding items in the Last Call category. If there’s a bedding set you’ve been eyeing or your bathroom is in dire need of new towel sets, now’s your chance to get luxury-quality ones at a discounted price. Or, since Christmas is just around the corner, this sale is the perfect opportunity to scratch some gifts off your list. To help you figure out what to buy, we rounded up a few of the brand’s bestsellers, along with gift-worthy accessories your loved ones will surely appreciate, like a silk eye mask and a candle and diffuser set. HuffPost may receive a share from purchases made via links on this page. Every item is independently selected by the HuffPost Shopping team. Prices and availability are subject to change. By entering your email and clicking Sign Up, you're agreeing to let us send you customized marketing messages about us and our advertising partners. You are also agreeing to our Terms of Service and Privacy Policy.",
    "sentiment_val": 0.264,
    "sentiment_sd": 0.268,
    "month": "2022-11",
    "data$month": "2022-11"
  },
  {
    "url": "https://www.huffpost.com/entry/first-ladys-festive-holiday-decorations_n_63862e65e4b07419b0a49769",
    "published_date": "2022-11-29T16:08:05Z",
    "author": "HuffPost Video",
    "title": "First Lady’s Festive Holiday Decorations",
    "text": "Microbio",
    "month": "2022-11",
    "data$month": "2022-11"
  },
  {
    "url": "https://www.huffpost.com/entry/john-fetterman-wins_n_636b502ee4b021a4038f406d",
    "published_date": "2022-11-09T07:01:02Z",
    "author": "HuffPost Video",
    "title": "John Fetterman Wins!",
    "text": "Microbio",
    "month": "2022-11",
    "data$month": "2022-11"
  },
  {
    "url": "https://www.huffpost.com/entry/10-things-you-didnt-know-about-john-lennon_n_63695afde4b05f221e7cd7b8",
    "published_date": "2022-11-07T19:22:37Z",
    "author": "HuffPost Video",
    "title": "10 Things You Didn't Know About John Lennon",
    "text": "Microbio",
    "month": "2022-11",
    "data$month": "2022-11"
  },
  {
    "url": "https://www.huffpost.com/entry/foreo-black-friday-sale_l_63744b64e4b0e818be472d14",
    "published_date": "2022-11-18T14:00:28Z",
    "author": "Tessa Flores",
    "title": "My Foreo Microcurrent Skin Firming Device Is 30% Off For Cyber Monday",
    "text": "HuffPost may receive a share from purchases made via links on this page. The author received complimentary items to test for the purposes of this story. Prices and availability are subject to change. Even as a self-proclaimed skin care obsessive, I know that all the potent retinol serums and luxury creams in the world can’t truly stop the natural aging of the skin, particularly when it comes to sagging. Ingredient-driven topicals can be useful when it comes to addressing the signs of premature skin aging, but I’m on the quest to find skin care that’s deeper than the skin’s surface — without having to go under the knife to get it. Microcurrent devices had been on my curiosity radar for a couple of years. The idea behind these tools is that they use low-level electrical impulses to stimulate facial muscles in order to achieve a number benefits for the skin, particularly firming and toning effects. Now that these devices have left the exclusive realm of medi-spas and landed on the shelves of mainstream retailers, I managed to get my hands on one in particular: the Bear, which is made by Foreo, a Swedish beauty brand bent on bringing this clinically effective technology right into your home. (The Bear’s also available at a steep Cyber Monday discount of 30% off from now until December 4.) Foreo’s Bear is classified as a medical device by the FDA, and, similar to its competitors, uses a range of 10 different electrical impulse intensities that trigger muscle movement and help exercise the underlying areas of the face that are partially responsible for keeping skin perky and facial contours more prominent. Although there aren’t studies that support the company’s claim that the Bear can help improve elasticity and collagen production over time, there are studies that show microcurrents can reduce the appearance of fine lines. The Bear combines its microcurrents with sonic massage, a transdermal technology found across all Foreo products that may help reduce the appearance of fine lines. If you’re wondering if I feel this device actually achieved all of this in the two months that I have been using it, the short answer is yes. Immediately after my first two and half minute all-over face session, I saw my cheeks look more plump and pronounced and the contour line that ran beneath my cheeks down to my jawline was more defined. Whether this is permanent or more temporary change remains to be seen, but the company claims that with consistent use, muscles become trained to maintain this appearance. When it comes to long-term results, I have noticed a softening of some of my more stubborn fine lines, like the elevens in between my eyebrows and the marionette lines around my mouth. Other reviewers say they have seen similar results with one person claiming that “after three weeks of use, I’m seeing an improvement in my neck and forehead — specifically the elevens. My jaw also appears more sculpted. The short treatment times make it easy to incorporate into my morning routine. The Bear has surpassed my expectations.” To use the Bear, I just sync it up with the Foreo app on my phone (a completely painless process, I assure you), pick my desired intensity and chose from a library of short guided facial workouts that target a variety of muscles, like the forehead or along the jawline. This is probably one of my favorite aspects of The Bear, because it ensures that you’re exercising each part of your face evenly and not exceeding the recommended time limit. I then apply a generous amount of the hydrating conductive serum to my face, an essential step due to the fact that the gel helps transfer the microcurrents into the skin while preventing any uncomfortable static feeling from using the device. Finally, following the instructional video, I glide the hypoallergenic spheres along my skin in an upward motion, a process that takes some getting used to because you can feel and see your muscles twitch uncontrollably as the electrical impulses reach below the skin. If the idea of electricity being applied to your skin is a frightening one, know that Foreo boasts an anti-shock system which uses smart sensors to scan and measure your skin’s resistance to electricity and maintain it for the optimal level of your skin. I will also add that making sure to keep both of the spheres on your skin at the same time will help to prevent you from feeling any “thwack” of electricity on your skin. Overall, if you have the money to spare, and you’re concerned with facial volume loss, elasticity and fine lines, I think it’s worth it to scroll back up and splurge, especially since starting today through Dec. 2, you can snag the Bear for 30% it’s regular price. You can also continue on below to find two other sonic skin care gadgets from Foreo that are currently on sale, each one promising clinical and effective results. By entering your email and clicking Sign Up, you're agreeing to let us send you customized marketing messages about us and our advertising partners. You are also agreeing to our Terms of Service and Privacy Policy.",
    "sentiment_val": 0.199,
    "sentiment_sd": 0.1948,
    "month": "2022-11",
    "data$month": "2022-11"
  },
  {
    "url": "https://www.huffpost.com/entry/love-is-blind-stars-lauren-and-cameron-reveal-behind-the-scenes-secrets_n_63755ff0e4b0e818be4934cc",
    "published_date": "2022-11-16T22:10:56Z",
    "author": "HuffPost Video",
    "title": "\"Love Is Blind\" Stars Lauren And Cameron Reveal Behind-The-Scenes Secrets",
    "text": "HuffPost Video",
    "month": "2022-11",
    "data$month": "2022-11"
  },
  {
    "url": "https://www.huffpost.com/entry/trump-debuts-desantis-nickname_n_63692d72e4b0cc1814f437b2",
    "published_date": "2022-11-07T16:08:18Z",
    "author": "HuffPost Video",
    "title": "Trump Debuts DeSantis Nickname",
    "text": "Microbio",
    "month": "2022-11",
    "data$month": "2022-11"
  },
  {
    "url": "https://www.huffpost.com/entry/the-seditionist-returns_n_6374ecc1e4b08013a8b1a928",
    "published_date": "2022-11-16T13:59:29Z",
    "author": "HuffPost Video",
    "title": "The Seditionist Returns",
    "text": "Microbio",
    "month": "2022-11",
    "data$month": "2022-11"
  },
  {
    "url": "https://www.huffpost.com/entry/best-holiday-gifts-seniors_l_6369b89be4b05f221e7d2f5b",
    "published_date": "2022-11-10T10:45:03Z",
    "author": "Tessa Flores",
    "title": "The Best Gifts For Seniors And Older People In Your Life",
    "text": "Age disparities between generations can create the false sense that you don’t have anything in common, that your differences are too great and that gift-giving come holiday season is an impossible feat. In reality, the years between you don’t matter when you want to show someone important in your life that you care — and finding a meaningful gift can be great way to do it. If you’re on the hunt for such a gift, but need some nudging in the right direction, we’ve compiled some helpful suggestions for items and gestures that can help a grandparent, parent or older family friend stay connected with those they love, bridge the technology gap or just find a little everyday comfort. HuffPost may receive a share from purchases made via links on this page. Every item is independently selected by the HuffPost Shopping team. Prices and availability are subject to change. By entering your email and clicking Sign Up, you're agreeing to let us send you customized marketing messages about us and our advertising partners. You are also agreeing to our Terms of Service and Privacy Policy.",
    "sentiment_val": 0.3051,
    "sentiment_sd": 0.2272,
    "month": "2022-11",
    "data$month": "2022-11"
  }
]
