[
  {
    "url": "https://www.huffpost.com/entry/lions-check-out-a-human-zoo_n_639e270ce4b0e2fa1a452aca",
    "published_date": "2022-12-17T20:31:08Z",
    "author": "HuffPost Video",
    "title": "Lions Check Out A Human Zoo",
    "text": "Microbio",
    "month": "2022-12",
    "data$month": "2022-12"
  },
  {
    "url": "https://www.huffpost.com/entry/the-report-on-missing-murdered-indigenous-women-girls-is-here_n_639665a3e4b0804966adad9f",
    "published_date": "2022-12-11T23:20:03Z",
    "author": "HuffPost Video",
    "title": "The Report On Missing & Murdered Indigenous Women & Girls Is Here",
    "text": "HuffPost Video",
    "month": "2022-12",
    "data$month": "2022-12"
  },
  {
    "url": "https://www.huffpost.com/entry/the-royals-soak-in-america_n_6388b864e4b006e9b854e786",
    "published_date": "2022-12-01T14:21:24Z",
    "author": "HuffPost Video",
    "title": "The Royals Soak In America",
    "text": "HuffPost Video",
    "month": "2022-12",
    "data$month": "2022-12"
  },
  {
    "url": "https://www.huffpost.com/entry/ivanka-ditches-dad_n_6399f4e5e4b04e135626ca42",
    "published_date": "2022-12-14T16:08:05Z",
    "author": "HuffPost Video",
    "title": "Ivanka Ditches Dad",
    "text": "HuffPost Video",
    "month": "2022-12",
    "data$month": "2022-12"
  },
  {
    "url": "https://www.huffpost.com/entry/hundreds-of-whales-die-in-australias-worst-mass-stranding_n_638d237ae4b0411f9e79b4b8",
    "published_date": "2022-12-04T22:47:22Z",
    "author": "HuffPost Video",
    "title": "Hundreds Of Whales Die In Australia’s Worst Mass Stranding",
    "text": "Microbio",
    "month": "2022-12",
    "data$month": "2022-12"
  },
  {
    "url": "https://www.huffpost.com/entry/holiday-dietary-restrictions_l_6377d5a3e4b062ba9ec74c47",
    "published_date": "2022-12-01T10:45:28Z",
    "author": "Taylor Tobin",
    "title": "How To Get Through The Holidays With Dietary Restrictions",
    "text": "Many of us connect our fond memories of past Thanksgivings, Christmases, Hanukkahs, New Year’s Eves and other end-of-year celebrations with our favorite festive food and drinks. But this time of year can prove highly challenging for those who deal with food allergies, sensitivities and other restrictions. To help reduce any discomfort around this topic and make it easier for party guests to ensure their dietary needs are accommodated, we asked a group of nutritionists, psychologists, counselors and etiquette experts to address common questions that come up around this topic and provide useful advice to keep all partyers safe, comfortable, healthy and prepared for a wonderful holiday season. When it comes to divulging dietary restrictions to party hosts, it can be easy to slip into a self-conscious mindset. You may become preoccupied with fears that your allergies, sensitivities or preferences are “inconvenient” or “high-maintenance.” For that reason, “It’s important to normalize the feelings of awkwardness that arise when it comes to sharing dietary needs/retractions,” says Kiana Shelton, a licensed clinical social worker from Mindpath Health. Shelton urges you to acknowledge your discomfort while “considering the larger picture.” “If the goal is to be able to eat with [your loved ones], let that be the motivating factor” for clearly communicating your needs, Shelton says. “Lastly and most importantly, remember that ensuring your nourishment is an act of self-love. We can function as our best selves when we are fueled properly.” Ultimately, it’s important to remember what wellness coach and “playfulness expert” Krystal Quagliara points out: “When communicating your dietary requirements to others, it is up to you how much explanation you want to provide. Simply having a boundary around your dietary choices is enough and should be respected. You can be the judge of how comfortable you feel sharing personal details about your health with [your hosts].” She also mentions that it can be helpful to try to view the situation from your host’s perspective. “Try to understand their perspective and why they might feel defensive or critical about your requests. Holidays are steeped in tradition, and we often associate certain foods with memories. Understanding their perspective can help you keep open and loving communication regarding this topic,” she says. Approaching the conversation with the assumption that your host will want to make you feel comfortable and will want to work with you to ensure you can fully enjoy the event keeps the focus on a positive collaboration. According to registered dietitian and food allergy expert Kristi Winkels, it’s helpful to communicate about food allergies as soon as possible. “This allows the chance to find out what food will be available ― whether it’s safe or unsafe ― and gives the host the opportunity to accommodate if they’re willing and able. In my experience, hosts want to know about your food allergies so they can have options that are safe,” Winkels says. If a host appears open to accommodating you, ask about the menu and ingredients used to make certain dishes, so you can learn what options might be safe, she suggests. “If the allergy is severe and you don’t feel comfortable even having the allergen in the same room, communicate that to the host and they can decide if they will remove it from the menu,” Winkels adds. Whether your restrictions are allergy-based or otherwise, consider the rule of etiquette consultant and author Jodi R.R. Smith of Mannersmith Etiquette Consulting: Guests should disclose any restrictions in advance. “It is completely unreasonable to wait until the host serves a meal to announce that you do not eat meat,” Smith says. “Be sure to communicate clearly when you accept the invitation, or at least a week prior. Sharing any dietary information in advance gives the host enough time to reconsider the menu and [find a way] to accommodate you.” Traditional rules of etiquette suggest that party RSVPs should be done in the same manner in which the invitation was offered. Basically, if your friend invited you to a party via email, you should use email to let them know whether you’ll be attending (and whether you have any special notes or requests). In the case of a dietary restriction that isn’t medical, it’s fine to convey that information as part of your RSVP. When allergies are involved, however, food allergy expert and cookbook author Megan Lavin strongly advises a double-pronged approach to expressing your dietary needs. “I always like to communicate with a host about our food allergies both in writing and in a [verbal] conversation. That way, they have the written text to refer back to, and they’re not going ‘Was it peanuts or tree nuts they were allergic to?’ Hosting is a lot of work, and I think that the more we can do to help the host out, if they’re willing to accommodate, the better,” Lavin says. Regardless of the medium you use to communicate your restrictions, Smith says, in the case of an anaphylactic allergy that is potentially life-threatening, “You should be VERY clear with the hosts.” She suggests a script like the following: “You may not know, as I try not to discuss it, but I have a severe allergy to sesame oil. Even something cooked in the same pan can trigger an attack.” Then, be ready to offer a suggestion (like bringing your own dish to the party or agreeing to eat before you arrive) if your host indicates that it would be difficult for them to 100% guarantee that none of the food they serve will come in contact with your allergen. When you’re invited to a holiday party hosted by a spouse’s office, a roommate’s friend or a new significant other’s family, it can be tricky to figure out how best to explain your dietary needs to a relative stranger. If you start to feel overwhelmed by the prospect, remember that “it’s not uncommon for hosts to get questions regarding the menu,” says Shannon Dolan, a functional nutritional therapy practitioner and behavioral change specialist with Health With Shannon. As a first step, she suggests “asking your friend to find out details about what is being served and [have them ask] if there is anything you can bring.” “The host will love your thoughtfulness,” she adds, “and you’ll be relaxed knowing there’s at least something you can have!” If the event in question is a catered dinner or a party at a restaurant and you’re dealing with a serious food allergy or sensitivity, it’s worth asking the host to give you the name of the caterer or restaurant so you can check in with them directly to discuss if there are any options that meet your needs. “Often, caterers will have various options for those with dietary restrictions ready just in case,” Dolan says. Smith points out: “Most events held at venues are familiar with most accommodations. You just need to tell the host/organizer well in advance so they can be sure to have something appropriate for you to eat.” As our experts mentioned above, offering to contribute a dish to a party spread is a gracious move when you’re concerned about having your dietary restrictions accommodated. That said, especially if the party in question is a sit-down dinner with a planned menu, your plan to bring a food item “really should be communicated to the host first,” say Rachana Adyanthaya and Julia Esteve Boyd, the etiquette consultants and podcasters behind “Manners Matter 2.” Tell the host that you want to make the dinner as fun and easy as possible for them and that you’d love to offer a dish that complies with your allergies or preferences in order to reduce their workload. Office holiday parties are often stressful events for office administrators, human resources reps and party planning committees, and it can be tough to ascertain who needs to be informed of dietary restrictions. If you work in an environment that doesn’t have an established protocol for these types of requests, “it’s always smart to communicate your restrictions to your manager and the party planners,” says Pattie Ehsaei, a workplace decorum expert known as Duchess of Decorum on TikTok. “It’s important to distinguish between a ‘restriction’ and an ‘allergy,’ because the ramifications of an allergy can be severe, suggest foods you are able to eat and ask if they can accommodate your needs. Most companies are happy to have a variety of foods so everyone can have an enjoyable time.” In most cases, a conversation with your manager and the party planners (followed by an email so your requests are clearly articulated in writing) should take care of the matter. Now that we’ve covered what to do about dietary restrictions from a guest’s perspective, it’s time to explore which steps hosts should take to ensure their guests all feel welcome and excited to celebrate the holidays. “Gracious hosts know nowadays to ask about dietary restrictions,” Smith says. An easy way to open up the conversation is to include a line at the end of your invitation encouraging guests to share their dietary needs. If guests do reply by explaining that they have a peanut allergy or a gluten sensitivity or they’re following a vegan diet, resist any urge to get defensive and instead show genuine interest in what their restrictions entail and what you can do on your end to accommodate them. Listen closely, project a positive and hospitable attitude and keep an open mind to any suggestions that your guest offers for how to make them comfortable. By entering your email and clicking Sign Up, you're agreeing to let us send you customized marketing messages about us and our advertising partners. You are also agreeing to our Terms of Service and Privacy Policy.",
    "sentiment_val": 0.2525,
    "sentiment_sd": 0.3211,
    "month": "2022-12",
    "data$month": "2022-12"
  }
]
