[
  {
    "url": "https://www.huffpost.com/entry/ant-and-dec-burst-in-on-this-morning_n_623dd3ade4b04f637b54b6bb",
    "published_date": "2022-03-25T14:37:33Z",
    "author": "HuffPost Video",
    "title": "Ant and Dec burst in on This Morning",
    "text": "HuffPost Video",
    "month": "2022-03",
    "data$month": "2022-03"
  },
  {
    "url": "https://www.huffpost.com/entry/a-history-of-debating-climate-change_n_6238d1d2e4b009ab92fbd936",
    "published_date": "2022-03-21T19:28:18Z",
    "author": "HuffPost Video",
    "title": "A History Of Debating Climate Change",
    "text": "Microbio",
    "month": "2022-03",
    "data$month": "2022-03"
  },
  {
    "url": "https://www.huffpost.com/entry/all-the-times-women-marched-for-change_n_6233b6c4e4b0c727d47bd05b",
    "published_date": "2022-03-17T22:31:32Z",
    "author": "HuffPost Video",
    "title": "All The Times Women Marched For Change",
    "text": "HuffPost Video",
    "month": "2022-03",
    "data$month": "2022-03"
  },
  {
    "url": "https://www.huffpost.com/entry/how-to-optimize-your-workout_n_622f4d62e4b0fa2c21423234",
    "published_date": "2022-03-14T14:12:50Z",
    "author": "HuffPost Video",
    "title": "How To Optimize Your Workout",
    "text": "Microbio",
    "month": "2022-03",
    "data$month": "2022-03"
  },
  {
    "url": "https://www.huffpost.com/entry/madeleine-albright-the-world-is-a-mess_n_623c109ce4b046c938e5484e",
    "published_date": "2022-03-24T06:33:00Z",
    "author": "HuffPost Video",
    "title": "Madeleine Albright: 'The World Is A Mess'",
    "text": "Microbio",
    "month": "2022-03",
    "data$month": "2022-03"
  },
  {
    "url": "https://www.huffpost.com/entry/tie-gen-or-tee-gen_n_6238f8dae4b019fd81316be5",
    "published_date": "2022-03-21T22:14:50Z",
    "author": "HuffPost Video",
    "title": "Tie-gen or Tee-gen?",
    "text": "HuffPost Video",
    "month": "2022-03",
    "data$month": "2022-03"
  },
  {
    "url": "https://www.huffpost.com/entry/the-decline-of-unions-and-the-income-gap_n_623a6f82e4b009ab92feeb21",
    "published_date": "2022-03-23T00:53:22Z",
    "author": "HuffPost Video",
    "title": "The Decline of Unions and the Income Gap",
    "text": "Microbio",
    "month": "2022-03",
    "data$month": "2022-03"
  },
  {
    "url": "https://www.huffpost.com/entry/huffpost-opinions_n_622fa417e4b0c120ef16d8d3",
    "published_date": "2022-03-14T20:22:47Z",
    "author": "HuffPost Video",
    "title": "HuffPost Opinions",
    "text": "HuffPost Video",
    "month": "2022-03",
    "data$month": "2022-03"
  },
  {
    "url": "https://www.huffpost.com/entry/disturbing-new-jan-6-footage_n_62431c2fe4b0742dfa57a4c0",
    "published_date": "2022-03-29T14:48:15Z",
    "author": "HuffPost Video",
    "title": "Disturbing New Jan. 6 Footage",
    "text": "Microbio",
    "month": "2022-03",
    "data$month": "2022-03"
  },
  {
    "url": "https://www.huffpost.com/entry/36-hours-in-brighton_n_622a09b2e4b09711e10b0452",
    "published_date": "2022-03-10T14:22:42Z",
    "author": "HuffPost Video",
    "title": "36 Hours In Brighton",
    "text": "Microbio",
    "month": "2022-03",
    "data$month": "2022-03"
  },
  {
    "url": "https://www.huffpost.com/entry/5-minutes-in-paradise-oahu-hawaii_n_6244f7cde4b0d8266aa758db",
    "published_date": "2022-03-31T00:37:33Z",
    "author": "HuffPost Video",
    "title": "5 Minutes in Paradise - Oahu, Hawaii",
    "text": "Microbio",
    "month": "2022-03",
    "data$month": "2022-03"
  },
  {
    "url": "https://www.huffpost.com/entry/bombshell-jan-6-text-messages-revealed_n_623cfd8fe4b030e7392cce25",
    "published_date": "2022-03-24T23:23:59Z",
    "author": "HuffPost Video",
    "title": "Bombshell Jan. 6 Text Messages Revealed",
    "text": "HuffPost Video",
    "month": "2022-03",
    "data$month": "2022-03"
  },
  {
    "url": "https://www.huffpost.com/entry/dr-dennis-gross-led-mask_l_623b6d3de4b0c727d48707e8",
    "published_date": "2022-03-25T09:45:00Z",
    "author": "Lourdes Avila Uribe",
    "title": "I Regret To Inform You The Dr. Dennis Gross Skincare LED Mask Is Worth Every Penny",
    "text": "Beauty and skin care trends may come and go, but there are a few that have proven themselves to be effective and stand the test of time. One of these trends? The use of light therapy, both in and out of doctors’ offices. Once considered a very niche skin treatment, light therapy’s popularity has grown exponentially over the last decade. As someone who loves to get skin care treatments, I have to admit that I was hesitant when LED (light emitting diode) light therapy devices became available for private home use outside that of dermatologist and aesthetician offices. Not only did I struggle to understand how a home device could be as efficacious as those used in professional office settings, but it seems counterintuitive that this kind of technology is both effective and accessible at a range of price points. But I was wrong! There are quite a few brands with either a light mask or wand in their repertoire but there’s one that caught my eye from the moment it became available. And of course, it’s the most expensive option. I simply cannot help my taste level, it’s a blessing and a curse. After months of seeing rave reviews online, both from customers and beauty professionals alike, I made one of my very first big beauty splurges and bought the Dr. Dennis Gross DRx SpectraLite FaceWare Pro light mask, which retails for a cool $435. Needless to say, I was eager to see if my purchase was made in vain — and dear readers, I am pleased to report that it was worth every hard-earned cent. As it turns out, there’s a reason the mask is used by celebrities and influencers like Salma Hayek, Charlotte McKinney and Lucy Hale. It really, truly works — if you are willing to play the long game. So what does this best-selling light mask actually do? It uses LED lights over your entire face to target the look of both wrinkles and breakouts. This is ideal if, like me, you are perpetually trying to deal with both. You’ve likely seen similar-looking masks and wands floating around, but Dr. Dennis Gross’ FDA-cleared technology uses a combination of 100 red lights and 62 blue lights that work together to target these common skin issues. Red light supports natural collagen production, which helps to smooth the look of fine lines and wrinkles and diminish visible discoloration, scars and damage, while blue light targets acne-causing bacteria, helping shorten the length of breakouts, calm red skin and prevent future breakouts. The mask has three settings: red light, blue light and a third with purple light, a combination of the other two colors. I’ve found that aside from the price tag, something that often discourages people from making the leap is the fact that the brand recommends consistent use for up to 10 weeks to see optimal results. That said, you only need to use it for three minutes a session, so it doesn’t take up a huge chunk of time out of each individual day. But I get it. Ten weeks feels like a really long time! Let me assure you that if you’re using it primarily for acne and breakouts, you may see results almost immediately. I get awful acne along my cheeks when the seasons change. My tender skin doesn’t know how to deal with the onslaught of extreme temperature changes, summer humidity or winter dryness. During this time, I use my light mask near daily, and it’s shocking how quickly my breakouts dry up and the accompanying scars fade. During this time, I primarily use the blue light setting. During what I like to call my “acne off-season,” I use the purple light 2-3 times a week for regular upkeep. I find that it keeps my skin soft, smooth and healthy and is a lovely supplement to my skin care routine. I can definitely attest that my skin feels smoother after regular use for at least 90 days, which makes it a perfect investment if you have a big event coming up. I loaned my mask to my now-sister-in-law in the months leading up to her wedding a few years back, and she was thrilled with the results. Another thing I love about this light mask is that it truly stands the test of time. I’ve had it for at least four years and it’s never failed me or had any maintenance issues, and that’s with very regular use. So yes, it’s quite the investment up front, but you’ll be able to reap the benefits for many years to come. I like to use it right after washing my face, on bare skin. The eye holes and lack of constraining wires make it easy to go about my business during the three short minutes that it takes to do its thing. Make a snack, take a selfie, drink some wine through a straw — the world is your robo-face oyster. Once it turns off automatically, I continue with my skin care routine as normal. It truly couldn’t be easier to add this step into your regime. A purchase of the Dr. Dennis Gross DRx SpectraLite FaceWare Pro light mask includes a USB charging cord, a detachable and adjustable head strap, a storage bag and user manual to get you started. Even if you aren’t a beauty or skin care fanatic, you won’t regret adding this device to your rotation. The reviews truly speak for themselves. Add it to your birthday wishlist or save up and treat yourself, because you absolutely deserve it. I always like to round out a pricey recommendation with more affordable ones, so I’ve included a few other popular options below in case you want to try out light mask technology before you make the big leap. Keep reading to make them yours. HuffPost may receive a share from purchases made via links on this page. Every item is independently selected by the HuffPost Shopping team. Prices and availability are subject to change. By entering your email and clicking Sign Up, you're agreeing to let us send you customized marketing messages about us and our advertising partners. You are also agreeing to our Terms of Service and Privacy Policy.",
    "sentiment_val": 0.1997,
    "sentiment_sd": 0.2946,
    "month": "2022-03",
    "data$month": "2022-03"
  }
]
