[
  {
    "url": "https://www.huffpost.com/entry/a-journey-to-provide-abortion_n_649a161be4b0a6b627a6c7f3",
    "published_date": "2023-05-08T18:26:59Z",
    "author": "HuffPost Video",
    "title": "A Journey To Provide Abortion",
    "text": "Microbio",
    "month": "2023-05",
    "data$month": "2023-05"
  },
  {
    "url": "https://www.huffpost.com/entry/candid-female-celebrities-during-interviews_n_649a16ade4b02bc054baf2a2",
    "published_date": "2023-05-18T21:39:54Z",
    "author": "HuffPost Video",
    "title": "Candid Female Celebrities During Interviews",
    "text": "HuffPost Video",
    "month": "2023-05",
    "data$month": "2023-05"
  },
  {
    "url": "https://www.huffpost.com/entry/super-simple-ways-to-improve-your-skin-long-term_n_649a16c2e4b02bc054baf2d5",
    "published_date": "2023-05-23T18:31:25Z",
    "author": "HuffPost Video",
    "title": "Super Simple Ways To Improve Your Skin Long-Term",
    "text": "HuffPost Video",
    "month": "2023-05",
    "data$month": "2023-05"
  },
  {
    "url": "https://www.huffpost.com/entry/wealthy-celebs-who-are-super-frugal-now-because-they-grew-up-in-poverty_n_649a1672e4b02bc054baf206",
    "published_date": "2023-05-16T18:51:23Z",
    "author": "HuffPost Video",
    "title": "Wealthy Celebs Who Are Super Frugal Now Because They Grew Up In Poverty",
    "text": "HuffPost Video",
    "month": "2023-05",
    "data$month": "2023-05"
  },
  {
    "url": "https://www.huffpost.com/entry/iconic-groups-that-created-successful-solo-artists_n_649a16dfe4b0a6b627a6c9e4",
    "published_date": "2023-05-25T17:07:24Z",
    "author": "HuffPost Video",
    "title": "Iconic Groups That Created Successful Solo Artists",
    "text": "HuffPost Video",
    "month": "2023-05",
    "data$month": "2023-05"
  },
  {
    "url": "https://www.huffpost.com/entry/marjorie-taylor-greene-downplays-white-supremacy-again_n_649a168fe4b0a6b627a6c918",
    "published_date": "2023-05-17T15:14:34Z",
    "author": "HuffPost Video",
    "title": "Marjorie Taylor Greene Downplays White Supremacy, Again",
    "text": "HuffPost Video",
    "month": "2023-05",
    "data$month": "2023-05"
  },
  {
    "url": "https://www.huffpost.com/entry/kymon-greyhorse-culture-shifters_n_6449925de4b0d840388c7a78",
    "published_date": "2023-05-02T09:45:12Z",
    "title": "'I Am Home' Spotlights Navajo Traditions In A Beautiful Way | HuffPost Entertainment",
    "text": " May 2, 2023  To read about the other Culture Shifters, return to the list here.  It’s been a whirlwind year for filmmaker Kymon Greyhorse. Six months after he graduated from the University of New Mexico, he learned his short film “I Am Home” had been selected to screen at Sundance, the largest independent film festival in the country. At just 23, Greyhorse — who is of Navajo and Tongan descent — was hobnobbing with big-name directors and A-list celebrities. With “I Am Home,” it’s evident why he deserved to be there. The short film — which started off as a poem in August 2021 — is only a few minutes long, but it beautifully captures so much around identity, belonging and holding on to tradition in the modern world. Shot in one day in Window Rock, Arizona, “I Am Home” explores what it means to cherish where you come from. The work reveals some of the narratives Greyhorse wants to keep exploring in his filmmaking: his boundless love for the women who raised him, the complexities of his Pacific Islander — or Pasifika — identity, and how his familial relationships inform his work and outlook on life. When Greyhorse started writing “I Am Home,” he had been isolating in Albuquerque, New Mexico, because of the pandemic and hadn’t seen his family or friends in person for over a year. Sitting alone for that period brought up all kinds of emotions, and he said “I Am Home” was like a warm hug he needed. “All of that built-up loneliness and feeling lost and confused of what the future looked like for me — it was like I was almost desperate for anything that would ground me while I was slowly drifting off,” Greyhorse said. “I wanted to feel family. I wanted my anxiety to fade away and for someone to tell me that I’m good and that this feeling isn’t forever. So I took all of those emotions and put it to words.” The filmmaker drew inspiration from an image of an elderly Navajo woman sitting in front of a hogan, a traditional dwelling of Navajo people; she was dressed in Native American clothing and regalia. Resilience takes shape in many ways, and Greyhorse sees it in his community in something as simple as their homes. “She was staring right at the camera, staring into my soul, and I had wanted to re-create that moment,” he said. “Today, our hogans are more modern and practical, and I think it’s so cool that we’re able to adapt but still carry out our ceremonies.” The matriarchal figures in Greyhorse’s life are also prominent influences in his work. Greyhorse’s first narrative short film “Can I Love You?” was released last year and is heavier in tone. It is inspired by his mother and her upbringing on the Navajo reservation, where she was surrounded by alcohol abuse and violence. “They’ve gone through hell and back, and even though the world throws so much at them, they still come out on top,” Greyhorse said of the women in his life. “That’s definitely influenced my work; that’s definitely influenced my perspective on the world and the kind of stories I want to tell.” Greyhorse grew up in Utah and New Mexico, splitting his time between his Tongan father in Salt Lake City, and his Navajo mother in Albuquerque. He identifies as two-spirit, a term that describes Indigenous people who have both masculine and feminine energy. When he was bullied for his identity, including his Native and Pacific Islander background, he drew strength from his family. “They always reassured me that I was loved and that at the end of the day, I can come home and be myself fully and be loved for who I am,” Greyhorse said. “That really allowed me to care less about the bullshit, the bullies, and all the teasing. I feel like I’m entering my bad bitch era. That’s thanks to my Mom.” Coming back to Utah, where Greyhorse spent a lot of his youth, to screen “I Am Home” was a full-circle moment for him. On a panel at the Sunrise Collective, the new AAPI house that spotlighted Asian and Pasifika voices at the festival, Greyhorse talked about his Tongan lineage and the role it plays in his work. He opened up about his strained relationship with his father, which has led to some disconnects from Tongan culture. It was his first time publicly sharing this part of his story, but he quickly realized it connected with some audience members. “I looked into the crowd and I saw a woman wiping her tears, and I thought, ‘Is that for me?’” Greyhorse said. “I didn’t think my personal experience would resonate so much and cause such a reaction, but for the first time I wasn’t afraid.” “I felt like a piece of me that I had been neglecting was starting to heal,” he continued. While Greyhorse’s dad may not have always been present during his childhood, he credits him for being one of the reasons he’s a filmmaker. “He introduced me to horror movies, kung fu action movies, thrillers and a lot of foreign cinema and a lot of Asian cinema as well,” he said. “I know that his absence in my life manifests itself in my art, too, and I can’t shy away from that.” Growing up, Greyhorse saw his dad buying calling cards and other items to send his family in Tonga whenever they needed it. He realizes now some of the sacrifices his father made at the time. “He came to this country with so little, yet he was able to stay above water and try his best to provide for me,” he said. “I was too young to see him as someone who could be missing home or feeling lost.” Now, Greyhorse is tapping into his Tongan roots for his next project. He is working on his first feature-length film about a Native Hawaiian and Tongan woman who, after being away from her father for 11 years, finds out he’s been murdered. It’s a journey of yearning, survival and righting wrongs. He’s submitted script treatments to several fellowships and is trying to raise funds to get it made. “It’s so interesting, because doing this interview and having these opportunities like the panel was necessary,” Greyhorse said, noting he was proud to represent his Tongan lineage at Sundance. “It was literally because of this that I’m allowing my Dad to be human, humanizing the choices that he made and reflecting on why.” Greyhorse forged strong connections with other Pasifika filmmakers at the festival — and he is hopeful that Pacific Islander representation will only grow in the future. “I had this cool moment where some other islanders came up to me and their eyes lit up, telling me how proud they were of me,” he said, mentioning Māori producer Desray Armstrong and members of advocacy organizations such as the Pasifika Entertainment Advancement Komiti. “It was so comforting just feeling that joy and shared experience of what the future holds for Pasifika cinema.” Healing is a recurring theme in Greyhorse’s work. “I hope that my films are able to heal wounds that have scarred over and then maybe even open new ones that people aren’t ready for yet,” he said. “I just want my art to reflect the current times. Whether it’s in society or whether that’s with me personally.” Greyhorse dreams of making films just for the fun of it, too, and is adamant about not being used to reach a diversity quota or to please people. “I want to see the day where I don’t have to explain what representation means to me,” he said. “A day where our existence and voices are so normalized that we’re just there.”",
    "sentiment_val": 0.155,
    "sentiment_sd": 0.2367,
    "month": "2023-05",
    "data$month": "2023-05"
  }
]
