[
  {
    "url": "https://www.huffpost.com/entry/rap-shit-season-2-interview_n_64ca8a2be4b044bf98f9082b",
    "published_date": "2023-08-03T09:45:04Z",
    "title": "‘Rap Sh!t’ Season 2 Is Even Better Than The First | HuffPost Entertainment",
    "text": "The Issa Rae-created show steps into its glow-up season, but its characters find that new levels mean new devils. By Taryn Finley LOS ANGELES — At the Ace Hotel in downtown Los Angeles in March, journalists watch on two small screens as Aida Osman, KaMillion and Jonica Booth act out a scene in Issa Rae’s “Rap Sh!t.” Their characters, Shawna, Mia and Chastity, celebrate their rising star as touring artists in a swanky hotel with a shot of 1800 tequila. Mia, portrayed by KaMillion, is extra hype. After a couple of takes, Amy Aniobi, who directed the episode, tells KaMillion to channel her own excitement for the next take. Her energy level spikes, and it’s hard to tell whether the celebration is for her or her character as she cheeses from ear to ear, elevates her voice for a victorious “Let’s gooo!” and jumps for joy right onto the bed. The glow-up between these actors and their characters feels connected. But the actors aren’t a rap duo with a manager trying to make it (though KaMillion is a music artist). They’re three women on an unprecedented show pumping more life into an already-thriving wave of women dominating and rising up in hip-hop — all while tackling their personal journeys as new actors in new territory in television. “We’re not playing games this season,” showrunner Syreeta Singleton assured journalists during the March set visit. “We’ve been so particular with who’s behind the camera and what it looks like. We’re also, from a storytelling perspective, trying to make it feel like it’s as relevant, as real, as funny as it can possibly be. I feel like we just stepped it up all around.” Rae agreed, adding, “We’re treating this season like we may not come back. We just want to tell the best story possible and pull out all the stops and really just showcase what it’s like to be a female rapper in this industry when you’re coming up.” In the second season of the show, Shawna (Osman) and Mia are the opening act for rapper Lord AK. Sort of. They actually perform alongside Reina Reign, a popular white rapper who uses Black stereotypes in her music, aesthetics and speech. Chastity (Booth) is using her finesse to find the duo — and herself — more visibility and money while on tour. Shawna, Mia and Chastity discover that new levels mean new devils, however, when they realize tour life requires more grit than glamour as they try to make a name for themselves. (TV and film writers and actors, including those who worked on “Rap Sh!t,” are currently on strike over more equitable pay and working conditions in the streaming era. These interviews were conducted ahead of the strike by WGA and SAG-AFTRA members.) Glow-ups, on and off screen, don’t mean a lack of losses. Shawna, played by writer and actor Osman, is more confident and fly this season as she gets closer to the rap dreams she saw for herself since her college days. But she’s also coming to terms with her Season 1 decision to sacrifice her art for success — all while ducking criminal charges. Mia’s star shines on stage, and she has men flocking to her, but her desire to have it all at once comes to a head. Chastity is finally an artist manager but is fighting to earn respect. Osman — who joined the cast from the writers room after nailing an audition for Shawna that she didn’t realize was an audition — admits that her character’s life “sucks.” “She is an alleged criminal. She is an overly confident brat. She is weirdly insecure and narcissistic at the same time. She’s got a lot of things going for her right now that are really difficult to navigate. And she’s got to learn,” Osman explained. Though she may not be going through what her character experiences, she channels Shawna by picturing herself a year prior. “I look at old photos of where I was at before I felt like I was on and the feeling of really wanting to prove to someone how creative and how smart and how different you are,” she said via a Zoom interview. “And I felt that way in comedy because I felt like I had to carve out my own space.” And though acting wasn’t always a part of her plan, Osman — whose viral rap about pegging gained her more attention in 2019 — admits that it’s been a key tool in helping her writing. Booked and busy isn’t always a good thing, however, as she’s been reminded of the value of her time and energy through her character. “I see in Shawna this need to keep the ball in the air and this obsession with keeping the momentum going,” she said. “Shawna could damn near be my shadow self. She could damn near be the side of me that indulges in every opportunity, gives herself to everyone, doesn’t have any boundaries. She represents that for me. I think with Shawna, I learned that I have to choose what I occupy my time with, and it can’t be things for other people.” KaMillion, on the other hand, “is Mia,” Osman said. For the rapper turned actor, who was born in Jacksonville, Florida, her character hits close to home while being a step away from it. “In my city, it’s very rare for somebody to make it out, Kamilion said. This season, Mia “is becoming who she thinks she is,” KaMillion explained. We see her confidence rise as she becomes the personification of “City Girls winning.” She also gives voice to a very real balancing game that women have to play, she said. “Women in the industry, they don’t get credit that we’re due when it comes to raising children, going on tours, making sure our mate is pleased sexually and making sure the food is on the table,” KaMillion said. “We got a lot of shit. Making sure our lace is laid, making sure that mascara right. We get to see that with Mia.” Just as she pours into Mia, Mia is also pouring into KaMillion. The “Fine Azz” rapper quit rapping to focus on acting. But a conversation with another rapper who made a guest appearance on the show made her reconsider throwing her hat back in the ring. “I think Mia has definitely opened up doors for KaMillion to do whatever she wants,” she said. That includes fostering dreams to open a restaurant, start a charity and keep a roster on deck. (“Date them all until one don’t play about you,” she said matter-of-factly.) For Booth, Chastity has been a lesson in establishing goals in career, health and just overall, something the actor said she didn’t do too much of before coming on the show. “I try to always put myself a step closer to the goal post,” she said of lessons from her character. “And that’s what Chastity does. You might not like how she do it, you might not like her, you might not respect how she do her thing. And that’s how I live. I just want to keep going.” On “Rap Sh!t,” Chastity is a masc-presenting queer woman who’s fighting to be taken seriously in managing, in pimping, in life. She wears a mask to find a means to an end, but Booth teased that sometimes one doesn’t take one off ― it just falls off. “I hurt for Chastity because I know that it’s so many people truly living a life of just trying to be accepted,” Booth said. “And it shows that even if you clear one hurdle of being accepted and loving yourself for being masc and all that, now you got to clear the hurdle of being accepted in the workforce. So it’s like she’s forever fighting. Her whole life has been nothing but a fight. So I want to see that. But as far as what Chastity has shown Jonica? Keep going, keep going.” This collective of characters — an alleged scammer, a “city girl” and a “pimp” trying to make it in the rap game — is probably one of the most multidimensional trios to exist in a show based on hip-hop. At a time when women run rap yet still due to sexism aren’t being given the same seriousness men in rap get across the board, “Rap Sh!t” shines. “We feel like pioneers,” KaMillion said. “There’s no show like this; there’s never been a relationship dynamic between baby daddy and mama like this on TV. There’s never been a dynamic like Chastity’s. I feel like people who embody these characters in real life, they’re seen.” And with mostly Black women in front of and behind the camera, the show’s voice feels representative of a segment of hip-hop culture that still gets overlooked and devalued. “For me working next to just Black women, it reminded the young Jonica, you can do this, because as a kid I didn’t see this too often,” Booth said. “This is a privilege,” Booth added, beaming. “We all like to just say Issa because that’s who everybody know and she is that bitch. But we also got Syreeta. We have Nina [Gloster], the writers. And I’m just naming the women that we’re looking at. And we have Jax [Clark], she’s a producer. Amy was one of our directors. These are Black women and they’re doing it. We are in Hollywood and we’re doing it. So it just shows I’m on the right path.” Season 2 of “Rap Sh!t” premieres on Nov. 9 on Max. This story is part of a HuffPost series celebrating the 50th anniversary of hip-hop. See all of our coverage here.",
    "sentiment_val": 0.0968,
    "sentiment_sd": 0.2904,
    "month": "2023-08",
    "data$month": "2023-08"
  },
  {
    "url": "https://www.huffpost.com/entry/candid-female-celebrities-during-interviews-2_n_64d66afae4b074cfb4989ca1",
    "published_date": "2023-08-11T16:13:43Z",
    "author": "HuffPost Video",
    "title": "Candid Female Celebrities During Interviews 2",
    "text": "HuffPost Video",
    "month": "2023-08",
    "data$month": "2023-08"
  },
  {
    "url": "https://www.huffpost.com/entry/how-domtomato-propels-free-running_n_64d3e400e4b074cfb4989c82",
    "published_date": "2023-08-09T17:50:38Z",
    "author": "HuffPost Video",
    "title": "DomTomato Propels Freerunning",
    "text": "HuffPost Video Senior Producer",
    "month": "2023-08",
    "data$month": "2023-08"
  },
  {
    "url": "https://www.huffpost.com/entry/artists-you-might-be-surprised-to-find-out-are-managed-by-scooter-braun_n_64e67538e4b0a7a20baab8d4",
    "published_date": "2023-08-23T19:35:48Z",
    "author": "HuffPost Video",
    "title": "Artists You Might Be Surprised To Find Out Are Managed By Scooter Braun",
    "text": "HuffPost Video",
    "month": "2023-08",
    "data$month": "2023-08"
  },
  {
    "url": "https://www.huffpost.com/entry/we-tried-breastfeeding-for-24-hours_n_64d787cae4b03cf4f7f7ea7d",
    "published_date": "2023-08-12T13:23:22Z",
    "author": "HuffPost Video",
    "title": "We Tried Breastfeeding for 24 Hours",
    "text": "HuffPost Video",
    "month": "2023-08",
    "data$month": "2023-08"
  }
]
