[
  {
    "url": "https://www.huffpost.com/entry/disney-facts-that-are-equal-parts-delightfully-geeky-and-100-fascinating_n_65569185e4b0e4767013896b",
    "published_date": "2023-11-16T21:30:09Z",
    "author": "HuffPost Video",
    "title": "Disney Facts That Are Equal Parts Delightfully Geeky And 100% Fascinating",
    "text": "HuffPost Video",
    "month": "2023-11",
    "data$month": "2023-11"
  },
  {
    "url": "https://www.huffpost.com/entry/how-should-celebrities-apologize_n_65411e66e4b0ae2dc0b570cb",
    "published_date": "2023-11-10T16:30:35Z",
    "title": "How Celebrities Should Publicly Apologize | HuffPost Entertainment",
    "text": "Experts explain why apologizing can be so difficult — and how “canceled” celebrities could do it more effectively. By Marina Fang | Published Nov. 10, 2023 This story is a part our weeklong series on cancel culture. Read the other stories here. If you spend any time online, you may recognize the tropes of a public apology — or frequently, a non-apology — issued by a celebrity, politician, CEO, or other public figure accused of or admitting to wrongdoing. It often comes in the form of a Notes app screenshot or a block of text in an Instagram story. And when it’s a bad apology, that very often becomes the story. The apology can be absurd to a comical degree, like chef Mario Batali issuing an attempted apology in response to accusations of serial sexual harassment in 2017 — and concluding it with a recipe for cinnamon rolls. Or more recently, after a HuffPost investigation this summer revealed that YouTuber Colleen Ballinger allegedly “groomed” several of her young fans for inappropriate relationships, she responded to the accusations — by posting a 10-minute song. “Even though my team has strongly advised me not to say what I want to say, I recently realized that they never said I couldn’t sing what I want to say,” she states in the video, while strumming a ukulele. Needless to say, her video, which denies the allegations and does not actually include an apology, did not go over well. It generated various parodies, as well as comments like: “Be so for real Colleen. Make a real apology and take accountability for your actions” and “YOU SHOULDVE LISTENED TO THE PR TEAM GIRL.” The bad apology often contains some of the following phrases: “I’m sorry if you were offended,” “as a father of daughters,” “I don’t have a racist bone in my body,” “this doesn’t reflect who I am,” “I did not intend to hurt anyone.” These appear so frequently that writers Marjorie Ingall and Susan McCarthy compiled many of them into bingo cards on their site, SorryWatch, where they analyze a variety of apologies in the news and in history — often bad ones, but occasionally good ones, too. Their fascination with apologies also grew into their recent book: “Sorry, Sorry, Sorry: The Case for Good Apologies.” In our age of powerful people decrying “cancel culture,” issuing a heartfelt and genuine apology often makes it far less likely that the person, brand or organization becomes “canceled,” as Ingall and McCarthy said in an interview. Case in point, one public figure’s apology that has stuck with them over the years is that of Wayne Hale, the launch integration manager of NASA’s space shuttle program in 2003, when the space shuttle Columbia exploded, killing all seven astronauts on board. Hale publicly apologized to NASA’s staff and took full and personal responsibility — and repeatedly. “It was months of taking responsibility and apologizing to people, without it feeling like that stupid, trudge-y apology tour that a lot of celebrities do. It was real,” Ingall said. “And I think it’s worth noting that he was still promoted after all of this happened. So people talk about, ‘Oh, you’re going to be canceled if you apologize,’ or: ‘Oh, it’s so risky to your career to apologize.’ A good apology does not have to torpedo your career, and, in fact, can help people see you in a new light and can help people think: ‘Wow, that is a person who’s a real grown-up.’” In figuring out how to respond to a scandal, public figures, companies and organizations routinely turn to public relations and crisis communications professionals. Several who spoke to HuffPost noted that the apology can depend on myriad factors, such as the person and the level of the offense. But still, there are common pitfalls and complications of apologies, and there’s a general consensus that a good apology can go a long way. “A lot of people are just bad at saying sorry. They don’t really say: ‘I’m sorry, period.’ There’s a lot of, like, ‘I’m sorry that bothered you.’ ‘I’m sorry you were offended.’ And I think a lot of the time when an organization or company is really struggling to come back, it’s because of that inability to just own it,” said Rida Bint Fozi, president of the TASC Group, a PR agency that represents many nonprofits and progressive advocacy organizations. “And there’s a lot of deflection in how they are approaching their response to situations. So I think our job is to counsel clients to take that ownership and just go with the ‘I am sorry, period.’ The public is smart, and your consumers are smart, your constituents are smart. It’s also that you should want them to hold you to that standard.” Publicist and crisis communications expert Ron Berkowitz sometimes encounters clients who fear that apologizing might make them look bad. “But for the most part, and depending on the situation, it does help you get from point A to point B,” said Berkowitz, the founder and CEO of Berk Communications. “It helps put the water under the bridge and move forward.” Berkowitz, whose firm often represents public figures in sports and entertainment, noted the added challenge of dealing with big egos. “A lot of times it’s hard, especially for a public figure or celebrity, an athlete, someone in the public eye, to admit that they’re wrong because there’s a lot of ego there,” he continued. “When you’ve done something wrong, you admit it and you put it on yourself and say you’ve made the mistake, it also brings that public person to a normal level that you and I can relate to.” Celebrity or not, apologies are hard. Issuing a good and genuine apology involves overcoming a lot of social conditioning. That’s a big part of what motivated Ingall and McCarthy to take a less critical and more instructive approach toward apologies in their book. When they started SorryWatch in 2012, their initial focus was on analyzing bad public apologies, often snarkily, Ingall explained. “But then, in 2016, when there was a certain political shift in our country, and the idea of apologizing ... wasn’t just a choice [of] whether or not you apologize ― it was a sign of weakness,” she said. In addition, McCarthy noted that on an individual level, “whether you’re a celebrity or not, in apologizing, you put yourself in a vulnerable position. You come out there and you say: ‘I did this bad thing, said this stupid thing.’ You put yourself in a one-down position, and that just doesn’t feel good,” she said. “And we just sort of reflexively protect ourselves because it’s risky to put yourself in a one-down position. People may think poorly of you, they may say mean things to you. They may point and stare.” In our age of powerful people decrying “cancel culture,” issuing a heartfelt and genuine apology often makes it far less likely that the person, brand or organization becomes 'canceled.' Similarly, several therapists pointed out that there are many social and cultural reasons that make apologies hard for us. “Just being able to admit when you’re in the wrong I think can be very difficult for people, especially if they grew up with a family or with relationships that never modeled that behavior,” said San Francisco-based therapist Miya Yung. “So it makes sense why it’s really difficult for them to know how to practice that on their own.” The factors that make it hard for people in general to apologize — shame, judgment, vulnerability, to name a few — become magnified when the person in question is in the public eye. “When we have a moment with a friend that we have harmed or have hurt, unknowingly or knowingly, it’s just really uncomfortable,” said Dr. Akua Boateng, a Philadelphia-based therapist. “It brings a lot of shame. It is difficult to be at the helm or feel responsible for the hurt of another human being.” In the case of a public figure, “We can amplify that by thousands, by hundreds of thousands,” she continued. “So now there are all of these peripheral hurts and offenses that can’t even be numbered, and it can be greatly, greatly difficult for a person that is influential in some way to be seen as having a dent in their armor of competence.” When you add ego and power into the mix, no wonder it can be a challenge for public figures to apologize, as Ingall pointed out. “Our brains are wired to make it difficult to apologize. We all basically see ourselves as good people, and people who have a certain amount of success think that it’s because they deserved that success. And when you are confronted with evidence that, hey, maybe you weren’t as good a person as you thought you were, maybe you were the villain in somebody else’s story, your brain’s reaction is to turn backflips to solve that cognitive dissonance in your favor. ‘It wasn’t really that bad.’ ‘Oh, I was provoked.’ ‘Oh, it was blown out of proportion.’ ‘Oh, it’s cancel culture!’” she said. “Good apologies really are heroic because you have to overcome your own brain’s wiring.” So what actually constitutes a good apology? The therapists emphasized the need for the person to demonstrate empathy and sincerity in the apology. For example, Boateng named three crucial components: acknowledging the hurt, taking responsibility, and expressing a desire for changed behavior. Of those, she said taking responsibility can be particularly difficult for people because they may not understand what they did wrong. In addition, a common pitfall of an apology is when the person spends too much time trying to explain their behavior. “It’s not about your opinion about it or even the details of what transpired. The main thing is that this person has been hurt,” she said. “Sometimes people can explain away the reasons that came before the hurt or could in some way potentially give insight into why maybe they shouldn’t be hurt. But the end of that is still your own experience, not the other person’s.” That might explain the frequency of “I’m sorry if…” phrases in bad apologies. Therefore, as Yung said, on a basic level, “It’s very important just to make sure that you say the simple phrase, ‘I’m sorry, period.’ I think a lot of times, folks will kind of jump into, not necessarily excuses, but just trying to find reasons or justification for why they acted that way in the first place.” In addition, an apology should contain a clear statement “that you intend to do things differently either the next time or just in the future,” she said. With public figures and their apologies, the public nature of it all can make things complicated. Despite that, the fundamental elements are fairly similar. For Bint Fozi, a client’s willingness to take ownership of the mistake is “step number zero” in assessing a situation and deciding whether to work with them. “Because if there is no ownership, there really is nothing a PR person can do to help them,” she said. “Reestablishing trust, all of it has to really come from an authentic place. But I also think part of the reason that it’s important is because we want to see our clients be successful coming out of a situation like this. And we have to counsel them according to what we believe in.” She typically advises clients to apologize in a timely manner, and that the apology involves authenticity and accountability. She also advises an organization’s leaders to come up with an action plan beyond the initial apology, whether it’s internal or external actions that demonstrate that they are in fact trying to learn from their mistakes. The factors that make it hard for people in general to apologize — shame, judgment, vulnerability, to name a few — become magnified when the person in question is in the public eye. For public figures, companies and organizations, the logistics of the apology can also get complicated. There are a lot of people who may have a hand in the apology before it goes out. Similarly, there are a lot of different audiences for the apology, depending on the situation: board members, shareholders, business partners, fans, constituents, customers, employees, the person’s family, etc. And if there are ongoing legal proceedings involved, those could limit what the person can say and the extent to which they might be able to apologize. “There’s not a clear answer in terms of what an apology or responding from scandal looks like,” said Ronn Torossian, the founder of 5WPR. He likened it to, “If you’re in the operating room, you’re being asked to be the cardiologist while the heart attack is happening.” In terms of who actually writes the apology, it similarly can vary based on the client and situation. But each of the PR experts generally agreed that an apology that’s authentic and matches the public figure or organization’s voice goes over far better than one that sounds canned. It often helps if the client has directly drafted it themselves. “I would say that those that write it themselves generally are more contrite about it,” Torossian said. “Of course, it’s best if you do something where you really screwed up, you mean what you say.” Similarly, Berkowitz said that while the choice of who writes the apology can depend on the client and their level of involvement in their communications, “We do like to push them to make it their words and not ours,” he said. “We can craft it and fix it. But it’s always better if it’s their words and not a lawyer or a spokesperson’s because it’s not as genuine.” In addition, he often advises clients to film a video of them personally issuing the apology, which can help personalize it, especially in our social media age. “I want the public to see you, look into your eyes and know that it’s real, because that’s making it much more believable.” Regardless of who ultimately writes the apology, Bint Fozi stressed that “the entire process is usually a very, very close collaboration” with the client. “It’s not like you write something, give it to someone, and they’re just sort of like: ‘Cool, thanks,’ and sign off on it,” she said. “It really has to come from what they’ve already told us.” Timing is often a key variable in public apologies. The person or company is often up against a ticking clock to apologize swiftly. However, in reading up on the science around apologies while writing their book, Ingall and McCarthy found that a swift apology may not be the most effective. For example, research from Oberlin College psychologist Cynthia Frantz has found that “later apologies were more effective than earlier ones, and that this effect was mediated by feeling heard and understood.” On a more practical level, “If you’re precipitous in your apology, it doesn’t seem sincere. It just seems like your knee jerk, ‘Let me out of this. Let’s move on,’” Ingall said. “But I also think that most people would rather wait and hear a good apology that sounds like a real human being, even if it comes after a delay.” She cited one delayed but ultimately effective celebrity apology: In 2021, “The Office” and “Unbreakable Kimmy Schmidt” star Ellie Kemper issued a lengthy apology for participating in a debutante ball with a racist history when she was 19. Though she waited a week after the story resurfaced and blew up on the internet, her apology — in which she did not make excuses and acknowledged her privilege as a wealthy white woman — came across as genuine. On the other hand, taking a long time to apologize — only to get it wrong, thus making the bad apology the story — can also be damaging. And timing can be hard to control, especially for public figures. For instance, Torossian said it’s often incumbent upon the public figure to apologize swiftly “if they’re being killed in the media every day” for not apologizing. And getting out in front of it could prevent anything further from happening. He pointed to a recent example of what he thought was a well-handled apology: actor Jamie Foxx apologizing for an Instagram post that inadvertently referred to an antisemitic trope. “Had he waited, I think the damage would have been much worse. And what did he do? Cut it off at the head. That made it much, much easier,” Torossian said. “I don’t think somebody three years from now is gonna remember that.” For therapists, they say timing may matter less than whether the person expresses a genuine apology. “So if that takes you 30 minutes, if it takes you two days, if it takes you a year — you know, it depends on the relationship — but you really want to make sure that you can lead with empathy,” Boateng said. “So your journey towards empathy is really what the timing should look like. If you are driven by timing, you’re not driven by the right thing. We’re fear-based, which will come into the quality of the apology. It will be seen to be fear-based: that I am more concerned about getting in trouble than reconnection and actually genuinely feeling your pain of being harmed.” At the same time, there can also be downsides to waiting to apologize. For instance, with her couples and marriage counseling clients, Boateng advises them that “apologies are great early and often. Allowing the other side of that is letting it sit too long, and it will create malignancy in the relationship that erodes the trust or have a significant damaging effect.” There are ways to strike a balance between having the time to reflect, but not waiting too long, as Yung explained. “It’s helpful just to have some time to be able to reflect, and so while I do think it’s important for there to be time, I think it’s also important that it’s not too much time to the point of avoidance,” she said. “Sometimes, having too much time and too much distance can just kind of breed resentment, or just confusion, or a lot of assumptions.” For instance, when working with a client who knows they should apologize for something but doesn’t feel ready, she might tell them that “it’s okay to say: ‘I need more time right now. I’m still reflecting on what I did wrong. I hope to be able to communicate with you in the future.’ Or: ‘I know I need to apologize in the future.’” The communication part is key. Complete radio silence can be damaging because “there can be a lot of assumptions made during that time when there’s no communication,” Yung added. “A lot of times, because the person is already hurt, they’re gonna be way more likely to assume very negative things.” No matter the timing, the apology must come from a sincere place. For example, the public can often tell if the person is being forced into apologizing in order to tamp down the fire of their scandal. From analyzing years of bad and insincere apologies, Ingall said: “Our opinion is if you’re not sorry, don’t apologize. That may not be what the crisis communications people would say. You’re gonna deliver a really shitty apology if you are not sorry.” Some of them, like Berkowitz, actually felt very similarly. “I think I am from a camp of: You don’t apologize just to apologize,” he said. “You apologize for something you think you did wrong. My advice is always going to be to not do it just to do it, because that comes off as not sincere. If you did something wrong, you’re gonna figure out the right way to apologize and help curb the crisis and build your brand or your business back where it’s supposed to be.” What does it mean for the public to become the informal arbiters of these apologies? Social media, especially for those of us who are Terminally Online, has created a sort of culture around these public apologies. We often join a pile-on, snarkily pointing out the aforementioned tropes of insincere and bungled apologies. But jokes aside, social media — while certainly a flawed mechanism — does create some level of accountability and transparency that did not exist before. As McCarthy noted, watching a famous person mess up publicly could be a learning experience for us all. “I do think that seeing public people go through this process on social media, seeing them do or say a stupid thing, seeing them apologize, seeing people say: ‘That was stupid!’ ‘That was racist!’ ‘That was mean!’ Seeing them apologize badly, and people coming after them and saying, ‘What do you mean you’re sorry if anyone was offended? You know we’re offended!’ And then sometimes they come back with a better apology. I think that a lot of people are very interested in that, and I believe a lot of people are learning from that.” More broadly, public apologies might serve as yet another reminder to not put too much stock into our society’s outsized focus on celebrity culture. Ingall added that social media can also give fans or constituents of the public figure some vehicle for accountability, however imperfect. “Social media can be a positive leveling force,” she said. “Think about back in the days of the studio system in the 1950s, where everything was filtered through [studio-controlled fan magazines like] Photoplay and, like, gossip columnists and plants. A fan could never get to a celebrity to say, ‘You know, you did something really hurtful.’ Now, those barriers are down, for better and for worse — and we often forget that it is sometimes for better. Accountability is not the same thing as being canceled.” Boateng sees all of this as part of a larger cultural shift “towards personal accountability as well as collective justice.” As a result, “a lot of folks feel personally responsible to be the eyes around what needs to happen as far as justice,” she said. “That can be a beautiful thing: to call people in and to really support them in taking accountability and culpability.” At the same time, “It can be challenging to also make sure that we are sensitive and on top of what that actually looks like psychologically,” she added. While their apology certainly has an effect on how we perceive the public figure after a given scandal, it’s only a starting point. That’s why, for instance, Bint Fozi emphasizes to clients that they must have a longer-term plan toward accountability, as early as when they make their initial apology. “People may read something that you post, maybe hate it, maybe not love it. And if three months later, you have stuck by that through your actions, and with that follow-through, then it probably doesn’t matter what they thought in the first go-around,” she said. “What matters more is that you were able to show them and not tell them what you really feel about the situation, how you really want to approach having corrected the situation.” More broadly, public apologies might serve as yet another reminder to not put too much stock into our society’s outsized focus on celebrity culture. We're bringing you the exclusives, scoops and hot takes on the news all your friends are talking about. Join our loyalty program to support our work and go ad-free. You've supported HuffPost before, and we'll be honest — we could use your help again. We won't back down from our mission of providing free, fair news during this critical moment. But we can't do it without you. For the first time, we're offering an ad-free experience to qualifying contributors who support our fearless journalism. We hope you'll join us. You've supported HuffPost before, and we'll be honest — we could use your help again. We won't back down from our mission of providing free, fair news during this critical moment. But we can't do it without you. For the first time, we're offering an ad-free experience to qualifying contributors who support our fearless journalism. We hope you'll join us. Already contributed? Log in to hide these messages. Yung says it’s important to remind ourselves that “no matter who it is that’s apologizing — whether it’s a celebrity, a public figure, the head of a company — at the end of the day, they’re just another human. And for us to expect them to be these perfect and unflawed godlike figures is very unrealistic,” she said. “So I think we just have to be real with ourselves and recognize: It’s OK that their public statement or public apology doesn’t fit every need that we have from them in that moment.” Ingall humorously likened it to the end of “Barbie,” when Barbie (Margot Robbie), who is used to being “the center of the world in Barbieland, decides to go be a regular person in the real world.” “Rather than deifying celebrities and their shitty god-awful apologies, we could just think about being the best normal people and be better than celebrities,” Ingall said. “We can be when it comes to apologies because we don’t have that whole machinery in place.” See the entire Cancel Culture Unraveled series here.",
    "sentiment_val": 0.1159,
    "sentiment_sd": 0.3133,
    "month": "2023-11",
    "data$month": "2023-11"
  },
  {
    "url": "https://www.huffpost.com/entry/how-to-cook-a-turkey-goog_l_653fd8c3e4b0a78a26a432c6",
    "published_date": "2023-11-21T10:45:00Z",
    "author": "Julie R. Thomson",
    "title": "Everything You Need To Know About Cooking A Thanksgiving Turkey",
    "text": "Everything Thanksgiving: Get all our Thanksgiving recipes, how-to’s and more! Thanksgiving only comes once a year, which means there aren’t many chances to practice cooking up a Thanksgiving turkey ― and that often spells disaster. But if you study up and learn about the basics of cooking a turkey, you can totally pull it off. We’re here to warn you of all the possible pitfalls ― so do your homework, and you won’t have to worry about committing one of the many mistakes that have become all too common. Below, we’re presenting all the ways a turkey can go wrong in your kitchen and how to these mistakes can be easily avoided. It’s really easy once you know what you’re doing, we promise. Read up, and you’ll be fine come the big day. *Note: The USDA recommends all turkeys be cooked to at least 165 degrees Fahrenheit for optimum safety. You’ll notice below that we often suggest removing the bird from the oven when it reaches 160, but that’s because the bird’s temperature will continue to rise to 165 (or above) after you remove it from the oven. Just make sure it ultimately reaches 165. By entering your email and clicking Sign Up, you're agreeing to let us send you customized marketing messages about us and our advertising partners. You are also agreeing to our Terms of Service and Privacy Policy.",
    "sentiment_val": 0.1555,
    "sentiment_sd": 0.2696,
    "month": "2023-11",
    "data$month": "2023-11"
  },
  {
    "url": "https://www.huffpost.com/entry/shooting-victims-uncles-speak-out_n_65650fb1e4b05f498ba183d7",
    "published_date": "2023-11-27T21:05:38Z",
    "author": "HuffPost Video",
    "title": "Shooting Victims' Uncles Speak Out",
    "text": "HuffPost Video",
    "month": "2023-11",
    "data$month": "2023-11"
  },
  {
    "url": "https://www.huffpost.com/entry/secretary-pete-buttigieg-on-new-speakers-anti-gay-views_n_65452a07e4b01b258583977a",
    "published_date": "2023-11-03T16:51:09Z",
    "author": "HuffPost Video",
    "title": "Secretary Pete Buttigieg On New Speaker’s Anti-Gay Views",
    "text": "HuffPost Video",
    "month": "2023-11",
    "data$month": "2023-11"
  },
  {
    "url": "https://www.huffpost.com/entry/celebs-who-were-drunk-or-high-during-talk-show-appearances_n_654c21b9e4b088d9a74d11ce",
    "published_date": "2023-11-08T22:48:45Z",
    "author": "HuffPost Video",
    "title": "Celebs Who Were Drunk Or High During Talk Show Appearances",
    "text": "Microbio",
    "month": "2023-11",
    "data$month": "2023-11"
  }
]
