[
  {
    "url": "https://www.huffpost.com/entry/5-signs-that-prices-are-too-damn-high_n_63f9435be4b032c6718d6d87",
    "published_date": "2023-02-24T22:28:54Z",
    "author": "HuffPost Video",
    "title": "5 Signs That Prices Are Too Damn High",
    "text": "HuffPost Video",
    "month": "2023-02",
    "data$month": "2023-02"
  },
  {
    "url": "https://www.huffpost.com/entry/mystery-ball-stumps-authorities_n_63f7df6ee4b04ff5b489040b",
    "published_date": "2023-02-23T21:23:56Z",
    "author": "HuffPost Video",
    "title": "Mystery Ball Stumps Authorities",
    "text": "HuffPost Video",
    "month": "2023-02",
    "data$month": "2023-02"
  },
  {
    "url": "https://www.huffpost.com/entry/married-women-share-red-flags-they-ignored-while-dating-their-husband_n_63e41d3de4b0e909c43b1e95",
    "published_date": "2023-02-08T20:44:36Z",
    "author": "HuffPost Video",
    "title": "Married Women Share Red Flags They Ignored While Dating Their Husband",
    "text": "Microbio",
    "month": "2023-02",
    "data$month": "2023-02"
  },
  {
    "url": "https://www.huffpost.com/entry/what-is-slow-travel-vacation_l_63ea5c31e4b0063ccb27b668",
    "published_date": "2023-02-24T10:45:20Z",
    "author": "Caroline Bologna",
    "title": "'Slow Travel' Might Be The Key To A Better Vacation. Here's What It Is.",
    "text": "In the rush of day-to-day life, we don’t always have the opportunity to slow down and move at our own pace. Even on vacation, there’s an urge to visit, do and taste as many things as possible in a new destination or multiple destinations. “I’ve heard countless times how exhausted people are when they come back from their vacation and feel like they ‘need a vacation from their vacation,’ and that’s because many times we pack so much into a very short amount of time,” said travel blogger Esther Susag. “We want to see everything, do everything, and not waste a minute.” There is, however, another approach to globetrotting that many seasoned tourists recommend: slow travel. But what exactly is slow travel, and how do you take full advantage of this kind of trip? Below, travel experts break it down. “Slow travel is about quality over quantity,” said Phil Dengler, a co-founder of travel information site The Vacationer. “It is also about immersing yourself in the local culture. Traditional vacations often involve seeing as many things as possible in a short time. While there is nothing wrong with that, it can feel very superficial. It can also feel overwhelming and not like the ideal relaxing vacation.” As the name suggests, slow travel generally entails slowing down and savoring each moment, rather than rushing to check off bucket list items. “Slow travel may mean different things to different travelers, but I define it as staying in one place for longer and going deeper into the local culture,” said Paul Jacobs, general manager and vice president of Kayak North America. “It’s taking the time to make real connections with locals versus jam-packing a schedule full of tours. It’s staying in Kyoto at a Ryokan instead of city hopping throughout Asia.” He believes slow travel is becoming increasingly popular and pointed to data that shows the length of hotel stays is already up 10% in 2023 compared to last year. Still, slow travel doesn’t necessarily require long stays in one place. “For me, slow traveling isn’t necessarily about the number of days you are spending in a place,” said travel blogger Sean Lau. “You can slow travel with just a few days or with a few months ― it all depends on the level of connection you would like with your destination, allowing you to gain a deeper appreciation of the culture and understand the local environment better.” For travel expert and author La Carmina, slow travel is a meditative approach to traveling that allows people to stop and smell the roses ― quite literally. “It’s about being fully present in the moment and experiencing the sights, sounds and sensations around you without distraction ― letting the experience unfold at its own pace and without expectations,” she said. “To me, slow travel doesn’t have a strict definition or certain mandatory elements, such as using slower modes of transport or sticking to a single city or country for a certain amount of time, but rather is about the compassionate awareness one brings to being a visitor in a destination.” “When you travel at a slower pace and not so rushed, you naturally immerse yourself in the culture and place that you’re in and really try to get to know it on a more personal level,” Susag said. “You talk with more locals and do more ‘off the beaten path’ activities, and not just things you see on Trip Advisor,” she added. “Also, when you do start to talk with the locals more, usually they want you to have the best experience and will show you some of their favorite spots which naturally leads to a more immersive and personal experience.” Getting to know locals and their culture and lifestyle more intimately and authentically will create rewarding experiences and memories you can carry with you long after your return home. You may even make deep connections and friendships that lead you to return in the future. “If you want to really unplug and relax without the stresses of traveling then slow travel may be for you,” said Mark Wolters, the creator of the popular YouTube travel channel Wolters World. “You get to unpack your suitcases less, take fewer planes, trains and automobiles and just relax in a destination.” He noted that slow travel is excellent for practicing foreign language skills, as there are more opportunities for meaningful conversations with locals. “If you are traveling with children, slow travel is a good way to introduce them to international travel and getting them to see the differences in cultures,” Wolters noted. “When your kids are playing at the local playground with other children they see that there are not too many differences between themselves and the kids in this new country you are visiting.” He said his children have also learned how to make pupusas in El Salvador, pasta in Italy, and sandwiches in Portugal because the family likes to return to the same eateries and make connections with the people working there. “There is nothing like going back to the same restaurant a few times and the waiters and owners start to see you as a friend instead of a tourist looking for a quick bite to eat,” Wolters said. “Slow travel also gives your family a chance to focus on spending time together doing tourist activities, but also just being together as a family instead of just trying to get in as many museums as possible.” There are practical upsides to this approach to travel as well. “I love slow traveling for its environmental benefits,” Lau said. “By staying in one location for longer periods of time, there are fewer carbon emissions associated with transportation such as flights and buses.” In addition to less transit between destinations, slow travel also tends to entail fewer car rides within a single destination due to fewer activities. Travelers can also feel less rushed in getting one place to another and take public transit instead. You may opt to stay away from the touristy city center and save money on accommodations as well. “Slow travel is often more cost-effective than traditional travel since you are not doing as many things as possible,” Dengler said. “It is also more relaxing since you are not always worrying about the next item on your itinerary.” There’s no one right way to engage in slow travel, but there are some helpful factors to keep in mind if you want to maximize the experience. “Your to-do list should be very short or nonexistent,” Dengler said. “Either come with a plan to spend most of your time at only a few locations or take recommendations from locals on the fly. When visiting a spot or destination, you should aim to understand its meaning as opposed to just checking it off your list. In most cases, you will have to spend more time than usual, but you should come away with a much deeper understanding.” Resist the temptation to see every sight and eat every dish in one or two days. It’s not about rushing around to check off the boxes of attractions. “Spread out your tourist visits over a longer period of time,” Wolters said. “This way you can spend your morning at a café, then midday at a museum, then the afternoon and early evening at a park reading your favorite book, instead of seeing two museums in the morning and one in the afternoon and then a theater show at night with a ghost tour at midnight.” His family frequently tries to take local cultural classes, like a painting or cooking class. In addition to learning more about the art or cuisine, you can ask the instructor additional questions and learn more about the area. “In the era of remote work, it’s become easier to engage in slow travel,” noted Jessica van Dop DeJesus, the founder and editor of food and travel blog The Dining Traveler. “For example, spending more than a week in a destination and taking the time to walk around lesser-known neighborhoods, frequenting a cafe or restaurant several times, and attending a sporting or cultural event that’s important to those living in that location.” Consider staying in an independent boutique hotel or vacation rental away from the typical touristy spots to get a sense of where locals live. Take advantage of the quiet and relaxation you can’t find in the typical crowded areas as well. “One of my favorite ways to experience slow travel is by renting a villa by the beach,” La Carmina said, recalling a recent trip to Tulum. “Rather than being in a busy and commercial resort, I enjoyed peaceful days with only the sounds of the ocean near my doorstep. I had a fully stocked kitchen, so I could simply relax in my warm surroundings without feeling pressure to go out or sightsee. Some days were spent lounging in the modern villa’s pool, or meandering to the nearby beach.” If you’re staying in a destination that lacks strong public transit infrastructure or you simply want to explore a little farther afield, renting a car can offer the opportunity to move at your own pace. “Pull over and enjoy the scenic overlooks and don’t be afraid to take detours and stray off the beaten path when traveling,” said David Woody, country development and travel expert at SIXT. You may even plan a leisurely paced road trip as a form of slow travel. “Many travelers are now choosing to drive to destinations instead of flying as part of the slower travel movement, which offers them more flexibility to enjoy the journey as well as the destination,” Woody said. “We recommend mapping out your route and the legs you want to drive per day but only book the first two or three nights of accommodation to remain flexible should your route or timing change.” By entering your email and clicking Sign Up, you're agreeing to let us send you customized marketing messages about us and our advertising partners. You are also agreeing to our Terms of Service and Privacy Policy.",
    "sentiment_val": 0.1954,
    "sentiment_sd": 0.3011,
    "month": "2023-02",
    "data$month": "2023-02"
  },
  {
    "url": "https://www.huffpost.com/entry/people-are-sharing-jobs-that-are-unnecessary-and-overpaid_n_63fe523ee4b0ec6a5a1a3d87",
    "published_date": "2023-02-28T17:31:13Z",
    "author": "HuffPost Video",
    "title": "People Are Sharing Jobs That Are Unnecessary And Overpaid",
    "text": "Microbio",
    "month": "2023-02",
    "data$month": "2023-02"
  },
  {
    "url": "https://www.huffpost.com/entry/polly-irungu-culture-shifters-2023_n_63d9682ee4b01e92886d8cf3",
    "published_date": "2023-02-23T17:19:35Z",
    "title": "How Polly Irungu Created Space For Black Women Photographers | HuffPost Entertainment",
    "text": "Feb. 23, 2023  To read about the other Culture Shifters, return to the list here.  It all started with a Twitter list and a love for photography. Polly Irungu, a 28-year-old photographer and photo editor, had noticed a need for community among other Black women trying to find their way in the publishing industry. And she wanted to get them hired. In July 2020, Irungu launched Black Women Photographers, an online directory of about 100 Black female photographers, compiled from a Twitter list she started building years before while she was a student at the University of Oregon. Irungu was tired of hearing excuses from editors and brands who often claimed they couldn’t find new or established photographers from diverse backgrounds to hire because they didn’t know where to look. “My goal at the time was really to just have a one-stop shop for people to find us and hire us,” she said. “And then, how can I also just find community? I was just feeling very lonely, and the craft is already so isolating because it’s just an independent job.” Journalists from marginalized groups have long spoken out against the lack of diversity in the industry. A Pew Research Center survey of 12,000 journalists found that most say their newsrooms do not have enough racial diversity. Conversations about media diversity were at a fever pitch after the murder of George Floyd in 2020. Irungu stepped up to provide one part of a solution. “There’s just too many organizations out there now, including my own, doing the work to help diversify and bring equity in this industry,” Irungu said. “There’s no legitimate excuse that I can think of that an editor or organization, a brand, whatever, would have to not have a diverse Rolodex of creatives that they can turn to. There’s no reason.” Today, Black Women Photographers — a global community and database of Black women and nonbinary photographers — has grown to over 1,500 members in over 60 countries. Black Women Photographers offers free educational workshops, photo events, in-person and virtual meetups, and portfolio reviews with editors at established news organizations. In 2020, Irungu started a COVID relief fund for the organization, which raised $14,000 to help photographers out of work because of the pandemic. In just over two years, Black Women Photographers has been able to give over $150,000 in grants. The group has also partnered with organizations, such as Live Nation Urban, to help more Black female photographers get hired for music events. “All these brands, all these people, all these editors, all these organizations have taken notice and really have been able to change many, many lives, including my own,” she said. The organization’s work has impacted many photographers’ careers and skills already: A photographer in London got an opportunity to go to Copenhagen to talk about her work on a major photo editing brand; a Chicago photographer couldn’t take on a gig, so she passed it along to another photographer in the organization; a grad student got an assignment after a portfolio review with The New York Times; another London photographer shared a progress report of sorts with the group, documenting how much her technique, lighting and composition had improved over six years. “Those are the kind of things that really just bring me chills because, again, all of this has just been something that I just did on a whim,” Irungu said. Irungu is a self-taught, D.C.-based photographer born in Nairobi, Kenya. Growing up, she moved around because of her father’s work, living in Topeka, Kansas, and Little Rock, Arkansas. In high school, she worked at McDonald’s to save money for a camera and a laptop. Her brother was her go-to model, and they spent many weekends practicing photography in different lighting with different techniques. In addition, she photographed concerts and sports games to challenge her skills and get dynamic photos of performers and athletes in action. In her senior year, she got her first big break to assist a friend’s cousin at the Grammys. Her mom thought of her photography as a hobby, so she didn’t take the gig seriously. That moment was a big turning point; Irungu remembers the photos not being great, but the experience convinced her to take her skills seriously. That attitude helped her mother get on board, too. Irungu is inspired by her mom, the eldest of 12 siblings, and then two photographers: award-winning Nigerian photographer Lola Akinmade Åkerström, an author with a photography and storytelling academy. Then there’s Audrey Woulard, a Nikon ambassador based in Chicago who specializes in children’s portraiture. Of course, she’s also inspired by the work of her peers and her organization’s members. We talked at length about one of the best photos of 2022: Supreme Court Justice Ketanji Brown Jackson with her daughter Leila at her confirmation hearing. The photo was captured by Sarahbeth Maney, a photography fellow at The New York Times; that angle and that approach of a Black daughter admiring her mother was powerful beyond measure. “Seeing that photo and the pride in the daughter’s face and just the pride that I had knowing it was done by a Black woman,” she said. “That’s a photo that I know for a fact will be in historical books and seen for generations to come. Whether Sarahbeth realizes it or not, she inspired so many to tell those stories that are right in front of them, whether they’re historical moments or not.” Irungu has also taken on assignments to document moments in history. One of Irungu’s last assignments was for the 100th anniversary of the Tulsa Race Massacre. She shot descendants of the massacre — and relied on her top rules she follows in her work: listen first, respect your subjects and photograph them “in their truest light.” “I think being able to move across America a couple of times has allowed me to be able to — within my work as a journalist or within my work as a photographer — be able to actually get to understand people and talk to people and lead with more empathy,” she said. “I never want to overstep or cause harm with anything that I do.” Since the organization’s inception, Irungu’s work with Black Women Photographers has always been more of a passion project. She’s worked full-time throughout the organization’s growth: as a photo editor for WeTransfer and a social media editor at WNYC’s The Takeaway. In July, she was tapped as a photo editor for the White House, processing, editing and captioning images for the office of the vice presidency. “Learning from a true veteran in the game has really just been an eye-opening and just an amazing experience,” Irungu said of Lawrence Jackson, the official White House photographer for Vice President Kamala Harris. “It’s really just been a blessing to be here and really learn from one of the best there is.” Irungu has a couple of volunteers who help her run the site and schedule events, but she’s mostly a one-woman show behind the scenes. As a result, she hasn’t had much time to devote to leisure shoots (though the weekend after our interview, she had a very special shoot scheduled: Her mom requested a photo shoot for her 60th birthday). Now, Irungu and the organization are hosting more events in person. Last year, Black Women Photographers held its first exhibition in New York in partnership with Hi-Arts, a nonprofit for artists. Since then, the members curated their own exhibition in Los Angeles called “Our Black Experience: Stories From Black Women Photographers.” In February, the exhibit launched in New York City at Galerie Kitsuné, featuring New York-based photographers. “For a lot of photographers, being shown in a gallery or an exhibition is a rarity. Having your work live beyond a social media platform is hopefully the goal,” she said. “Seeing it on a wall, seeing it in somebody else’s home, seeing it wherever is just a beautiful feeling and really, I feel like it gives someone a good confidence boost and can very well be a catalyst, a drive, a turning point for somebody’s career as well. That’s what I hope these exhibitions can be for the photographers.” Irungu hopes the organization will keep expanding, with more brands hiring and collaborating with the photographers in the database. She isn’t done helping others and is hoping to keep building community within the organization. “For me, it’s always just being able to pass down what I know and really just inspire somebody along the way,” she said, “because I was taught and inspired by somebody else.”",
    "sentiment_val": 0.2306,
    "sentiment_sd": 0.2479,
    "month": "2023-02",
    "data$month": "2023-02"
  },
  {
    "url": "https://www.huffpost.com/entry/the-last-of-us-behind-the-scenes-facts-straight-from-the-co-creator_n_63ee7f00e4b0e909c43b1ee4",
    "published_date": "2023-02-16T18:48:58Z",
    "author": "HuffPost Video",
    "title": "‘The Last Of Us’ Behind-The-Scenes Facts Straight From The Co-Creator",
    "text": "HuffPost Video",
    "month": "2023-02",
    "data$month": "2023-02"
  },
  {
    "url": "https://www.huffpost.com/entry/black-midwives-pregnancy-care_l_63ce9922e4b0c8e3fc78c4df",
    "published_date": "2023-02-23T21:08:52Z",
    "author": "Marie Holmes",
    "title": "Black Midwives Are Pillars Of Pregnancy Care. Here’s What We Can Learn From Them.",
    "text": "In 1930, there were about 5,000 midwives in Mississippi alone, many of them Black. These lay or “Granny” midwives learned their trade through apprenticeship and served as pillars of their communities — a history that went mostly undocumented. But in 1951, a Life magazine photo essay chronicling the work of midwife Maude Callen and “All My Babies,” a 1953 documentary training film funded by the Georgia Department of Public Health starring midwife Mary Coley, have preserved moving images of the way these midwives tirelessly cared for mothers and families living in abject poverty. While they earned the respect of their communities and occasionally the public at large, midwives were simultaneously blamed for high infant and maternal mortality rates and tasked with reversing those trends. Unlike in other parts of the world, lay midwives in the U.S. never gained the respect or support of the (white) medical establishment. The training of midwives eventually moved into nursing schools that excluded Black women, becoming an almost exclusively white profession. Then births moved into hospitals and became almost exclusively the realm of white medical doctors. In its 2020 demographic report, the American Midwifery Certification reported 12,990 midwives in the country. Of these, only 890 were Black. (Note: These numbers account for registered certified nurse midwives (CNMs) and certified midwives (CMs) but do not include certified professional midwives (CPMs) or lay midwives. Here is an explanation of the differences.) While medical advances, including ways to treat infection and hemorrhage, did bring down maternal and infant mortality rates from their high early 20th-century numbers, this trend has begun to reverse — and racial disparities in these numbers endure. The U.S. has the distinction of being the only developed country with a rising maternal mortality rate. We report double maternal deaths as other high-income countries, and the CDC has found that almost two-thirds of these deaths are preventable. In addition, Black mothers are three to four times more likely to die than white ones. Black babies also fare much worse. Recent data from California show grimly tiered levels of risk by race and income. The babies of the lowest-income Black families were almost four times as likely to die as those from the wealthiest white families. Wealth alone did not negate the impact of race, with the babies of the lowest-income white families more likely to survive than those of the richest Black families. The causes of these rates and disparities are difficult to untangle. Still, we know that countries with lower C-section rates and higher numbers of midwives have much lower maternal and infant mortality rates. Black women, including tennis champion Serena Williams, report that doctors dismiss their medical concerns during and after childbirth. The families of women who died following childbirth profiled in the film “Aftershock” similarly tell stories of doctors brushing off their pain and other symptoms in the days and hours preceding their deaths. Black midwives are uniquely situated to see both the scope of this problem and some ways we might begin to solve it. HuffPost talked to six Black midwives to gather some of their insight. Responses have been lightly edited for clarity and length. “Prior to becoming a midwife, I worked as a nurse. First, I worked in medical-surgical nursing. I stayed there for three years. I knew in my heart that’s not what I wanted to do. I then moved on and worked at another hospital as a labor and delivery nurse, and I became a certified childbirth educator. I used to call myself a professional labor support person — the word doula is newer. Seeing what was happening in all the hospitals and other places I saw doing this labor support, I realized, I think I could make a better difference if I actually was the midwife. I could call the shots and protect people’s space. That’s when I decided to go back to school to become a midwife. I graduated, and I worked in an inner-city hospital, I worked at the freestanding birth center, and then I started my home birth practice and did that for 17 years. The first birth I attended as a home birth midwife was in Brooklyn. It was a religious Jewish family. My business partner Karen was the primary midwife for that first birth. It was just the woman and her husband in this little apartment. He was praying in one room, she was doing her thing in the other room. He was explaining all things Jewish religion to me. It was just wonderful — that feeling of there’s something really special, magical, knowing that you’re a participant in something so important. The world is going on about you, you hear the sounds in the street, everything going on like it’s a normal day when it’s like, ‘There’s a baby being born!’ Then the peaceful quietness when you finish, and you leave their home, and mom and baby are doing great, you know, everyone’s happy and tired, and you leave the home to get into your car. That feeling, I can’t even describe it. It’s a lot of work — a lot of responsibility. You really have to build rapport with people and know how to reach out. Then they have that safety, and it’s just a real sacred space. I said to my clients, ‘I’m your midwife for life,’ and they really take that literally. People still call me with different things.” “Even as a little girl, I knew I wanted to be in birth work. I was in Memphis when I became a nurse, and then I started doing some traveling nursing because I wanted to see what birth is like all over the country. That landed me in Atlanta, and that’s when I worked with my first midwife. It was the first time I had come in contact with modern-day nurse midwives. And I was like, ‘Oh, my goodness, I need I need to go back and do the midwife route. This is what I really want to do.’ I went to Emory to do the midwifery program, then worked as a midwife in Atlanta. I went back and got my Ph.D. because I wanted to be able to take care of more than one woman at a time. There’s so many layers of access to care and health disparities. And I wanted to be able to have a larger voice in that conversation. Every birth is special. I haven’t had a birth yet where I don’t get chills. But there’s certain births that stand out. One of them is with a patient named Erin. She had a high-risk complication called an amniotic fluid embolism. It’s a really rare complication that is often fatal. Our bond during her labor experience was so special because it was her second baby, I was pregnant with my second, and the nurse was pregnant with her second. We were calling ourselves the ‘Three Amigos’ — not knowing that potential tragedy was gonna strike. We had to move really fast. I remember running down the hallway, pregnant, and watching as they rolled her in. She had her C-section, and we didn’t know if she was gonna survive. I remember having a conversation with her husband and her family — the baby was in the ICU — just praying with them. I went back to the hospital a few days after that. I locked eyes with Erin, and we just held each other and cried. A year later, they invited me to come to their daughter’s first birthday. Every year they send me a picture of her as she grows. Another mom, Vernette, she was actually a colleague who worked in the birth center. She wanted me and other Black midwives to be with her at her birth. She wanted that kind of cultural space. She’d lost her mother, and she’d lost an aunt figure, and she wanted that kind of maternal energy. We reached a moment in her birth where we could tell, us midwives, that she was blocking it. We could just tell there was a fear there that she wouldn’t let go. One of the midwives is Nigerian and had a lot of midwives in her family. She started singing to her in her native Nigerian tongue. We didn’t know what she was saying at the time. She explained it to us later. The song basically talks about a woman getting ready to walk into a forest, symbolizing her journey of birth. The way she was singing it — I just remember my hair standing up. We knew something was happening. Whatever she’s saying, my energy is moving. So I’m holding Vernette. She’s holding the other hand, the third midwife, and we’re just swaying with each other. She finished singing, and that baby was born maybe 15 minutes afterward. It was like we channeled our ancestry. It was transformative. I delivered the baby, but we’re all his aunties because we were all there. It embodies that spirit of midwifery that I think is missing in our medical model and in our health system. For Black and brown mothers who I think have tons of fear around childbirth, I want them to know you can still have a healthy, normal birth. Not to say that the risks aren’t there, but don’t let the fear paralyze you or rob you of what is intended to be a joyful experience.” “I have a master’s in anthropology, and a master’s in public health. I wanted to work on interventions and population health stuff. I was working on a project with the March of Dimes and evaluating the program they had — at the time, Memphis had the highest infant mortality rate in the country. In evaluating that program, I talked to families who had experienced infant loss. They were young families, but a lot of the families that I interviewed had generational losses. I didn’t understand why. The older Black women I interviewed in the community talked about these midwives. And I was like, what are you talking about? We don’t have any midwives in the community now. So I started doing a lot of research about midwifery and Black midwifery specifically. I realized they were run out by politics and policy, and racism. I wanted to see a reclamation and restoration of Black midwifery in our community. So that’s what made me decide to go back to school to become a nurse and then a midwife. The first birth I attended as a midwife was a home birth. The mom — who is actually now a friend — was very trusting. She was well-informed and had lots of questions, and was very, very much an active participant in her care. She was very intentional about wanting to have a certain type of experience. She got to move around and be in her home, and we set up a pool for her to have hydrotherapy. And when she felt like she had reached a point where she couldn’t do it anymore, I read to her. I read affirmations that she had written and that she had been reading to herself throughout her pregnancy. It was a really beautiful experience. Each birth is unique. The families bring different perspectives and different experiences to the births, but all of them have been very, very sacred, and I feel honored to witness these births and to be with these families, that they trust me enough to be with them. I remember all of them, and I remember all the babies and the birth dates. I’m maybe up to 200 now. I remember each experience, I remember the mothers. They get to that point where they feel like, ‘Oh, gosh, I can’t do this.’ Then afterward, they’re so proud of themselves for what they’ve accomplished, and it’s really empowering to see these pregnant people standing in their own power. I think the way our medical establishment is set up, it’s not for pregnant people to ask questions and learn and be an active participant in their care. I wish that people had those opportunities because it’s truly transformative. This is a system that is deeply rooted in racism and disregard for the humanity of certain people, and I think that at this point, we have to create new systems and be disruptors to that old system. I knew that the care would be transformative to patients personally, but what we’re seeing now is that it’s actually transforming them professionally as well. We have a lot of patients that are now going back to school to be midwives and to be doulas. They’ve been inspired, and honestly, they’re inspiring to me.” “I worked in Alzheimer’s care for a while and then became a doula, that’s when my heart and ears were really opened to midwifery. I was partnering with people who were birthing in hospitals, most often Black women, but people from many different backgrounds, and I got to a point where I felt like I could no longer continue to see what I was seeing. There was a barrier because doulas have a certain scope of practice, doctors have a certain scope of practice, and I felt like my doula scope of practice was limiting. I had my own child, and then told my story and eventually became a researcher for a grassroots organization called Black Women Birthing Justice. At that point, I knew I wanted to become a midwife. There are many different ways of becoming a midwife, and I chose nurse-midwifery because I wanted to be able to move in all the spaces that people can give birth in. I want to show up for people who are historically and presently marginalized. Black women and birthing people, people who are indigenous to this country, people who have been pushed to the margins because of substance use — they are most often birthing in a hospital. What I was seeing in the hospital in my doula role is that people’s voices were not being heard. I felt like people had given over their power to the hospital system, maybe because they felt like the doctors or the nurses knew more. And I felt like sometimes people who had really strong views about what they wanted were also not being listened to. I wouldn’t say that there was negligence, but in terms of interpersonal communication, there were some experiences where I feel like patients would walk away feeling like it was traumatizing. So I came to midwifery from more of the deficit side versus the asset side, which is what I try to focus on now — what helps someone be well and whole and healthy. There’s a saying that when birth happens, there are two people being born. It’s a little baby, but then it’s also this person who’s giving birth and who is undeniably going to learn something new about themselves after this experience. So I love being a witness to birth. I love seeing people’s power and people realizing their own power. I wish people knew that they can keep their power. They have a voice, they can keep their autonomy. It’s OK to express your needs. It’s OK to ask questions. It’s OK to ask questions multiple times. I wish more people recognized that labor, pregnancy and birth are normal, physiological processes. They’re not disabilities, it’s not always complex.” “When I graduated high school, I knew I wanted to go into healthcare, but I didn’t know exactly what I wanted to do. I went into the military, and I was a corpsman. I also served as a technician and EMT in the Coast Guard, so I got a lot of healthcare experience. I also got experience in a primary care setting, and that’s where I really realized I like working with women. Working in the maternity space, you get to spend a lot of time with a single person. You’re in a relationship with them over the course of a year that makes a big impact in their life. I thought I wanted to be an OB-GYN. I thought I wanted to do surgery and things like that, but what I really wanted was to have a lot of knowledge and skills in a natural, normal, healthy birth. Along the way, I realized that’s not the way obstetrics and gynecology is going. It’s much more geared towards cesarean sections, limiting risk and limiting the options in order to limit risk. I thought, well, that’s not really what I want to do. I ended up getting pregnant and having my own daughter while living here in Puerto Rico. My second daughter was born in Guam with midwives, and it was then I felt called to midwifery. With my own births, I realized birth can be an enjoyable thing that you experience that flows from whatever you were doing before into the next phase of life. You can go into labor in your home and feel relaxed, you can communicate with the person who’s supporting you in your care from your home. You don’t have to ever switch to, ‘Now I’m in the labor role, and I need to put on this special outfit and have all of these tests done on me, and people need to poke and prod me.’ It doesn’t have to be like that. It can happen on your timing. There’s this idea that midwives are archaic. We all know that’s not true. The countries with the best maternal and neonatal outcomes have integrated midwives into their modern health care system. Midwives are the primary care providers for people who are pregnant. These are the countries with the best outcomes. Maternal mortality rates are going down in those countries. The C-section rates are going up here; in Puerto Rico, we have a 48% C-section rate — and I would guarantee that that is underreported. There are hospitals here with rates of 60%. And they’re limiting access to very skilled providers who could provide low-risk, low-intervention care: midwives. I’ve realized the best situation for attending births here will be for midwives to have reliable hospital support and backup. If we don’t have that, then it’s hard for me to feel comfortable continuing to attend births in people’s homes.” “I didn’t know that midwifery was still a thing, that there was a modernized version. I went to nursing school at Georgetown University. My plan was to work as a nurse, go back to school to finish the pre-med requirements, and then go to medical school. All my life, I knew I wanted to be in the field of mothers and babies. Then working in nursing at a hospital facility, I came to a deep understanding that I didn’t agree with a lot of the things that I was seeing. It just became crystal clear that I was supposed to be on this other path, and that’s when I started looking at midwifery schools. As long as mommy and baby are good, we can rock with it. That’s the beauty of the type of midwifery we practice here at Woodhull Hospital. If you come in and you’re doing it all on your own, we’re going to support you. If you have a comorbidity like high blood pressure, or diabetes, or any other issues, we have our docs on call to manage that part, but we still hold the normal for the birth. High-risk pregnancy does not mean your birth should be a circus. I’m very proud that I can take care of a birthing person who’s ‘normal,’ and I can take care of everybody else, too, with my physician colleagues. The model we have here is very much like the model all over Europe. Midwifery sits in the center, especially when it is an integrative model that practices side-by-side with physicians. We are like protectresses of the space. When you need your magnesium sulfate because you have high blood pressure, and you need your insulin for your diabetes, and you need your heparin because you had a previous history of a DVT — our physicians, they got you. When you’re in labor, they’re not going to do anything extra to you. They step back, and they let us take care of that because that is our expertise and specialty. At the end of the day, OB-GYNs are surgeons. They’re trained to cut, and they’re trained to manipulate. It’s not their fault. This is just American medicine. This is the technocratic, patriarchal model of medicine. There are times things absolutely need to be manipulated. But there are a hell of a lot of times they don’t. We’ve lost that wisdom of knowing when not to act. Having a midwife means you can have whatever you want. If you want to get up and walk around your room, go to the bathroom, stand up in your bed, squat, have IV pain medication (if baby’s heartbeat is good), have an epidural, all of the above: it’s fine. Midwifery care is about shared decision-making. If you want it, and it’s safe, you’re getting it.” CORRECTION: A prior version of this story misnamed the region in Puerto Rico where Anjelica Malone lives. A transcription error for the medical term “amniotic fluid embolism” has also been corrected.",
    "sentiment_val": 0.1129,
    "sentiment_sd": 0.3119,
    "month": "2023-02",
    "data$month": "2023-02"
  },
  {
    "url": "https://www.huffpost.com/entry/trumps-h20-grift_n_63f7b1bce4b04ff5b488c103",
    "published_date": "2023-02-23T18:05:46Z",
    "author": "HuffPost Video",
    "title": "Trump’s H20 Grift",
    "text": "HuffPost Video",
    "month": "2023-02",
    "data$month": "2023-02"
  }
]
