[
  {
    "url": "https://www.huffpost.com/entry/screenshots-of-roommates-so-terrible-youll-thank-your-lucky-stars-you-live-alone_n_64b1ab26e4b0decb6beee075",
    "published_date": "2023-07-14T18:49:42Z",
    "author": "HuffPost Video",
    "title": "Screenshots Of Roommates So Terrible, You’ll Thank Your Lucky Stars You Live Alone",
    "text": "Microbio",
    "month": "2023-07",
    "data$month": "2023-07"
  },
  {
    "url": "https://www.huffpost.com/entry/iowa-teen-sentenced-for-killing-teacher_n_64a81931e4b0e87d65541d19",
    "published_date": "2023-07-07T13:41:05Z",
    "author": "HuffPost Video",
    "title": "Iowa Teen Sentenced For Killing Teacher",
    "text": "Microbio",
    "month": "2023-07",
    "data$month": "2023-07"
  },
  {
    "url": "https://www.huffpost.com/entry/celebrities-who-had-babies-or-are-pregnant-in-2023-so-far_n_64ac7320e4b0b90e08153de0",
    "published_date": "2023-07-10T20:00:54Z",
    "author": "HuffPost Video",
    "title": "Celebrities Who Had Babies Or Are Pregnant In 2023 (So Far)",
    "text": "HuffPost Video",
    "month": "2023-07",
    "data$month": "2023-07"
  },
  {
    "url": "https://www.huffpost.com/entry/rep-marjorie-taylor-greene-shows-hunter-biden-nudes-during-congressional-hearing_n_64b952a8e4b09a3b4891709b",
    "published_date": "2023-07-20T15:23:13Z",
    "author": "HuffPost Video",
    "title": "Rep. Marjorie Taylor Greene Shows Hunter Biden Nudes During Congressional Hearing",
    "text": "Microbio",
    "month": "2023-07",
    "data$month": "2023-07"
  },
  {
    "url": "https://www.huffpost.com/entry/is-ron-desantis-campaign-in-ruins_n_64c12e9de4b08a8c921272f9",
    "published_date": "2023-07-26T14:27:23Z",
    "author": "HuffPost Video",
    "title": "Is Ron DeSantis’ Campaign In Ruins?",
    "text": "HuffPost Video",
    "month": "2023-07",
    "data$month": "2023-07"
  },
  {
    "url": "https://www.huffpost.com/entry/roller-coaster-crack-report-ignored_n_64a5790be4b0c7e9d8eab800",
    "published_date": "2023-07-05T14:03:19Z",
    "author": "HuffPost Video",
    "title": "Roller Coaster Crack Report Ignored?",
    "text": "HuffPost Video",
    "month": "2023-07",
    "data$month": "2023-07"
  },
  {
    "url": "https://www.huffpost.com/entry/a-trump-indictment-looms_n_64b7f903e4b0ad7b75f6855d",
    "published_date": "2023-07-19T14:40:44Z",
    "author": "HuffPost Video",
    "title": "A Trump Indictment Looms",
    "text": "HuffPost Video",
    "month": "2023-07",
    "data$month": "2023-07"
  },
  {
    "url": "https://www.huffpost.com/entry/why-we-know-so-little-about-the-us-union-busting-industry_n_64c28622e4b03ad2b897077f",
    "published_date": "2023-07-28T13:46:09Z",
    "author": "by Dave Jamieson July 28, 2023",
    "title": "The U.S. ‘Union-Busting’ Industry: Why We Know So Little | HuffPost Impact",
    "text": "by Dave Jamieson July 28, 2023  Every week, U.S. workers sit through mandatory meetings where paid consultants discourage them from unionizing. The consultants are supposed to promptly disclose their names and fees to the federal government so that workers understand who’s lobbying them. But this system aimed at transparency still leaves workers in the dark, a HuffPost series has found.  Many consultants ― known legally as “persuaders” ― file their disclosure forms late, sometimes well after the union election has already ended. Or they provide incomplete information, withholding how much the employer is paying them. And although they’re supposed to make disclosures of their own, some employers fail to reveal how much money they spent countering the union.  Worker advocates find the system deeply frustrating. Just as in political campaigns, they say, employees casting ballots in a union election deserve to know how money is influencing their vote.  “The lack of compliance with the limited [disclosures] that the law does require is just so shameful,” said Celine McNicholas, policy director at the Economic Policy Institute, a left-leaning think tank.  This week, HuffPost published a series of stories about the “union avoidance” consulting industry, based primarily on files obtained from the National Labor Relations Board and the Labor Department through record requests. Documents and interviews show that workers often don’t have a clear picture of whom their employer hired and how much they paid them until the information is no longer useful.  Some consultants take the disclosure requirements seriously and have little to hide. But board files show others are reluctant to share their identities with workers who might research their backgrounds or publicize their high fees to workers. It is common for employers to pay more than $3,000 per day for a single consultant, and some run up tabs in the hundreds of thousands of dollars while workers are asking for modest raises.  Consultants who undermined the union effort at a small Missouri manufacturing company last year used fake names in the course of their work.  Consultants who undermined the union effort at a small Missouri manufacturing company last year used fake names in the course of their work. Their disclosure was filed with the Labor Department after the deadline passed ― and bore one consultant’s pseudonym. During a labor board trial held months later, witnesses still knew the consultants by their fake names.  In the case of a union campaign at a Pennsylvania trucking operation, the consultant refused to disclose his last name to employees when they asked for it, according to documents obtained through a record request. They knew the consultant only as “Jay.”  “He said he was afraid of identity theft,” one worker testified in a labor board hearing.  It turned out the consultant had a website for prospective clients in which he referred to himself as a “union buster.”  Consultants who speak directly to workers about unionization are legally required to disclose their work to the Labor Department within 30 days. But LaborLab, a nonprofit that tracks the labor consulting industry, analyzed disclosure filings in 2021 and 2022 and found that 82% of consultants did not disclose their relationships on time, “giving them an unfair and illegal advantage over workers attempting to form unions.”  More than 40% of those tardy filings were at least three months late, and nearly 30% were more than half a year late.  One prominent anti-union firm, the Labor Pros, frequently files its disclosures after they’re due, according to LaborLab’s analysis. The firm appears to have submitted one of its disclosure forms roughly seven years after consulting for a hotel. The Labor Pros did not respond to a request for comment.  “These forms are absolutely useless if they’re after the date.”  “These forms are absolutely useless if they’re after the date,” said Bob Funk, LaborLab’s director, noting that workers typically vote in an election a few weeks after the employer started its anti-union campaign.  Amazon alone spent more than $14 million on consultants last year in an effort to defeat organizing campaigns in its warehouses, according to the tech giant’s filings with the Labor Department. But getting a handle on all the money flowing through this industry is nearly impossible, due to underreporting by employers and gaps in the transparency law.  Congress implemented the requirements in 1959 as part of a law that addressed union corruption and racketeering. A small agency within the Labor Department called the Office of Labor-Management Standards, or OLMS, is responsible for enforcing financial disclosures on both the union and employer sides.  OLMS acknowledges it may have a shaky handle on anti-union spending. Citing “chronic non-compliance,” the office says there is evidence both employers and consultants often fail to disclose their agreements. Last year, the office instituted a tip line encouraging workers to report employers and consultants who should be divulging their work, because so many appear to be unaware of the law or ignore it.  Jeffrey Freund, the office’s director under President Joe Biden, said it had received 67 tips so far, many of them alleging either consultants or employers hadn’t reported their arrangements. The office was able to follow up and get disclosures in at least 44 cases.  “Employer and persuader reporting is a high priority for this administration, and we are marshaling our enforcement and regulatory tools to improve compliance,” Freund said in a statement.  The disclosures that consultants are supposed to make within 30 days plummeted under President Donald Trump, from 746 in fiscal year 2016 to just 310 in 2020. Although it’s possible consultants were getting less work during that period, it’s likely some ignored their obligations because they expected lax enforcement from a business-friendly White House. The disclosures have rebounded under Biden, back up to 747 last fiscal year. (One consultant told HuffPost he felt pestered by the office lately.)  Freund has also made a small but significant change to employers’ disclosure rules, requiring that they note on their forms whether they are federal contractors. That would signify to workers and the public that a company was receiving federal funds while steering money into an anti-union campaign.  But late filers generally don’t face serious consequences. Freund said it’s rare for anyone ― union or anti-union ― to be prosecuted for violations of the reporting requirements, noting a “high” bar for criminal cases. Case files received as part of a public-records request show the office’s investigators bugging employers repeatedly for their “delinquent” disclosures.  Consultants are also supposed to “explain in detail” their agreements with employers and attach copies of any written contracts. But some leave that section of the form blank, or write something vague and meaningless, like “hourly rate plus expenses.”  “On the union side, you have to account for every dollar you spend,” said Brad Murray, a researcher at the American Federation of Teachers union who started a weekly email on the consultants’ filings, called Union Buster Alerts. “The level of bureaucracy imposed on labor organizations is unlike anything in the nonprofit space. The disparity compared to the union busters is insane.”  Democrats have tried ― and failed ― to strengthen the system. Under President Barack Obama, the Labor Department proposed a new regulation meant to close a major loophole in the law. It would have required employers to report their spending on “indirect” persuasion, like when consultants or lawyers write anti-union scripts for managers or coach supervisors on how to speak to workers. Employers traditionally have not had to disclose such behind-the-scenes work.  The Obama-era “persuader rule,” as it was known, would have created more transparency. But employers blasted the proposal as an attack on attorney-client privilege, saying it would require management-side attorneys to report confidential information to the government.  Michael Wasser, the legislative director at the AFL-CIO’s Department for Professional Employees, recalled a fierce lobbying effort to maintain the status quo.  “When any type of effort is made to require the union busters to provide a similar level of disclosure, they scream to the heavens that they shouldn’t have to do it.”  “When any type of effort is made to require the union busters to provide a similar level of disclosure [as unions], they scream to the heavens that they shouldn’t have to do it,” Wasser said. “They did not want to have to give any sense of transparency.”  Business groups sued to stop the rule, and a federal judge in Texas blocked it from taking effect. Trump rescinded it in 2018.  Anti-union spending has become even less transparent since the rule’s failure. For years, labor consultants have had to file an annual report that includes an accounting of their receipts from employers the previous year. But in 2016, the Labor Department said it would not enforce the requirement that consultants detail their receipts. As a result, many consultants have chosen not to list them.  LaborLab’s Funk said he remains baffled as to why regulators haven’t changed the policy. “It’s very frustrating,” he said.  Democrats have proposed stronger regulations as part of a sweeping overhaul of labor law, known as the Protecting the Right to Organize, or PRO, Act. The legislation would not only require more disclosures on anti-union spending, but also bar employers from holding mandatory “captive audience” meetings where managers and consultants discourage them from unionizing, among other measures.  Biden, who has fashioned himself the “most pro-union” president in history, has called for Congress to pass the bill. However, the legislation hasn’t garnered enough support in the Democratic-controlled Senate, and stands virtually no chance of becoming law while Republicans control the House. So it’s unlikely the disclosure rules will change anytime soon.  McNicholas, of the Economic Policy Institute, noted that large companies like Amazon have gotten attention for their big anti-union expenditures, but many smaller firms still spend “$200,000 as a matter of course.” She believes most people aren’t aware of the resources corporations pump into these campaigns.  “If there were greater transparency,” she said, “there would be greater outrage at how employers respond to union organizing.” Big money interests are running the government — and influencing the news you read. While other outlets are retreating behind paywalls and bending the knee to political pressure, HuffPost is proud to be unbought and unfiltered. Will you help us keep it that way? You can even access our stories ad-free. You've supported HuffPost before, and we'll be honest — we could use your help again. We won't back down from our mission of providing free, fair news during this critical moment. But we can't do it without you. For the first time, we're offering an ad-free experience to qualifying contributors who support our fearless journalism. We hope you'll join us. You've supported HuffPost before, and we'll be honest — we could use your help again. We won't back down from our mission of providing free, fair news during this critical moment. But we can't do it without you. For the first time, we're offering an ad-free experience to qualifying contributors who support our fearless journalism. We hope you'll join us. Already contributed? Log in to hide these messages.",
    "sentiment_val": -0.0619,
    "sentiment_sd": 0.3068,
    "month": "2023-07",
    "data$month": "2023-07"
  }
]
