[
  {
    "url": "https://www.huffpost.com/entry/lessons-from-tech-ceo-sheila-lirio-marcelo_n_6638f056e4b0f72991a70153",
    "published_date": "2024-05-07T15:00:26Z",
    "author": "Sheila Lirio Marcelo",
    "title": "3 Lessons That Elevated Me As A Woman CEO In Tech",
    "text": "Back in 2014, I stood proudly on the New York Stock Exchange podium with my Care.com colleagues, making history as the seventh female founder to take her company public. It was a high point in my career after years of perseverance. Being a woman of color, an immigrant, and eventually a female founder primarily focused on serving women, I faced expectations and stereotypes at every turn. Here are three key pieces of advice that I learned along the way. We encounter our first gender-based stereotypes early in our lives. Growing up in the Philippines in the ’70s and ’80s, I often fell short of the expectation that girls should be passive, pleasing and perfect. (I call these the three P’s that plague me and so many Asian women into adulthood.) My parents also had plans for me and my five siblings: Each of us had a designated profession. Imagine my parents’ surprise when I got pregnant in 1991 after my sophomore year at Mount Holyoke — a major detour on the road to becoming the lawyer they wanted. But even though I seemed to have a knack for flouting expectations, I still cared deeply about what others thought of me. I became determined to succeed even as I juggled my new role as a young wife and mother and completed not only my BA but also my JD/MBA. As I began my career, I often lied by omission about my family in job interviews so no one could question my dedication. I couldn’t hide the fact that I was a woman of color, but I could hide the fact that I was a mom. I didn’t want to be underestimated and dismissed. I was determined to look and act the part of a young, hungry go-getter whose only focus was to win. Soon, I realized that what I felt were my vulnerabilities were actually my superpowers. I used my intuition and experiences as a woman and mother to create Care.com. When I got to where I needed to be, I prioritized creating a work environment where no one felt the need to lie by omission about their families as I had done, a place where everyone could bring their whole self to work. By the early 2000s, I was a young VP on the management team at UPromise—a consumer rewards program that helped families save for college. Ryan, my first child, was now a teenager. This was a rocky time in my life. I built up very high expectations for everyone — my team at work and my family at home. At times, I treated them similarly to how my parents treated me. And when they didn’t meet those expectations, I struggled. I had given Ryan little choice in his designated hobbies. He’s Asian, so of course he had to play a stringed instrument, and because he’s Filipino, he had to play basketball. He hated me for being such a tiger mom. And I wasn’t faring much better with my team at work. I had gotten through my graduate degrees at Harvard with determination and frequent all-nighters, and I expected my colleagues to demonstrate the same tenacity. When they fell short, I reacted impatiently and without empathy. I thought that’s what respected leaders did. One day, after losing it in a meeting where I discovered my team had missed a deadline, a few colleagues sat me down and told me something that has become a mantra I repeat to this day: Be intense with outcomes, but be chill with people. And I followed through (adjusting my parenting style for my second son, Adam, after the lessons of raising Ryan). It was at this point in my life that I realized that the quality of my relationships is more important than how others see me. I realized that everyone around me has value beyond my expectations of them. My husband, my kids, my team, everyone is the sum of their individual experiences and interests and strengths. I had been so worried about achieving what was expected of me that I was turning around and putting unrealistic expectations on others. I had been so worried about being underestimated that I was underestimating those around me. I had been dragging everyone into playing the game with me, but at what cost? Later, as I was assembling an amazing team to help me build Care.com, I tried to remember the lessons I learned at my previous role. Though there were challenges along the way, we built an incredible culture where teams enjoyed working together as we focused on helping millions of people. While I was working at UPromise, my father had a heart attack, collapsing as he was holding baby Adam. Now I was not only juggling work and family but was also sandwiched between caring for young children and an aging parent. Compartmentalizing my role as an executive from my role as a mother and caregiver became impossible. This is what inspired the idea for Care.com, which would go on to become the world’s largest online marketplace for caregivers. But I was still concerned about what others would think of me if I started a business that appeared to only focus on serving women and moms. In the male-dominated world of tech startups, what could be less sexy than caregiving? Would I be taken seriously? Would I get a fair valuation for myself or my company? Ultimately, I wanted to build a product that people needed — something that would address a real pain point for myself and so many others. I wanted to help families, to put my identity as a woman and mom and caregiver on display for all, and ignore the expectations of the tech world. And so, we helped millions of families around the world find caregivers and helped millions of caregivers find jobs. I became an advocate for caregiving as an economic imperative that enables female entrepreneurship. It was not easy. I was doubly underestimated. Male investors often lack proximity to the problems women face and don’t fully appreciate the economic value of female-focused businesses. But again, I tried to worry less about how others valued me and more about how I valued others. I channeled my energy and experience into both pursuing a mission I loved and building a company on my own terms with compassion and empathy. At the party after I rang the bell at the New York Stock Exchange, Ryan, who was by this time 21 years old, surprised me with a toast where he said that I had been a great mom. In front of our bankers, accountants and colleagues, I shed tears of pride, unafraid to show my vulnerability. I’m so proud of what we achieved at Care.com, but there’s still unfinished business: to advance female founders, to solve the cognitive load crisis for families and to take advantage of recent advances in AI. And so I’m at it again with another venture: Ohai.ai, an AI assistant for “chief household officers.” I’m still trying to focus on how I see others and let go of how others see me. I’m still trying to be a good manager and leader.  I’m still trying to help families around the world — but this time with the gift of hindsight. I’m following my heart, putting my full self and all my vulnerabilities out there. And now, playing the game to win looks totally different. By entering your email and clicking Sign Up, you're agreeing to let us send you customized marketing messages about us and our advertising partners. You are also agreeing to our Terms of Service and Privacy Policy.",
    "sentiment_val": 0.113,
    "sentiment_sd": 0.2725,
    "month": "2024-05",
    "data$month": "2024-05"
  }
]
