[
  {
    "url": "https://www.huffpost.com/entry/best-products-to-treat-skin-pigmentation-issues-according-to-dermatologists-ud_l_66d7735ee4b09a3ee66cb74c",
    "published_date": "2024-09-09T09:45:44Z",
    "author": "Julie Kendrick",
    "title": "The Best Products To Treat Skin Pigmentation Issues, According To Dermatologists",
    "text": "The average human has 22 square feet of skin, so it’s understandable that not all that epidermis will be the same color, tone or texture. While it’s perfectly normal to have major variations in your skin, dark spots and discoloration can be challenging to prevent and treat. Why isn’t our skin the same all over? Dermatologists said a number of factors are at play. “Pigmentation is determined by the type and amount of melanin found in our skin,” explained dermatologist Dr. Anetta Reszko. “If you live in areas with stronger or more prevalent sun exposure, you may notice skin darkening and freckling more, depending on your skin type.” There’s the skin you were born with, and then there’s your skin and its changes as you move through the world. “The skin’s pigment-producing cells, called melanocytes, are put in overdrive from sunlight and hormonal changes, which can result in blotchy, discolored skin,” said dermatologist Dr. Antony Nakhla. And the darker your skin tone, the more likely hyperpigmentation may be an issue. “It’s more common in those who produce more melanin, or darker skin types,” said Dr. Purvisha Patel, a dermatologist and Mohs and cosmetic surgeon. One of the biggest culprits in the creation of dark spots is being unprotected from the sun’s rays. “UV radiation from the sun directly stimulates DNA to up-regulate the gene responsible for producing tyrosinase, which is the enzyme involved in melanin synthesis,” explained dermatologist Dr. Rebecca Marcus. “The best way to prevent dark spots is to stay out of the sun, and wear daily sunscreen with SPF 39 or higher. In addition to sunscreen, it’s helpful to wear UV protective clothing, sunglasses and a hat.” And it isn’t just outdoor time that requires caution, she said. “Even visible light, such as indoor lighting, can cause an increase in pigmentation, so it’s important to wear sunscreen every day, even if you don’t spend much time outdoors. Also keep in mind that UV radiation easily penetrates through clouds, glass windows and windshields,” she added. There are many realities of daily life that can cause dark spots and discoloration. Dermatologist Dr. Sonia Badreshia said inflammation from sun, blue light and pollution can contribute to collagen breakdown and weaken the skin’s protective barrier. “The damaged barrier makes the skin more vulnerable to the harmful effects of UV damage, which can lead to dark spots,” she said. “In the case of blue light, the creation of superoxide has been linked to aging and hyperpigmentation, as it stimulates the production of melanin. Inflammation-induced hyperpigmentation can also be caused by heat, hormones, picking at acne and certain medications.” If you’re trying to “scrub away” dark spots, you need to put down the loofah and take a less strenuous approach. “Gentle skin care is a preferable approach to address discoloration on the skin,” said dermatologist Dr. Caroline Robinson. “Being gentle ensures that the skin’s moisture barrier is maintained and reduces the risk of pigmentation triggered by inflammation.” If you’ve been doing at-home mechanical exfoliation — things like salt or sugar scrubs or cleansing wipes formulated with charcoal — you might want to reconsider. “Because mechanical exfoliation can lead to micro-cuts and skin inflammation, it can result in skin hyperpigmentation,” Reszko said. “Instead, opt for using chemical exfoliants gently and in moderation. Look for those with alpha hydroxy acid and beta hydroxy acid, often shown on labels as AHA and BHA.” And if you’re really struggling to see an improvement, consider treatments like microdermabrasion, said dermatologist Dr. DiAnne Davis. “If someone is trying to aggressively exfoliate their skin, it could potentially make the hyperpigmentation worse. Microdermabrasion can help to remove the top layers of the skin to help with certain types of hyperpigmentation. It’s best done in the doctor’s office by the proper personnel.” As you’re reading labels on these products, keep an eye out for ingredients that have demonstrated positive results in helping to fade pigment. Marcus suggested looking for vitamin C, kojic acid, tranexamic acid, shiitake mushroom extract and alpha arbutin. Reszko said azelaic acid, a form of AHA, helps to even out skin tone and texture. And Nakhla suggested that “products with glycolic and lactic acid are best for combating pigmentation.” Badreshia suggested looking for products with mandelic acid, a gentle exfoliant. If you’re interested in something stronger, she said that hydroquinone, which requires a prescription, is a “potent skin-lightening agent that can be effective for stubborn hyperpigmentation.” She had advice for those just getting started with any new product: “Remember to introduce it gradually to avoid skin irritation, and always use sunscreen to protect your skin when using products that address pigmentation. It’s a good idea to consult with a dermatologist before using certain ingredients, especially prescription treatments like hydroquinone.” The doctors recommend the products below to help correct dark spots, discoloration and other pigmentation issues. HuffPost may receive a share from purchases made via links on this page. Every item is independently selected by the HuffPost Shopping team. Prices and availability are subject to change. By entering your email and clicking Sign Up, you're agreeing to let us send you customized marketing messages about us and our advertising partners. You are also agreeing to our Terms of Service and Privacy Policy.",
    "sentiment_val": -0.0085,
    "sentiment_sd": 0.2998,
    "month": "2024-09",
    "data$month": "2024-09"
  },
  {
    "url": "https://www.huffpost.com/entry/sophia-roe-culture-shifters-2020_n_663c00b2e4b0c38baf0edbd6",
    "published_date": "2024-09-18T19:46:17Z",
    "title": "Sophia Roe Has A Message For Influencers: Wellness Isn’t For Sale | HuffPost Entertainment",
    "text": " See the rest of the 2020 Culture Shifters list here.  .",
    "sentiment_val": 0.1091,
    "sentiment_sd": 0.1414,
    "month": "2024-09",
    "data$month": "2024-09"
  },
  {
    "url": "https://www.huffpost.com/entry/quinta-brunson-culture-shifters-2020_n_663c000be4b0c38baf0edb9e",
    "published_date": "2024-09-18T19:39:27Z",
    "title": "Quinta Brunson Is Imagining New Ways Forward For Black Women On TV | HuffPost Entertainment",
    "text": " See the rest of the 2020 Culture Shifters list here.  .",
    "sentiment_val": 0.1091,
    "sentiment_sd": 0.1414,
    "month": "2024-09",
    "data$month": "2024-09"
  }
]
